{
    "addr": "1201 South Figueroa Street  Los Angeles, CA 90015", 
    "title": "Anime Expo 2016 Registration - July 1st - July 4th", 
    "url": "http://www.eventbrite.com/e/anime-expo-2016-registration-july-1st-july-4th-registration-15641726826?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Anime", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "Anime Expo, also known as \"AX\", is the largest Japanese popular culture event in North America, and will?be held at the Los Angeles convention center July 1st - July 4th, 2016.? For the latest information about the Anime Expo, please visit our website at:? Anime-Expo.org     Premier Fan Pass Visit our Premier Fan Page for more information using the link below. You' can find the details on the 2016 tab. http://www.anime-expo.org/premier-fan/ ? Reminders     Please bring your printed registration confirmation for each attendee along with valid photo IDs. You may also use your smartphone access your registration confirmation using Eventbrite's mobile app. ? The only child attendee package we provide is the 4-Day Child Pass for a fee (children 5 and under are free of charge but still need to be registered). Purchase this for your child even if he or she is attending for just one day. ? All attendees under the age of 18 must be accompanied by an adult in order to pick-up a badge. All children under the age of 15 must be accompanied by an adult at all times. ? With the exception of the South Hall registration area, you must wear your badge at all times inside the convention center.   Registration Inquiries and Refund Requests: registration@anime-expo.org Log into your account to make any updates to your registration information.   General Inquiries:? http://www.anime-expo.org/contact-us/ ? ? FAQs ? What is the refund and transfer policy? Your refund request must be received within 30 days of your registration purchase date. ?After 30 days, you may still edit your registration or transfer your pass to the following year. ?Fees will be applied to transfers for the following year.? Deadline for any registration refunds, edits, and transfer, is June 1st, 2016 regardless of when the pass was purchased. ? ? All passes purchased after May 31st, 2015 are non-refundable and non-transferable to the next year. ? How do I request a refund?? Email your refund request to? registration@anime-expo.org . ? Dont forget to mention your f ull name & order confirmation number. ? ? Can I update my registration information? ? Yes, editing your registration is easy through Eventbrite! ? 1. Login to your Eventbrite account.? 2. Using the dropdown menu with your name, select \"Tickets\". ?? 3. Under the applicable order, click \"Manage Order\".? 4. Click \"Edit\" for the registrant you want to update. 5. Once you are finished, make sure you click \"SAVE\". ? Follow the link for step-by-step instructions with details, screenshots, and video!  http://help.eventbrite.com/customer/en_us/portal/articles/430100-how-to-update-your-ticket-registration-information ? Still having trouble? ?Contact Eventbrite Customer Support: ? https://www.eventbrite.com/contact-us/ ? (800) 350-8850 ?? ? Are there ID requirements or age requirements to enter the event? A valid photo ID, as well as your registration confirmation email, containing the QR code, is required to be presented to staff in order to receive your badge. Acceptable forms of identification include: Driver?s License, School ID, Work ID, Passport, Military ID, etc. ? Please purchase a 4-Day Child Pass for your child even if he or she is attending for just one day. Children ages 5 & under are free of charge while there is a fee for children ages 6-12. You must purchase an General Pass along with any Child Passes. ? All attendees under the age of 18 must be accompanied by an adult in order to pick-up a badge. All children under the age of 15 must be accompanied by an adult for the duration of their time at the event. ? Any programming designated 18+ will require attendees to show a valid photo ID in order to gain admittance.     Do I have to bring my printed ticket to the event? You may bring a printed to ticket for each attendee or use the eventbrite mobile app with your smart phone to the event in order pick up your badge. ? The name on the registration/ticket doesn't match the attendee. Is that okay? ? Your registration must match the attendee. Each attendee must bring their photo I.D. ? What are my transport/parking options getting to the event? Parking is available at the Los Angeles Convention Center. There are many public parking lots available in the surrounding area. Shuttle service will also be available for participating hotels. Please visit our website for updated information. ? What can/can't I bring to the event? Click here ?for our Code of Conduct. ? Where can I contact the organizer with any questions? Registration Inquiries:? https://www.eventbrite.com/contact-us/ General Inquiries:? http://www.anime-expo.org/contact-us/     Pre-Registration Badge Pick-Up Hours TBA Los Angeles Convention Center 1201 South Figueroa Street? Los Angeles, CA 90015"
}