{
    "addr": "Los Angeles, CA 90025", 
    "title": "Future Salon LA - SAVE THE DATE!!", 
    "url": "http://www.eventbrite.com/e/future-salon-la-save-the-date-tickets-3533630183?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-14T17:30:00-08:00", 
    "endtime": "2015-12-14T20:30:00-08:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "Future Salons  are produced by  SeaLight Enterprises ,  the leading Branding/PR and startup & small business?Funding consulting firm. The Salons are monthly educational and networking events, focused on existing, emerging and futuristic scientific, technological, entrepreneurial, or social topics and projects  worthy of your attention and support. We also cover critical-thinking, sustainability, social issues and occasionally longer-term scientific and philosophical topics. We bring  expert speakers from around the world  and open discussion around their topic. Our goal is to make our rapidly changing world more fascinating, manageable, profitable, understandable, and positive for all. We strive to be both doing-action-project oriented, and thinking-idea-prioritizing oriented. Come join our fun and useful discussions on key trends, innovations, and challenges. Work with and on new tools, practices, ideas and projects. See the future and seize the present. Grow your network of supportive, future-oriented friends. Sponsored by: ? Photos from some previous events : https://www.facebook.com/josieroman0/media_set?set=a.10151654798445040.1073741827.718650039 https://www.facebook.com/media/set/?set=a.10151544942190040.1073741826.718650039 ? https://www.facebook.com/media/set/?set=a.10151489988295040.1073741825.718650039 3D expert Mike Amron presents on 3D Motion Capture ? Education expert David Greenfield speaks on Museums & MOOCs Some of our cool attendees. ? About the Future Salon Network initiated by John Smart:  http://www.accelerating.org/futuresalon.html ? ? \r\n//"
}