{
    "addr": "Ketel One 1st Baseline Club. 1000 Elysian Parkway Avenue. Los Angeles, CA 90012", 
    "title": "Creating a Revenue Maximizing  Marketing Plan", 
    "url": "http://www.eventbrite.com/e/creating-a-revenue-maximizing-marketing-plan-tickets-18942831519?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-02T11:30:00-08:00", 
    "endtime": "2015-12-02T13:30:00-08:00", 
    "categories": [
        "Film, Media \\u0026 Entertainment", 
        "Meeting or Networking Event"
    ], 
    "desc": "TTMA and Cirque du Soleil present:? Marketing USA Live Entertainment Around the World via Cirque du Soleil Keynote Speaker:? Matthew Boone, Director of Tourism and International Sales, Cirque du Soleil Matthew Boone will share how Cirque du Soleil has successfully driven over 150 million guests to their shows and how they are marketing themselves around the world to drive International visitation to Los Angeles, San Francisco, Las Vegas, Orlando and New York through the promotion of USA Live Entertainment as a major destination motivator.? If you are a fan of the theatre, concerts, music festivals and professional sports, this is the presentation for you. Everyone who attends will receive  TWO COMPLIMENTARY TICKETS  to a Cirque du Soleil show in Las Vegas.? Where :? Dodger Stadium, 1st Base Kettle One Club (see parking instructions below) When: ? Wednesday, December 2, 2015 When: ? 11:30 to 1:30 Parking :?  Enter through the Sunset Gate A (intersection of Elysian Park Ave & Stadium Way) and stop at the visitor?s security gate at the far right side of the entrance.  * this is the only gate that is open on non-game days.  Tell the guard you are here for the TTMA meeting at the Ketel One First Baseline Club.? They will provide you with instructions through the parking lot that will take you Lot G/Right Field Side where you can park. You will see the Right Field gates where you can enter and you?ll see the Ketel One First Baseline Club on your left."
}