{
    "addr": "550 South Flower Street Los Angeles, CA 90071", 
    "title": "GRID110 FashionTech Hackathon", 
    "url": "http://www.eventbrite.com/e/grid110-fashiontech-hackathon-tickets-19199182271?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T13:00:00-08:00", 
    "endtime": "2015-12-06T18:00:00-08:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Game or Competition"
    ], 
    "desc": "Do you love fashion, technology and startups? Wearables, advanced materials, e-commerce, data science, biometrics and tech-infused avant-garde couture are all part of a wave of innovation that will revolutionize the $1.2T global fashion industry. Come get on the ground floor. GRID110, the Standard Hotel and the LA UX Meetup are joining forces to host one of the coolest Hackathons you'll ever see. Hackers will spend the night at the iconic DTLA hotel to come up with a FashionTech wearables prototype. Teams of 4 will present their prototype to a killer panel of judges, and the top teams will walk away with some amazing prizes! We're looking for fashion designers, programmers, engineers and industry market specialists. Unlike other Hacks, teams will not only mock up a Minimally Viable Product (MVP), but explain how their idea will penetrate and dominate the market. Presentations will begin at 4pm on December 6th during the cocktail mixer where Hackers can show their prototype, meet other cool techies and unwind after a crazy night. Sign up and let's get you on a team! Judges David Dea (Founding Partner,  PurCraft  and Professor,  FIDM ) Dori Howard (Founder,  Wade & Belle ) Mike Macadaan (Founder,  This Is Ground ) Noel Saw (Head,  LA UX Meetup ) Jason White (VP Marketing,  Beats By Dre ) Things To Remember ? We will be building prototype mock-ups, NOT actual? products. Hack Teams can present schematics, blueprints, websites, 3D mock-ups, slide presentations, etc. All Hack Teams will present their work on a simple website or presentation platform that will be screened to the audience during the Mixer at the end of the Hackathon. ? Hack Teams of 3-4 will be decided by GRID110/Standard Hotel. The point of the Hackathon is to inspire community and team-building in the DTLA FashionTech community. Interested Hackers can sign up according to their interests and skill sets. GRID110 will alert attendees of their Team leading up to the event. ? This is a Bring Your Own Technology (BYOT) event. Hackers are asked to bring their own laptops, hard drives, software, cloud storage, etc. The Standard Hotel will provide basics such as electricity, snacks, A/V equipment for presentations and other event amenities. GRID110/Standard Hotel will not be responsible for any lost, stolen or broken equipment, so it's important to safeguard your valuables. ? Hack Teams  can  bring in materials to mock-up a real prototype, provided such a mock-up does not require hazardous materials or fabrication, or any activity that would reasonably be considered disruptive or dangerous in a public hotel. Furthermore, such a mock-up will not give Hack Teams a special advantage in judging. ? Hack Teams will be required to present their mock-up during the judging portion of the Mixer. Teams will be asked questions about design, construction, materials, production viability, market viability, business plans and so on. Judges will decide the winners of the Hackathon at their sole discretion. ? There will be a 1st, 2nd and 3rd place for Hack teams. All prizes are gifted at the sole discretion of GRID110/Standard Hotel and are subject to change. ? There will be a strict code of conduct during the Hackathon. Abusive, sexually explicit, bullying, discriminatory, hateful or otherwise unfriendly behavior toward fellow Hackers, judges, organizers or others' property will not be tolerated. Any attendees who display such behavior will be asked to leave, and their Attendance Fee will not be refunded. ? By signing up for the Hackathon, and paying the Attendance Fee, you consent to the above. Special thanks to our partners and sponsors:? The Standard, Downtown LA ,? Los Angeles User Experience ,? Silicon Valley Bank ,? Strategic Law Partners, LLP ,? TechJobsLA.com ,? LA Tech Digest ,  General Assembly ,  Califia Farms ? Premier Partners Contributing Sponsors Community Partners Media Partner"
}