{
    "addr": "1150 South Olive Street. 4th Floor. Los Angeles, CA 90015", 
    "title": "California’s New Asset Building Tools: Putting the Secure Choice Retirement Plan and the New State EITC to Work", 
    "url": "http://www.eventbrite.com/e/californias-new-asset-building-tools-putting-the-secure-choice-retirement-plan-and-the-new-state-tickets-19047081333?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-01T09:30:00-08:00", 
    "endtime": "2015-12-01T15:00:00-08:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "Dear United Way Partners and Friends, Join asset building practitioners, advocates and funders for a? conference on helping families and individuals build assets ?and plan for the future through two new programs. California Treasurer John Chiang and Controller Betty Yee will join other special guests on Tuesday, December 1 to discuss the laws, the need and what is necessary for successful implementations. The event, to be held from 8:30am ? 3pm,?is being hosted by?United Ways of California, California Asset?Building Coalition, California Budget & Policy Center, Asset Funders Network and Southern California Grantmakers.? The day will begin with a brief?summary of who the eligible Californians are?what families and individuals these two programs are designed to help?and their financial needs (based on data from? Struggling to Get By: The Real Cost Measure in California 2015 ).? From 10am to 12pm,? State Treasurer John Chiang ,? Marisabel Torres ?(National Council of La Raza), and ?Christopher Brown ?(PolicyLink)?will lead a conversation on the retirement crisis and how the? California Secure Choice Retirement Program ? can solve it. In California today, 7.5 million private-sector employees?two-thirds of whom?are persons of color?lack access to employer-sponsored retirement plans. Secure Choice is a voluntary, portable retirement savings plan for employees that would encourage participation through automatic enrollment (with opt-out)?and payroll deductions. The Secure Choice Retirement Savings Investment Board has spent this past year studying the feasibility of a retirement savings plan and will be making their recommendations to the State Legislature early next year. Part of the process is hearing from stakeholders so the the Board can ensure that the program meets participants' needs. This will be an opportunity to not only hear about the proposal but provide feedback before the bill is introduced.? From 1pm to?3pm,? State Controller Betty Yee ,? Pete Manzo ?(United Ways of California),? Chris Hoene ?(California Budget & Policy Center)?and? Christopher Brown ?(PolicyLink) will review the need, background and forthcoming implementation of? California's new refundable state Earned ?Income Tax Credit ?(EITC), ?that begins in 2016 for 2015 tax filings. Signed into law this year through the Governor's budget, this tax credit is available to California households with adjusted gross incomes of less than $6,580 if there are no qualifying children, less than $9,880 if there is one qualifying child, or less than $13,870 if there are two or more qualifying children. In this session, speakers will look at strategies to reach eligible low-income workers and engage participants in a discussion of how practitioners, advocates and funders can all help to ensure a successful rollout in the coming months.? ? Continental breakfast, lunch and refreshments will be served. Join us for this very informative and engaging conference!? Please note seats are extremely limited on a first come, first serve basis?so register today . Click here to read the full agenda . Please note seats are extremely limited and available on a first come, first serve basis. Due to building security, we are unable to accept walk-ins on the day of the event. Thank you."
}