{
    "addr": "5333 Zoo Dr Los Angeles, CA 90027", 
    "title": "L.A. Zoo Lights - Family New Year's Eve!", 
    "url": "http://www.eventbrite.com/e/la-zoo-lights-family-new-years-eve-tickets-18957963780?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-31T18:00:00-08:00", 
    "endtime": "2015-12-31T21:00:00-08:00", 
    "categories": [
        "New Years Eve", 
        "Attraction"
    ], 
    "desc": "LA Zoo Lights Family New Year's Eve Bring the whole family to celebrate New Year?s Eve in the L.A. Zoo surrounded by Zoo Lights. This separately ticketed event includes skip the line admission, dinner buffet, soft drinks, dessert, carousel ride, crafts, DJ and a live broadcast of the East coast ball drop at 9 pm. Toast the ?new year? with champagne for the adults (21+) and sparkling cider for the youngsters. Photo op and cash bar also available. After the party, guests are welcome to experience Zoo Lights until closing at 10 pm. ? L.A.?s brightest holiday tradition shines more brilliantly than ever! Stroll through an expanded area of the Zoo that is transformed into a fantastical wonderland populated by glowing light animals and a trove of dazzling additions over last year, such as a decked-out L.A.I.R. and a dramatic display combining light, water and music. View real reindeer?and enjoy holiday treats and goodies, all under the stars.? This is a rain-or-shine event. No rain checks will be issued. Since L.A. Zoo Lights is a special evening event, the only animals on display will be  the reindeer at Reindeer Romp Village? and the critters within the L.A.I.R. The rest of the Zoo?s animals will be off exhibit and snug in their beds. (Note: Electric animals will be present.) For groups of 50 or more,?please contact group sales at:  groupsales@lazoo.org Looking for a different date? View our  calendar of dates . To learn more, please view the? L.A. Zoo Lights website . Terms and Conditions Still have questions about L.A.?Zoo Lights? Visit the L.A. Zoo Lights FAQ page at:  lazoolights.org/faq , or contact the Greater Los Angeles Zoo Association (GLAZA) via our? contact page ."
}