{
    "addr": "1201 South Figueroa Street Los Angeles, CA 90015", 
    "title": "VRLA Winter Expo", 
    "url": "http://www.eventbrite.com/e/vrla-winter-expo-tickets-18239818789?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-23T12:12:00-08:00", 
    "endtime": "2016-01-23T18:12:00-08:00", 
    "categories": [
        "Other", 
        "Convention"
    ], 
    "desc": "Come experience the latest in? virtual reality ?and immersive technology from the leading companies in the industry at? VRLA Winter Expo , the world's largest VR expo . The event will feature cutting edge? demos of the most exciting projects in development for the Oculus Rift, Google Cardboard, Samsung GearVR, HTC Vive, and more. ? The day will also be stacked with a lineup of illuminating presentations, panels, and workshops! ? VIP tickets include early entry to the expo floor at 11:00 AM and a gift bag filled with a VRLA t-shirt and other VR goodies. ? The opening remarks, keynote presentation, and more announcements will start at 12:00 PM, with the expo floor opening to GA ticket holders at 1:00 PM. Past exhibitors include:? LIABILITY RELEASE: By attending Virtual Reality Los Angeles Winter Expo 2016 (AKA ?VRLA?) at Los Angeles Convention Center on January 23, 2016, you release VRLA, The Virtual Reality Foundation, Inc., The Los Angeles Convention Center, all of the event?s organizers, volunteers, employees, exhibitors, vendors and contractors from any and all liability ? financial or otherwise ? that may arise from my attendance at the above mentioned event. You are hereby aware that some people experience nausea, disorientation, motion sickness, general discomfort, headaches or other health issues when experiencing virtual reality. Your entry signals your agreement to take full responsibility for these or any other consequences that may arise from attendance at VRLA. Be aware that some content being exhibited is in unfinished, prototype state, and may heighten the above sensations. Demo experiences are explicitly not intended for users under 13 years of age, and your entry signals your agreement to take full responsibility for any use of virtual reality or any other technologies exhibited at VRLA by any minors in your care. By remaining on the premises you agree you will not pursue legal action against VRLA, The Virtual Reality Foundation, Inc., The Los Angeles Convention Center, any of the event?s organizers, volunteers, employees, exhibitors, vendors or contractors for any damages ? real or perceived ? arising from attendance at VRLA. If you do not wish to be subject to the foregoing, please do not enter. FILMING RELEASE By entering this area you irrevocably consent to, and authorize without compensation, The Virtual Reality Foundation, Inc., its successors, assigns, and other film crews permitted by the Virtual Reality Foundation to film here today, to use your likeness, voice, and to make video and audio recordings of your attendance here today. You are hereby aware of such recording, and relinquish your rights to any compensation for any release of these recordings in any media now extant or to be devised in the future. If you do not wish to be subject to the foregoing, please do not enter."
}