{
    "addr": "665 West Jefferson Boulevard Los Angeles, CA 90007", 
    "title": "Quinceanera.com Expo and Fashion Show Los Angeles 2016 FREE!", 
    "url": "http://www.eventbrite.com/e/quinceaneracom-expo-and-fashion-show-los-angeles-2016-free-tickets-18749390933?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-06-05T12:00:00-07:00", 
    "endtime": "2016-06-05T17:00:00-07:00", 
    "categories": [
        "Fashion \\u0026 Beauty", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "PLAN YOUR PARTY Shop numerous? Quincea?era vendors ?all in one place. Save time comparing party planning services and take advantage of our expo discounts! Explore the various options for venues, invitations, party favors, video & photography, transportation, travel packages, and sample potential cake and catering services. QUINCE FASHION SHOW Enjoy the exclusive Quincea?era Fashion Show featuring unique Quince dresses. The? Quinceanera.com ?Expo and Fashion show is the only Quincea?eras expo in tune with the latest trends in everything Quinceanera related. The show loosely switches from English and Spanish in a way that attracts both the Quince?eras and their parents. VIP AND INTERACTIVE EXPERIENCE Preferred Seating is an area reserved for Quince girls where they can enjoy the Quince Fashion Show with an up-close look at the dresses as they come down the runway. These Preferred Seating badges are awarded the day of the Expo through social media contests. Use our event hashtag #XVExpoLA16 on your pictures and post and they will be seen from screens placed on the runway and throughout the venue. FREE STUFF, RAFFLES AND GRAND PRIZES Post #XVExpoLA16 on? Facebook, ? Instagram, ?and? Twitter ?for a chance to enter multiple raffles and contests, the more you post the better your chances are to win! Upon check-in, an Expo bag with quince freebies will be handed to all quincea?eras! Make sure to keep an eye out and participate in the numerous on-stage raffles and fill up that goodie bag! Gift certificates to spas, amazing discounts for Quince dresses, complimentary hair and makeup sessions are some of things you can win. In the past, complete Quincea?era parties valued at $7,000 have been awarded during the sh ow, along with great photography and video packages. Register Now!"
}