{
    "addr": "Los Angeles , CA  90001", 
    "title": "Los Angeles Tech Security Conference 2016", 
    "url": "http://www.eventbrite.com/e/los-angeles-tech-security-conference-2016-tickets-18134763566?aff=ebrowse", 
    "location": "Los Angeles , CA", 
    "starttime": "2016-01-14T08:00:00-08:00", 
    "endtime": "2016-01-14T17:00:00-08:00", 
    "categories": [
        "Science \\u0026 Technology", 
        "Conference"
    ], 
    "desc": "2016 Los Angeles Tech Security Conference This conference qualifies for CPE credits! ? Passes include a full lunch, entrance into the?main conference room and all conference material. ? Program Description: ? Data Connectors will be hosting the Los Angeles Tech Security Conference on Thursday, January 14th. The event will start at 8:15 AM with a check-in and opening introductions before presentation sessions begin at 8:45. Between the educational sessions that go throughout the day, there will be time to visit vendor booths to obtain information regarding product and service offerings. ? Event Sponsors/Vendors include: ???   ??  ???  ??????? ???  ??? ????  ?????  ????????  ????????  ??????  ??????????  ?????? ???  ?? ????  ?????????  ?????  ????  ?????  ? Click here for a full Los Angeles agenda When you register to attend a Data Connectors vendor-sponsored conference, your event registration information is used to confirm registrations and may be used to send product information and promotional material. (Information may also be used to compile broad demographic information). As Data Connectors may disclose your event registration information to those vendors sponsoring the event, Data Connector's customer agreement with the Sponsor provides that the Sponsor (a) may use this information only to send you product information, to contact you via common methods of communication to assess your interest in its products and services, and (b) may share this information with a business partner, reseller or distributor of its products and services for the permitted marketing purposes set forth above. You should contact the Sponsor directly if you have any questions about their use of this information."
}