{
    "addr": "Los Angeles, CA", 
    "title": "PAST DUE PAYMENTS in COLLECTIONS -  Business Codex Workshop Credit Defaults Now Due. Please Pay Now!", 
    "url": "http://www.eventbrite.com/e/past-due-payments-in-collections-business-codex-workshop-credit-defaults-now-due-please-pay-now-tickets-567959783?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2014-01-01T08:30:00-08:00", 
    "endtime": "2015-12-31T23:30:00-08:00", 
    "categories": [
        "Class, Training, or Workshop"
    ], 
    "desc": "f ? If your name appears on the above ticket list...You have an outstanding balance that needs to be paid for your participation in the Business Codex Program.  Please stay in honor and pay your?past due amount above in order to get access to the second half of the training along with the bonus documents & continuing education video training modules. Thank you. ? Here's a Slideshow of a recent Business Codex Live Workshop!   ? ? ? \"Illuminati Control Package\" Learn what items to include When Applying for Business Credit Cards or Loans. \"New Currency Consciousness\" The U.S. Dollar May not be the World's Standard for Much Longer. Learn to Protect your Nest Egg! \" The Fountainhead Approach\" This Private Strategy shows you the Exact Sequence of Applying for Credit. Must Follow Exactly or FAIL! \"Personal Credit Cipher 18\" Learn the Secret \"Point System\" that Every Credit Application has & how to Increase APPROVALS! \" Templar Codex Scripts\"   How to Talk to CREDITORS to Increase Credit Limits & How to Get them off Your Back if you OWE! \"Cheap Uncle Template\"   If you're operating on LIMITED FUNDS.....I Show You How to Create CASH Quickly & Ethically \"The C.P.R. Secret\" This Contain, Prepare, & Restructure concept will teach you how to literally?\"Become the Bank!\" \"Mental Wealth Foundation\" ? This concept will Prepare you to Receive Abundance & Prepare you to Attract & Create MONEY Now!\" \"The Knighthood Initiation\"  This concept initiates you into the NEW World of Global Banking & Finance & How to Play the Game!? \" The Rothschild Leveler Method\" This is your 40 Step Action Plan Sequence. It?puts your corporation on the MAP toward funding. \"The Incredible Fortress\" This concept will build you FREEDOM, MONEY, & TIME in your LIFE. Your Family Legacy begins here! \" Commerce Continuum\" Learn about the Occult World of Commerce that Runs the Globe. Learn to CONTROL or be Controlled. \" World Bank Loop\" This concept will?Help you?Understand?how Fiat Reserrve Money is Created & to Get More of it.?? \"The Constellation Five\" Learn the Rules?of The?5 Law Forms & Jurisdictions that Govern YOU from Birth! How to WIN! \"The Federal Reserve Strategy This concept?builds on?\"How to Become the Bank,\" You learn to Grow Your Money Like \"The FED!\" \" Rockefeller Dynasty Pattern\" This concept will Teaches you Asset Protection & How to run a Pattern of 5 Corporations Corrrectly. \" The Bueno Method\" -   Putting it all Together?How I Started buying Apartment Buildings 12 Years Ago,?with The Business Codex! ? I?will be selecting a?small group of leaders to teach these secret techniques to in?the Mastery Class.?  I'm?aiming for 12 people. Will you be one of the few?"
}