{
    "addr": "1201 South Figueroa Street Los Angeles, CA 90015", 
    "title": "The Yoga Expo 2016 Los Angeles", 
    "url": "http://www.eventbrite.com/e/the-yoga-expo-2016-los-angeles-tickets-17840145355?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-03T10:00:00-08:00", 
    "endtime": "2016-01-03T18:00:00-08:00", 
    "categories": [
        "Yoga", 
        "Class, Training, or Workshop"
    ], 
    "desc": "The Yoga Expo Los Angeles is an all-day yoga event featuring local & national teachers. Studios showcase their unique styles of mind & body practice. The Expo at the Los Angeles Convention Center serves as a platform to empower and strengthen the LA yoga community. Connect with local teachers, bring a friend (or make one), explore yoga studios in your area, and taste local and sustainable food & beverages. Whether you're and experienced yogi or are brand new to practice, we've got you covered. We offer 150+ classes & workshops led by an wide variety of experienced teachers from LA & beyond. Remember to bring your mat. Meditation is an approach to training the mind, similar to the way that fitness is an approach to training the body. But many meditation techniques exist. So how do you learn how to meditate? Our classes and workshops combine simple, effective meditation techniques and ancient spiritual wisdom for the modern world. We offer countless approaches to meditation, your welcome to explore! As you may know, there's no shortage of health benefits to be had from regular yoga sessions. Still, for optimal health results, it's important to incorporate a variety of exercises into your routine. Explore our full lineup of fitness classes to discover aerobic, anaerobic, and resistance training programs as well, in addition to flexibility and core-building exercises like yoga. Your day wouldn't be complete without and extensive variety of food available for your purchase. Organic, non-GMO, gluten-free... you'll find it all at the Yoga Expo. The Yoga Expo offers healthy cuisine throughout the festival, whether you're grabbing a quick bite from the hand-picked vendors or indulging in a food experience within our VIP lounge."
}