{
    "addr": "1627 N. Gower St. Los Angeles, CA 90028", 
    "title": "A Taste of Belly Dance: Los Angeles, 2016", 
    "url": "http://www.eventbrite.com/e/a-taste-of-belly-dance-los-angeles-2016-tickets-18894974377?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-16T13:00:00-08:00", 
    "endtime": "2016-01-16T18:00:00-08:00", 
    "categories": [
        "City/Town", 
        "Concert or Performance"
    ], 
    "desc": "The 5th Annual \" A TASTE OF BELLY DANCE \" festival and gala will again be bringing people together to?celebrate the art and culture that belly dance creates within our community. Our hope is to make learning and exploring this diverse and unforgettable culture easily accessible to everyone! Currently our spotlight is on the beautiful city of Los Angeles, with its explosion of passion for the arts. ?Future aspirations of disovering the talent in other counties within our belly dance community are in the works. ? ? CATERING,  TASTE CULTURAL GALLERY  & VENDING ? from ? 1:00P M  to   6:00 PM FESTIVAL SHOW from   1:00 PM  to   4:00 PM TASTE OF HISTORIC ROOTS SHOWCASE from   4:15 PM  to   6:00 PM ? ? OFFICIAL? TASTE ?VENUE THIS YEAR, WE WILL BE CELEBRATING IN THE BEAUTIFUL CITY OF DREAMS... L.A. Mother 1627 N. Gower St. Hollywood, CA 90028 ? Located in the heart of Hollywood by the Walk of Fame, we knew that this beautiful urban warehouse with a goal to serve the community would be just the place for our 5th year celebration! ? ? ? As we do every year, a portion of our ticket sales goes to a charity that we support! This year we are glad to announce that we will be donating to DirectRelief, an organization dedicated to improve the health and lives of people affected by poverty or emergency situations by mobilizing and providing essential medical resources needed for their care. Please help us to support an organization that reaches out and provides assistance to those suffering the effects of natural or man-made disasters.  <3 ? ? OFFICIAL? TASTE ?PHOTOGRAPHER GRAPHIC VIBE LA ? ? OFFICIAL? TASTE ?CATERER YALLA FOOD TRUCK ?Go from ZERO TO FALAFEL! This year we are so pleased to have the Yalla Truck back with us! They've got delicious eats for Vegans, Veggies and Meaty McMeatersons! Check out the menu at: www.yallatruck.com ? A  TASTE  OF THE HISTORIC ROOTS OF BELLYDANCE GALLERY An interactive cultural gallery based off of Aubre Hill's \"Historic Roots of Bellydance\" lecture ? ? ? ? PARKING /  TRANSPORTATION ?INFO Go Metro and save $5 on admission!? ? For your best route o r more info, visit the? Metro Trip Planner ? or call (323) Go Metro or? (323.466.3876 ). Show your valid TAP card, Metro employee ID, or LA County employee ID to the cashier and save $5 on your admission ticket! PARKING There will be all-day public parking available for $10...right next door to the venue!  Carpool  with friends and save! ? ?? More Info: ? ? ? \"Taste\" vendors and performance line-up to be announced!? ? ? ? ? ? ? Unforgettable Is The Standard. 2015"
}