{
    "addr": "570 Westwood Plaza Los Angeles, CA 90095", 
    "title": "Lunch-N-Learn Seminar Series for UCLA Faculty Entrepreneurs", 
    "url": "http://www.eventbrite.com/e/lunch-n-learn-seminar-series-for-ucla-faculty-entrepreneurs-tickets-19478964106?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-01T12:00:00-08:00", 
    "endtime": "2015-12-01T13:00:00-08:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Seminar or Talk"
    ], 
    "desc": "OIP-ISR Lunch-N-Learn Seminar Series for UCLA Faculty Entrepreneurs ? Date: ? December ?1 , 2015 Time:  12:00pm - 1:00pm Location:  CNSI at UCLA - 5th Floor Presentation Room Topic: ? \"What Entrepreneurs Need to Know about Intellectual Property \" UCLA?s ( OIP-ISR ) and  CNSI ? are pleased to host a Lunch-N-Learn seminar series for entrepreneurially-minded UCLA faculty and postdocs.? The series covers the basic steps involved in starting a company.? Each seminar will be presented by law firms with extensive experience in the startup arena.? Series schedule: ? December 1 - \"What Entrepreneurs Need to Know about Intellectual Property\" Lunch & Learn Speaker ? ? Kevin DeBre, Esq.,  Stubbs Alderton & Markiles, LLP Kevin D. DeBr?  is the chair of the Firm?s Intellectual Property & Technology Transactions Practice Group. Kevin advises entrepreneurs and companies that use intellectual property to build their businesses. Kevin has particular expertise in structuring and negotiating technology commercialization and patent licenses, strategic alliances, research and development collaborations, trademark licensing and brand merchandising agreements and manufacturing, distribution and marketing arrangements. He also counsels clients on compliance with data security and privacy laws and regulations.   Kevin is a business lawyer, a registered patent lawyer and a former engineer. He focuses on representing software companies, semiconductor design firms, mobile commerce businesses, e-commerce enterprises, electronics and hardware manufacturers, media companies, content developers and publishers, biotechnology companies and medical device manufacturers both in the United States and abroad."
}