{
    "addr": "1925 W Olympic Blvd. Los Angeles, CA 90006", 
    "title": "2015 KSEA-SC End-of-Year Member Appreciation Party", 
    "url": "http://www.eventbrite.com/e/2015-ksea-sc-end-of-year-member-appreciation-party-tickets-19227983416?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-19T17:00:00-08:00", 
    "endtime": "2015-12-19T21:30:00-08:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Meeting or Networking Event"
    ], 
    "desc": "Dear KSEA-SC Members It's that time of the ? year ? again! Please join us for our ? End -of- Year ? Member Appreciation ? Party ? on December 19th, 2015 (Saturday). All KSEA-SC members, spouses, children, and friends are invited to a wonderful banquet space at the Secret Garden.  A few highlights of the event are:  - Bottom-less food (Sushi, Korean BBQ, wine, and more)  - Plentiful Gift  - KSEA-SC band  - Karaoke, and More?  Please join us for this once-a- year ? festivities to meet and greet your friends, colleagues, KSEA members and their spouses!  Date: Saturday, December 19, 2015 at 5:00 pm ? 9:30 pm  Venue: Secret Garden Buffet and Banquet  Address: 1925 West Olympic Boulevard, Los Angeles, CA 90006  (Phone: ? 213-386-1100 )    Event Fee (Same as last year):  - General Members: Single $40, Couple $60 ? - Students: $0 Complimentary  - Non-KSEA Members: Single $60, Couple $80  - Note: Additional $10 without RSVP  RSVP ? by December 12th (online)  at ? http://2015-kseasc-eoy-party.eventbrite.com ?  Please make your check payable to KSEA-SC?and send it to the address below by December 15 (or you can pay at the venue using either a personal check or cash). ? KSEA-SC 10571 Beatrice Street Cypress, CA 90630  Please register or renew your membership at ? https://www.ksea.org/login.aspx . To show your current membership status and get membership discount, print your KSEA membership card from ? https://www.ksea.org/login.aspx ? and show it to us when you sign-in.  Looking forward to seeing all of you at the ? Year ? End ? Party !  Thank you.  Jinlee Kim  KSEA-SC Chapter President 714-399-5426 (Cell)"
}