{
    "addr": "10833 Le Conte Ave. Los Angeles, CA 90095", 
    "title": "The Architecture of World Health", 
    "url": "http://www.eventbrite.com/e/the-architecture-of-world-health-tickets-17888913221?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-02T12:00:00-08:00", 
    "endtime": "2015-12-02T13:00:00-08:00", 
    "categories": [
        "Medical", 
        "Seminar or Talk"
    ], 
    "desc": "Thomas J Coates, PhD Thomas J. Coates, PhD, is Director of the UCLA Center for World Health, which advances the international and global health mission of the David Geffen School of Medicine and UCLA Health. He is Co-Director of the University of California Global Health Institute, which advances the mission of the 10-campus UC system to improve the lives of people in California and around the world. He is the Michael and Sue Steinberg Endowed Professor of Global AIDS Research within the Division of Infectious Diseases at UCLA. He co-founded the Center for AIDS Prevention Studies at UCSF in 1986 and directed it from 1991 to 2003, and was the founding Executive Director of the UCSF AIDS Research Institute, leading it from 1996 to 2003. His areas of emphasis and expertise are global health, HIV prevention and its relationship to treatment, and international health policy. With funding from USAID and WHO, he led a randomized controlled trial to determine the efficacy and cost-effectiveness of HIV voluntary counseling and testing for individuals and couples in Kenya, Tanzania, and Trinidad. He has just completed directing a 48-community randomized clinical trial (NIMH Project Accept/HPTN 043) in South Africa, Zimbabwe, Tanzania, and Thailand to determine the impact of strategies for mobile HIV voluntary counseling and testing and for changing community norms on HIV incidence at the community level. ? Dr. Coates was cited in Science in 2002 as the 4th-highest-funded scientist in the clinical, social, and behavioral sciences. He was elected to the Institute of Medicine (IOM) in 2000, and has served on the IOM?s Board on Global Health."
}