{
    "addr": "2980 Los Feliz Blvd.  Los Angeles, CA 90039 ", 
    "title": "CUIC December 9, 2015 Holiday Event", 
    "url": "http://www.eventbrite.com/e/cuic-december-9-2015-holiday-event-tickets-19023705415?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-09T12:00:00-08:00", 
    "endtime": "2015-12-09T15:00:00-08:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Seminar or Talk"
    ], 
    "desc": "CUIC Annual Holiday Luncheon  December 9, 2015? ? ? You are Cordially Invited to Join Us? Wednesday, December 9, 2015 ? LOCATION & TIME The Tam O?Shanter Bonnie Prince Charlie Room 2980 Los Feliz Blvd, Los Angeles, CA 90039 12:00 pm Social? 12:30 pm Luncheon 3:00 pm Adjourn ? LUNCHEON PRESENTATION: ? CALIFORNIA UNEMPLOYMENT INSURANCE  APPEALS BOARD UPDATE ? ? ? Presented by ? Elena Gonzales , ? Executive Director/ Chief ALJ?for the California Unemployment Insurance Appeals Board Robert Dresser,  Board Chair for the California Unemployment Insurance Appeals Board ? SPEAKER BIOS: ? On July 1, 2014 the Governor reappointed Robert Dresser to the Board where he has served as member and Chair since 2011. Robert Dresser brings an enormous amount of experience and familiarity with CUIAB to the department. He most recently served as Enforcement Counsel for the Contractors State Licensing Board from 2007 until his appointment as Chair of CUIAB. From 2002 to 2007, he served as General Counsel to the Labor and Workforce Development Agency (LWDA). This agency oversees CUIAB and the Employment Development Department. He previously served as Chief Counsel (and former Interim Director) to the Department of Information Technology (DOIT) where he served as a senior legal advisor to the Director and State Chief Information Officer. From 1992 to 2001, Chair Dresser was an Administrative Law Judge at CUIAB assigned to the Appellate Unit. From 1975 to 1992, he held different assignments at the Agricultural Labor Relations Board (ALRB). From 1984 to 1992, he was ALRB Senior Board Counsel III and from 1981 to 1987, he was the Supervising Attorney for the ALRB Office of the Executive Secretary. From 1978 to 1981, he was the Director of the ALRB Office of Agency Communications. Between 1976 to 1978, Chair Dresser served as the Regional Director of ALRB's Fresno Office after starting at ALRB in 1975 as a Staff Counsel. Chair Dresser began his California legal career in 1969 as an attorney for Community Legal Services in San Jose, California.  Prior to practicing law in California, Chair Dresser served as a VISTA lawyer in Austin, Texas and was instrumental in the start of the Texas Rural Legal Aid program. He is a graduate of Stanford Law School and holds a Bachelor of Arts from Dartmouth College. ? ? GREAT PRESENTATION, GREAT FOOD, GREAT PRIZES ? ? ***Toy Drive*** Please bring an unwrapped toy(s) ? Toys will be collected for local children in need ?? ? ? ? RESERVATIONS:? ? Register NOW as seating is limited ? ? Please register by Monday,?November 30, 2015  ? ? ? Fees for paid reservations are non-refundable."
}