{
    "addr": "Los Angeles, CA", 
    "title": "Annual Theodore Payne Native Plant Garden Tour | April 2-3, 2016 | 10AM-5PM", 
    "url": "http://www.eventbrite.com/e/annual-theodore-payne-native-plant-garden-tour-april-2-3-2016-10am-5pm-tickets-18135025349?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-04-02T10:00:00-07:00", 
    "endtime": "2016-04-03T17:00:00-07:00", 
    "categories": [
        "Home \\u0026 Garden", 
        "Tour"
    ], 
    "desc": "Annual Native plant garden tour   The Theodore Payne Native Plant Garden Tour is a unique adventure: a two-day self-guided journey through Los Angeles region?s most beautiful and inspiring home landscapes. At each location, you?ll meet garden owners, designers, knowledgeable docents and fellow gardeners. You'll learn about native plants, garden design, and wildlife habitat.?      Planning Your Tour The gardens are divided into two groups: one open Saturday, April 2, and a second open Sunday, April 3, 2016. Tour hours are 10:00 a.m. to 5:00 p.m. each day. A ticket allows you into gardens on both days. How to Attend All tour tickets cover both days of the tour. Pricing is as follows: EARLY BIRD TICKETS? ?  before January 1st ? ??????  Single tickets : $25/person for members and students, $30/person for non-member ? ??????  Group tickets ? for groups of seven or more: $25 each REGULAR TICKETS ? ?  after January 1st ? ??????  Single tickets :? $30/per person for members and students; $35/person for non-members. ? ??????  A pair of tickets? (two tickets): $50 for members; $60 for non-members. New This Year : SPONSOR A TICKET Sponsor a ticket (at $15/person) for someone not normally able to purchase one for him or herself. TPF will distribute tickets through the Foundation's school and community partners. Each ticket includes admission for a single visitor to all gardens across both days , and a printed color guide with addresses and driving directions. The tour is self-guided so you can make your own itinerary and go at your own pace. Children under 16 do not require a ticket. Ticket Sales  in-person or by phone If you purchase tickets in person or by calling 818-768-1802 ext 15, we will waive the processing fees! You can buy tickets at Theodore Payne Foundation in Sun Valley. Photography Policy Photography permitted for personal use only. Any photos used for web or other media must be credited to the Theodore Payne Native Plant Garden Tour. What do these gardens look like? To see photos, please visit? http://www.nativeplantgardentour.org/? Garden Tour Sponsors include: ??? ?? Contact the Tour Coordinator If you have feedback or suggestions about the Tour, ideas for new gardens, or if you?d like to learn how to become a sponsor of next year?s Tour, please e-mail Tour Coordinator Margaret Oakley Otto at? gardentour@theodorepayne.org . We would love to hear from you!     Image ? Gene Bauer"
}