{
    "addr": "1021 Abbot Kinney Blvd Los Angeles , CA 90291", 
    "title": "Star Wars Under the Stars", 
    "url": "http://www.eventbrite.com/e/star-wars-under-the-stars-tickets-19664579286?aff=ebrowse", 
    "location": "Los Angeles , CA", 
    "starttime": "2015-12-03T17:30:00-08:00", 
    "endtime": "2015-12-15T21:00:00-08:00", 
    "categories": [
        "Film", 
        "Screening"
    ], 
    "desc": "Watch all 6 STAR WARS films in 6 nights over a two week period and raise money for a community park!? This is how you want to get ready for the upcoming release of STAR WARS VII The Force Awakens. NOTE: We will be watching the film using silent radio frequency headphones like the ones used at a silent disco. Join us for one, several or all movies as we watch them under the stars in the outdoor Venice Pop Up Park ( www.venicepopuppark.com ).? We will have hot chocolate and hot cider available for all guests and wireless headphones will be provided for all movie watchers.? All profits will go to the Venice Pop Up Park.?  Only 20 tickets available for each event so reserve quickly, these will go fast.   This event is outdoors so dress warmly, bring blankets and any food or drink you like. FAQs What time does the movie start playing For  weeknight  dates we start the film precisely at 7pm for  weekend  dates we start the film precisely at 6pm. We open the doors an hour before the film begins.  What are my transport/parking options getting to the event? We recommend biking or taking Uber/Lyft.? Venice street parking can be a nightmare. No parking is available for these events but there is a valet lot behind the park accessible from Electric Ave.  What can/can't I bring to the event? Bring things that will keep you warm.? There are 4 space heaters but they won't cover the whole area Where can I contact the organizer with any questions? Contact Ian Murphy at (310) 689-6397 or murphian@gmail.com Is my ticket transferrable or refundable? Transferable yes, refundable no.? For transfers email Ian Murphy (murphian@gmail.com) with the name and email of the person taking your ticket. We can't issue refunds so if you can't make it for some reason please let us know.? We only have 20 tickets to each film and it would nice to get that spot to someone on the waiting list that can make it. We know things come up last minute so please don't be shy and email or call us ((310) 689-6397 or murphian@gmail.com) and let us know you can't make it."
}