{
    "addr": "1933 S. Broadway Los Angeles, CA 90007", 
    "title": "CoffeeCon L.A. 2016", 
    "url": "http://www.eventbrite.com/e/coffeecon-la-2016-tickets-19325237305?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-30T09:00:00-08:00", 
    "endtime": "2016-01-30T16:00:00-08:00", 
    "categories": [
        "Other", 
        "Festival or Fair"
    ], 
    "desc": "This coffee tasting and brewing extravaganza features many of Los Angele?s finest specialty roasters, numerous hands-on labs and classes, and engaging dialogue between consumers and specialty-coffee leaders. High-end coffee brewers and other gear will be given away during our prize giveaways. All our welcome; this is an inclusive event for  all  levels of coffee drinkers?from? novice to expert.? CoffeeCon ?is the world's first coffee festival whose focus is on  coffealogy (from Latin ?coffea? for coffee; and from Greek ? -????? ,? -logia) for the  consumer.  While many other coffee-themed events are largely business-focused, CoffeeCon is focused on the enjoyment and enrichment of all coffee consumers wishing to learn more about? coffealogy  and their options as highly conscious coffee drinkers.  Try everything? by tasting 100 different coffees from both local and national specialty roasters  side-by-side . Experience coffee varying in nearly every conceivable variable; from bean varietal, to growing practices, processing methods, roast profile, and brewing methods?you will literally drink the cost of the admission fee and enjoy the rare opportunity to thoroughly compare coffees brewed to perfection . CoffeeCon's  classes are a big part of your value in attending. Pick and choose from different classes and topics running continuously throughout the day. Top baristas?teach hands-on pour over labs where everyone gets to try out the gear and refine their brewing skills.  No advance registration or extra fees.  General admission is all you need.  Prizes:  $3000+ in top-model coffee brewers and other items given away at scheduled times. This includes a Behmor Brazen, Bonavita Thermal 8-cups, more than ten glass-blown Chemexs, some Bonavita kettles, and the new Chemex Ottomatic. Your ticket number is your friend, so hang onto it. Kids under 12 are free?we want all parents the opportunity to raise their children right when it comes to coffee. In addition to coffee  we will have high-end chocolatiers, bakeries, and food trucks nearby. I, Kevin Sinnott, have spent the past twenty years researching on how to drink the best coffee. It?s all here at? CoffeeCon . I?ve personally selected every presenter and topic. My focus is on you and a lifetime of coffee enjoyment. Cheers! Kevin Sinnott ? ? FAQs   Where and when? January 30 th  2016 at Magic Box on The Reef from 9:00 AM to 4:00 PM     Minimum age to enter the event? Children under 12 may enter for free with an adult.? ? What are my transport/parking options getting to the event? Free parking at venue ? Where can I contact the organizer with any questions? Contact patricia@coffee-con.com ? Is my registration/ticket transferrable? Yes you may purchase tickets for others and give as gifts. However you might want to enter the person?s name so that he/she can win prizes. You must be present to win and names will be called from the registration. We had so many coffee gear giveaways last year that almost everyone left with something.? ? Can I update my registration information? Yes, on your Eventbrite account.? ? Do I have to bring my printed ticket to the event? All you have to do is bring your printed ticket with the entrance code or your phone displaying your emailed ticket to be instantly scanned and admitted.? ? What is the refund policy? 100% refund up to 7 days before the event.? ? The name on the registration/ticket doesn't match the attendee. Is that okay? That's okay but you might not win any prizes, which are valued from $10 to $500 as only registered names are entered into the drawings.     Are there any extra fees?? The General Admission Ticket gives you access to all other classes, tastings, labs, prize giveaways, etc. from 9 AM to 4 PM. Exhibitors are permitted to sell merchandise, but attendees can spend all day at CoffeeCon and are  not  expected to spend an extra dime. There will be excellent, value-priced food trucks parked just outside the venue. At this time, we cannot promise free water to attendees.  However, at the very minimum we will ensure access to  affordable  bottled water for attendees to cleanse their palates and hydrate during the event."
}