{
    "addr": "12575 Beatrice Street Los Angeles, CA 90066", 
    "title": "Digital LA - Social Good", 
    "url": "http://www.eventbrite.com/e/digital-la-social-good-tickets-19480215850?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-01T19:00:00-08:00", 
    "endtime": "2015-12-01T21:00:00-08:00", 
    "categories": [], 
    "desc": "Attend our panel celebrating Giving Tuesday?with social good startups, content creators and more, who'll discuss how they are using digital to promote social good, charities, and causes on the day after Thanksgiving. Speakers will discuss how they are using digital tools to increase awareness, drive fundraising, recruit volunteers, create storytelling content, work with celebrities and more. SCHEDULED SPEAKERS Helen Melluish, Omaze, SVP of Marketing.  Omaze is a for-profit cause marketplace that connects fans, charities, and top celebrities including Robert Downey Jr., George Clooney, Jennifer Lawrence, Ben Affleck, Matt Damon, John Legend, John Stewart and TV and film franchises such as Breaking Bad and Star Trek.? Its Star Wars campaign let fans donate $10 for a chance for a walk-on role in The Force Awakens, which raised more than $4.2M for UNICEF. @Omaze Ann Wang, Enrou, Co-Founder/ CEO. ?Enrou is an online central marketplace for consumers to buy products from socially conscious fashion and lifestyle brands that work in community development around the globe. Enrou uses social media including Facebook, Instagram to promote products and tell the stories of the product creators and artists. Enrou is an alum of two LA accelerators: just graduated from Troy Carter's SMASHD accelerator, and last year graduated from the Startup UCLA summer accelerator. ?@enrou_ Amber J Lawson, Comedy Gives Back, Co-founder & Execuitve Producer  of the 2014 IAWTV Award Winning Best Live Event @CES, Comedy Gives Back, leveraging Comedy Across Multiple platforms in order to raise money for charites, a global digital telethon, in partnership with YouTube, SXSW, Yahoo!, Team Coco IFC and Dailymotion. @amberjlawson @comedygivesback Scott Glosserman, Gathr Films, CEO . After pioneering Theatrical On Demand? over the last four years, Gathr Films is specialty theatrical platform for issues-oriented films. The Gathr model achieves both revenue and impact through crowd-sourced theatrical screenings. Gathr works with Unicef, UN Foundation, Just Label It, National Association of Social Workers. Issues films like Girl Rising ($1.7 revenue) are profitable. Upcoming film projects including \"Can You Dig This?\" about an urban 'gangster gardener' and Consumed about GMO labeling. @GathrFilms Steph Belsky, Lucid., Founder. ? Lucid. is a creative collective and content consultancy that connects nonprofits with for-profits, for purpose, through the arts via cause marketing. Steph is? a social entrepreneur, YouTube expert, artworxLA board member with more than 10 years of experience working with YouTube networks like BigFrame and publications like CollegeHumor and Buzzfeed. She has spearheaded integrated marketing campaigns for national and global nonprofits, Fortune 500 companies, and production studios. @Lucid Justine Lassoff, LOVE GOODLY, Co-Founder . LOVE GOODLY is a web and mobile platform for nontoxic, eco and stylish subscription boxes and products curated by experts. The company?s mission is to help women discover the best lifestyle brands, with its carefully sourced brands from nontoxic beauty to healthy snacks. @ShopLoveGoodly Tatiana El-Khouri  founded Road to Artdom Foundation for art for students. She has also worked in the entertainment industry and YouTube community as an Integrated Marketing professional creating business development pitches, ideation, and marketing strategies for large brands. As a product manager, she has worked closely with 3Blackdot and their debut mobile game app, Zombie Killer Squad. She organized an event at YouTube Space LA featuring top YouTube influencers playing games for charity.  AGENDA - 7-7:30p Check in and Networking - 7:30-8:30p Panel with Q&A - 8:30 - 9p. After networking. PARKING:  Complimentary parking in the CTRL Parking lot off Beatriz"
}