{
    "addr": "1000 Elysian Park Avenue Los Angeles, CA 90012", 
    "title": "Get Lit's Fall Gala: THE POETRY OF SPORTS!", 
    "url": "http://www.eventbrite.com/e/get-lits-fall-gala-the-poetry-of-sports-tickets-19107117904?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T12:00:00-08:00", 
    "endtime": "2015-12-05T15:00:00-08:00", 
    "categories": [
        "Education", 
        "Dinner or Gala"
    ], 
    "desc": "Summary: Join us for lunch at the Dodgers Stadium Dugout Club as we bring together icons who have been integral to the history & culture of sports: LA Times sports writer BILL PLASCHKE, Olympic sprinter CARMELITA JETER, Dogtown skater Pep Williams, and more...for an afternoon you won't want to miss! Lunch & cocktails will be served, and the Get Lit Players will perform original pieces inspired by incredible athletic moments in sports...all to raise money to transform education in Los Angeles through our writing programs. For more information, visit www.getlit.org.? Details: ?The Poetry of Sports,? co-hosted by the Dodgers, will feature athletes as well as writers and announcers that have contributed iconic moments to the history and culture of sports, alongside the Get Lit Players, a world-renowned troupe of teen poets and activists. The GLPs have been recognized by The White House and have performed at The Kennedy Center (with Questlove), The Hollywood Bowl (with John Legend), and  The Queen Latifah Show  (with Gloria Steinem) in the past year alone. In September, they penned the intro to the United Nations? Global Goals for world development. ? Get Lit?s curriculum bonds classic poetry with students? original spoken word responses to transform school engagement and empower youth to make their voices heard. The result is transformative and, for some, life saving. All proceeds from ?The Poetry of Sports? will go towards adopting LA County schools with literacy and dropout rates among the most severe in the nation. Come, support, and help? galvanize our young writers and performers to greatness.? Join the \"Literary Riot!\""
}