{
    "addr": "570 Westwood Plaza. Building 114. Los Angeles, CA 90095", 
    "title": "Light Sheet Microscopy & 3D STED Super-Resolution Microscopy Workshop", 
    "url": "http://www.eventbrite.com/e/light-sheet-microscopy-3d-sted-super-resolution-microscopy-workshop-tickets-19695451626?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-08T08:30:00-08:00", 
    "endtime": "2015-12-11T17:30:00-08:00", 
    "categories": [], 
    "desc": "Light Sheet Microscopy & 3D STED Super-Resolution Microscopy? A Leica Workshop at UCLA-CNSI Advanced Light Microscopy/Spectroscopy Laboratory Tuesday, December 8 - Friday, December 11 8:30am to 5:30pm It is  our pleasure to announce our upcoming Light Sheet Imaging & 3D STED Super-Resolution Microscopy' workshop and demo co-hosted by the  the? California NanoSystems Institute ?at UCLA ?and  Leica Microsystems  on December 8th through 11th, 2015. Please come by to hear about the latest advances in light sheet and super-resolution imaging. There will be?technical presentations, lunch, and hands-on demonstrations. In addition, attendees will be provided the opportunity for hands-on time to work with their own samples. ? Registration and Continental Breakfast  (Lobby) Welcome? (Auditorium) ?? Laurent Bentolila, PhD.,?Scientific Director, Advanced Microscopy/Spectroscopy Laboratory, CNSI, UCLA ? Leica Digital Light Sheet (DLS), a Novel Confocal-Based Approach?   -? Oliver Brun, Leica Microsystems ? Other Lightsheet Configurations and Optical Projection Tomography for 3D Imaging ?   - ? Seth Ruffins, PhD.,? Core Director, Microscopy Core Facility, USC Coffee Break (Lobby) ? The Ultimate Light Sheet Microscopy at CNSI?  -? Katsushi Arisaka, PhD.,? Professor, Department of Physics and Astronomy, UCLA ?Remodeling Chromatin Structure in Heart Disease?  -? Thomas Vondriska, PhD., ?Assistant Professor, Department of Anesthesiology, UCLA Q & A Lunch? (Lobby) 1:00 ? 5:30 Guided Demonstrations: Room B145 and 2144 Individual Hands-on Demonstrations ? Please reserve your time to perform hands-on measurement of your own samples at? Olivier.Brun@leica-microsystems.com . ? The event is FREE, but space is limited. RSVP now. ? Location California NanoSystems Institute 570 Westwood Plaza, Building 114 Los Angeles, CA 90095 A map can be found? here ? ? Parking Please visit the parking kiosk on Westwood Plaza (shown as ?i? on the map). You may purchase an all-day parking pass to lot 8 or 9 for $12/day."
}