{
    "addr": "1755 Highland Avenue Los Angeles, CA 90028", 
    "title": "Embrace the Customer, Impact the Bottom Line–Reimagine Customer Engagement with Salesforce Community Cloud", 
    "url": "http://www.eventbrite.com/e/embrace-the-customer-impact-the-bottom-linereimagine-customer-engagement-with-salesforce-community-tickets-19368818658?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-03T17:45:00-08:00", 
    "endtime": "2015-12-03T21:00:00-08:00", 
    "categories": [
        "Other", 
        "Dinner or Gala"
    ], 
    "desc": "Join Us for Dinner ? Immediately following Salesforce World Tour L.A. Complete your exciting and informational day at the L.A. Salesforce World Tour with an exclusive dinner conversation focused on innovation in partner and customer engagement with Salesforce Community Cloud. We?ve made it really convenient for our guests by securing the private dining room at the Loews Hollywood Hotel so that you can join us as soon as the Salesforce World Tour wraps up. 5:45 p.m. | Registration, networking & cocktails 6:30 p.m. | Plated dinner & discussion Attendees will receive complimentary Valet parking voucher for dinner & Salesforce World Tour. ? Representatives from Magnet 360, Salesforce, and ForwardLine Financial will discuss proven strategies and success stories with Community Cloud and the Salesforce Platform. You?ll see firsthand how you can engage your most important audiences with Community Cloud. ? Your hosts for the evening: Josh Holtzman, Vice President & Managing Director of Sales?West, Magnet 360 As the Managing Director for Magnet 360 West, Josh serves as a business and thought leader for Magnet 360 and the region. For the past 16 years Josh has been focused on solving client business challenges through technology, and since 2003 working primarily with the Salesforce platform. Josh has been a repeat presenter at Dreamforce, Salesforce World Tour, webinars, and is a published author across a variety of topics and industries. Prior to joining Magnet 360, Josh was the founder and CEO of American Data Company, a leading regional Salesforce Consulting Partner. Josh holds several technology certifications and is a Southern California native having graduated from UCLA. ? Mike Piehl, Solution Architect, Magnet 360 As a Solution Architect with Magnet 360, Mike drives client value by mapping business scope into technology products and executable delivery plans, focusing on complex multi-phase programs. Mike?s prior experience as a client and Enterprise Architect also provides additional value to clients as he can advise on non-Salesforce Architecture and align the delivery plan with the client?s best interest in mind. Mike focuses on Financial Services and led the Solution Design and Build process for AgentConnect, Magnet 360?s Full Force Certified Financial Services Product. Mike frequently takes on the Project Lead role on key initiatives. Since joining Magnet 360 in June of 2013, Mike has created 7 strategic roadmaps and led 13 projects of multiple clients. ? Mike Micucci, Senior Vice President, Products, Salesforce Mike?Micucci is Senior Vice President of Products at  Salesforce? where he runs the product lines for Salesforce1 Chatter, Salesforce1 Communities, and Salesforce1 Files.?Mike?joined? Salesforce ?as part of the Chatter founding team and has led the development of Communities and Files.?Mike?joined  Salesforce? in 2009 as part of the GroupSwim acqusition, where he was co-founder and CEO. GroupSwim was an enterprise social software company and specialized in social intelligence ? recommendations, topic/knowledge building, expertise within social networking.?Mike?has been working on enterprise software for over 25 years and has extensive international experience having run product and marketing organizations in US, Europe,?Asia, and India ? Plus, special guests from ForwardLine Financial: Michael Carlson, Vice President of Marketing, ForwardLine Financial Michael is a strategy and marketing professional with nearly 20 years? experience in B2B and B2C marketing. He joined ForwardLine 2013, serving as their Vice President of Marketing. Michael?is responsible for all activities related to conceptualizing and implementing market strategy relative to ForwardLine?s growth goals.?Michael?s diverse marketing background?includes sales and distribution planning, direct marketing, public relations and sponsorship/event marketing; but he is most passionate about leveraging marketing automation and data science to enhance customer relationships.?Prior to joining ForwardLine he served as Product Manager at Education Finance Partners, Austin, TX, and was the Database Marketing Manager at Chela Financial and Williams-Sonoma, Inc., in San Francisco. ? Steve Critchlow, Director of Systems & Technology, ForwardLine Financial With more than 35 years of expertise in operations and project management, Steve Critchlow is responsible for using technology and software systems to enhance ForwardLine?s operations, enabling the company to grow quickly and efficiently. Steve has an extensive background in system and software design, with a focus on technology to improve process and performance.? ?I bring technology into every aspect of ForwardLine?s operations?to control costs, reduce the time it takes to accomplish tasks, and improve the overall quality of our systems to better serve our customers,? he says. Steve has more than 30 years of experience and leadership in engineering and operations at both large companies such as Pratt & Whitney and Blue Cross, and start-ups such as Discovery/Academy 123.? Steve holds a BS and an MS in industrial engineering from Stanford University."
}