{
    "addr": "10899 Wilshire Boulevard Los Angeles, CA 90024", 
    "title": "99 Homes with Michael Shannon", 
    "url": "http://www.eventbrite.com/e/99-homes-with-michael-shannon-tickets-19126336387?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-11T19:30:00-08:00", 
    "endtime": "2016-01-11T22:30:00-08:00", 
    "categories": [
        "Film", 
        "Screening"
    ], 
    "desc": "Few people were familiar with the expression ?under water? before the mortgage crisis that very nearly toppled our economy and destroyed countless lives. Ramin Bahrani, who in earlier films sensitively captured the life of a Pakistani-born street cart vendor ( Man Push Cart ) and coming of age in the auto-body repair shops of Willets Point, Queens ( Chop Shop ), here relates a Faustian saga of greed and corruption in Orlando, Florida, as a predatory real-estate broker (a chillingly charismatic Michael Shannon) forecloses on a bankrupt construction worker (a morally shaded Andrew Garfield), and then lures him into working in his shady business. A Q&A with actor? Michael Shannon ?follows the screening. TICKETS $15 General Admission? $10 Hammer Members?with?valid discount code? Tickets can be picked up starting at 6:30 p.m. the night of the screening. Any unclaimed tickets will be released at 7:15 p.m.?A standby line for a limited number of tickets will be available the night of the program. Refunds cannot be provided. ABOUT THE CONTENDERS The Hammer Museum presents? The Contenders , The Museum of Modern Art?s renowned exhibition of films. Each year, MoMA?s Department of Film combs through major studio releases and the top film festivals around the world, selecting influential, innovative films made in the last 12 months that they believe will stand the test of time. Whether bound for awards glory or cult classic status, each of these films is a contender for lasting historical significance, and any true cinephile will want to catch them on the big screen."
}