{
    "addr": "453 S Spring Street. Suite 320. Los Angeles, CA 90013", 
    "title": "Intro to Timelapse Filmmaking", 
    "url": "http://www.eventbrite.com/e/intro-to-timelapse-filmmaking-tickets-18468065481?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T10:00:00-08:00", 
    "endtime": "2015-12-06T16:00:00-08:00", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Want to learn 4K timelapse filmmaking? Join awarding winning timelapse filmmaker/photographer Henry Jun Wah Lee for a 2 day intensive timelapse workshop in Downtown Los Angeles, California. This event takes place December 5th-6th, 2015 and is geared towards those who are new or just getting started with shooting timelapse. Timelapse photography is both an art and a science. ?You will learn Henry's approach, techniques, and skills to shooting professional quality 4K timelapses.?This includes workflow, planning, composition, camera gear, accessories, shooting techniques, and camera settings. ?We will also?discuss common mistakes as well as known challenges and their solutions so that you will be prepared when things don't go as planned. More importantly, Henry?teaches you how to think. You get to learn the essence of timelapse beyond equipment and numbers that you can not get from books or online forums. The weekend will be a balance of classroom learning and hands-on shooting in the city. You will also get a chance to check out various timelapse motion control gear such as sliders, pan tilt heads and more. ? Kessler Crane ?will be providing professional motion control equipment for participants to use during the workshop while? LRTimelapse ?will be providing advanced timelapse processing software. ? \"It's a pleasure and an honor to partake in these experiences with you. Your willingness to share your knowledge and secrets is rare and wonderful.\" - D.W. \"The locations and experiences you provided were truly amazing!! Thanks again for your guidance and assistance - and patience! Many great memories!\" - C.K. \"Thank you again for an amazing adventure and for sharing your insights. Page AZ is an amazing place with so many unique locations. Extra bonus for the awesome camping at White Pocket and the private tour of Antelope Canyon.\" - K.G.? ? Required: Highly Recommended: A nonrefundable $100 deposit is due upon registration.? The remaining balance is due November?7th. Note: Workshop fee does not include lodging, transportation or meals. Snacks will be served during classroom portions of the workshop. Please inquire for more details.  alt=\"\" width=\"100%\" height=\"214\" data-mce-p-scrolling=\"auto\" data-mce-p-marginheight=\"5\" data-mce-p-marginwidth=\"5\" data-mce-p-frameborder=\"0\" data-mce-p-src=\"https://www.eventbrite.com/tickets-external?eid=16952525460&ref=etckt\" data-mce-object=\"iframe\" data-mce-src=Null ? Cancellation Policy Cancel after November?21st: No refund If you have questions about this event or wish to sign up over the phone, please email info@evosia.com or call 310-980-8645 Henry Jun Wah Lee is an internationally-recognized filmmaker and photographer. His work has appeared worldwide on television and film. They have also been featured on Yahoo, MSN, AOL, The Weather Channel, Gizmodo, Mashable, Petapixel, io9, NPR, Pitchfork, Huffington Post, Slate, LA TImes, The Atlantic, and many more. Henry's clients include Canon, Samsung, Panasonic, LG, Sigur Ros, Mono, BBC, PBS, Epson, SmugMug, Japan Railroad Company, the British Government and the European Union. Read a recent interview with Henry in The Atlantic."
}