{
    "addr": "333 S. BOYLSTON ST LOS ANGELES, CA 90016", 
    "title": "WEST FEST 2K15 UPINSMOKE W/TRINIDAD JAMES/COMPTON AV/RAPPIN4TAY/MIKEG +MORE", 
    "url": "http://www.eventbrite.com/e/west-fest-2k15-upinsmoke-wtrinidad-jamescompton-avrappin4taymikeg-more-tickets-18921472634?aff=ebrowse", 
    "location": "LOS ANGELES, CA", 
    "starttime": "2015-12-12T19:00:00-08:00", 
    "endtime": "2015-12-13T02:00:00-08:00", 
    "categories": [
        "Hip Hop / Rap", 
        "Concert or Performance"
    ], 
    "desc": "GREEN HYPE x LABEL 27 x S BOY x SWAGRMAN present: WEST FEST 2K15 #UPINSMOKE SHOWCASING THE BEST IN WEST COAST MUSIC, ART AND CANNABIS CULTURE!!! LOS ANGELES, CA ?? Join West Fest #UpInSmoke in Los Angeles, CA in the heart of the city; a multi-sensory experience that excites your mind, body, and soul. The musical lineup and street art featured will move you as much as the concentrates do. This event is 21+ and has a 215 area accessible to licensed patients, and 2 full bars. WITH LIVE PERFORMANCES FROM:? TRINIDAD JAMES // COMPTON AV // MIKEG (ODD FUTURE) // RAPPIN 4 TAY // HUGH AUGUSTINE // LOUIS KING // DAVID SABASTIAN // CALI TREEZ // LIL U // SPLIFF HEMINGWAY // CALI SMOOV // FRANCHISE // THE IINTERCEPTERZ //?HOSTED BY THE GREAT LUSH ONE AND THE FIRST LADY OF THE WEST COAST //?+ SPECIAL GUEST LIL NATE DOGG + + + A SUPER SECRET SPECIAL GUEST THAT WE CAN'T ANNOUNCE... WHO IS GOING TO BRING THE HOUSE DOWN!!! We will be paying tribute to West Coast Legends MAC DRE, NATE DOGG and 2PAC with custom tribute sets to honor their legacy and their contribution to West Coast music, art and culture.? This event is about exciting your senses in every way possible. We have vendors traveling far and wide just to meet you. There is?something for everyone there so be sure to check out all the booths, you?ll find clothing, jewelry, art, and medicated goodness.? Browse the tents and tables, pick the brains of the most influential people in the industry, sample their wares, take home samples of your?favorites, and enjoy the atmosphere."
}