{
    "addr": "6250 Hollywood Boulevard Los Angeles, CA 90028", 
    "title": "NYElectric W Hollywood Rooftop 2016", 
    "url": "http://www.eventbrite.com/e/nyelectric-w-hollywood-rooftop-2016-tickets-19557375637?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-31T21:30:00-08:00", 
    "endtime": "2016-01-01T02:00:00-08:00", 
    "categories": [
        "New Years Eve", 
        "Party or Social Gathering"
    ], 
    "desc": "California NightLife ?presents... 3rd Annual NYElectric ? W Hollywood Rooftop 2016 ? The W Hollywood Loft?& Rooftop Lounge ? (Formerly Drai?s Hollywood) Thursday, Dec 31st 2015 10 pm - 2 am (9:30 pm will call) This is going to be big. The? W Hollywood Loft & Rooftop Lounge ?with? NYElectric ! ? The swankiest New Year?s dance party that Hollywood has ever seen.? Get ready to party to some of the hottest names in dance music while rubbing shoulders with LA?s most notable tastemakers. Here are some of the highlights : - 2?headlining DJ?s spinning at some of the hottest music festivals and clubs: - Panoramic Views of the Entire City:? - You?re on top of the world ringing in 2016 with a backdrop from the Hollywood Hills to the Iconic Skyline of DTLA - Equipped with state of the art sound and lighting that will have your bow ties and high heels off before midnight. - VIP Bottle Service Packages providing prime real estate ??? - to celebrate the memories made and the best to come with those that matter most. ??? - Choose your scene:? Inside seating celebrating beside the hottest DJ?s in dance music ??? - OR outside cabanas looking over the action with breathtaking views. - 4 Hour Premium Hosted Bar - 2 Uniquely Designed Areas: Nightclub & Rooftop Wetdeck - Incredible Surprises - And a countdown you?ll never forget.. NYE is said to be the start of what?s to come.. Open yourself up to make 2014 everything and more.?? NYElectric 2016.? W Hollywood Nightclub and Rooftop Lounge. Choose the best VIP option for you. ?VIP Hosts are standing by to make sure your NYE experience is perfect. ? Call: 323.604.6030 | email: Info@CaliforniaNightLife.com ? Strict Dress Code?Enforced: -Cocktail Attire, Upscale Chic, Black Tie Encouraged -No ball hats, t-shirts, jeans, tennis shoes will be permitted : | All sales are final. Service fees are non-refundable. No refunds or exchanges. This event will sell out in advance. Prices are subject to change while supplies last."
}