{
    "addr": "1933 S. Broadway Los Angeles, CA 90007", 
    "title": "An Evening with Techstars Healthcare Accelerator", 
    "url": "http://www.eventbrite.com/e/an-evening-with-techstars-healthcare-accelerator-tickets-19717147519?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-10T19:00:00-08:00", 
    "endtime": "2015-12-10T20:30:00-08:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Applications are currently open for the new Techstars Healthcare Accelerator, in partnership with Cedars-Sinai. We?re looking for companies transforming health and healthcare. Companies that are creating hardware, software, devices, or services that empower the patient or healthcare professional to better track, manage, and improve health and healthcare delivery are eligible to apply. The accelerator will run in Los Angeles, CA and kicks off in March 2016. During the 3-month intensive program, participants will receive intense mentoring and guidance from healthcare executives, key decision makers, and Techstars? global network of more than 7,000 founders, mentors, investors, and corporate partners. Each company participating in the program receives $20,000 in funding upon acceptance, and access to an additional $100,000 convertible debt note at their sole option. This info session will bring applicants, prospective applicants, Techstars, and Cedars-Sinai together under one roof. Join us to find out more! Get more info on the Techstars Healthcare Accelerator, in partnership with Cedars-Sinai at? http://www.techstarscedarssinaiaccelerator.com/ ?and apply at? https://www.f6s.com/techstarshealthcareaccelerator/apply Techstars Healthcare Accelerator in Partnership With Cedars-Sanai ? Techstars Healthcare Accelerator, in partnership with Cedars-Sinai, is a collaboration to help today?s technology innovators turn their ideas into breakthroughs that can improve the lives of patients around the world."
}