{
    "addr": "3780 Wilshire Blvd. #800. Los Angeles, CA 90010", 
    "title": "Reimagine Your Workflow: BIM Camp (Los Angeles)", 
    "url": "http://www.eventbrite.com/e/reimagine-your-workflow-bim-camp-los-angeles-tickets-18851522411?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-08T10:00:00-08:00", 
    "endtime": "2015-12-08T15:00:00-08:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "Don?t let the thought of building information modeling keep you up at night. Join us for a day of exploration as our industry experts take you from capturing your inspiration to realizing your visions with cutting-edge BIM tools, all while you earn four AIA Learning Units? and one HSW credit! ? Check Out What We?ve Planned ? 10?11 a.m. Sketch to BIM: A Design Workflow Philosophy (1 AIA LU) Dramatic advances in computer technology allow designers to explore new ideas and complex forms of expression. For this reason, Building Information Modeling, or BIM, becomes a natural extension of the design process. In the past there has been a separation between designing and the creation of a BIM model, which often complicates transitioning sketches and ideas into a BIM workflow. This presentation will examine a variety of technologies to help designers move their ideas into reality. We will examine the process of design-focused architects and how their approaches can be applied to a project.? ? 11 a.m.?12 p.m. Building Information Modeling as a Design Process: Part One (1 AIA HSW) The profession of architecture is evolving beyond traditional boundaries, becoming more complex as new technologies influence the design process. Those within the profession and those engaged with the intricacies of building construction understand that there is a broader scope to an architect?s activities than merely creating the drawings used to dictate the form that a structure ultimately takes. These associated duties often include feasibility studies, programming, code compliance, consensus making, construction phasing, and general oversight of the entire process right up until the day the keys to a new building are turned over to the owner. Some designers even extend their influence into facilities management. ? Architects prefer to follow their own workflow, adapting to the unique needs of their clients, locations, and projects types. Despite these differences, there is one thing that all design professionals have in common: they engage in a process for the benefit of their clients that brings together other professionals, building trades, construction materials, and life-safety interests while managing the complexity of a functioning facility. ?Building Information Modeling (BIM) provides a powerful organizational framework for managing all the tasks associated with building beautiful, useful, and efficient structures. However, learning the capabilities and sequencing of BIM workflows can seem like a daunting task. In reality, successful BIM implementation is primarily a matter of understanding some basic rules and the principles behind the efficient sharing of information. ? 12?1 p.m. Complimentary Lunch Enjoy a free lunch and the chance to network with other architects in your area and our Vectorworks industry specialists. ? 1?3 p.m. Building Information Modeling as a Design Process: Part Two (2 AIA LUs) Building Information Modeling (BIM) is a tool for managing all the tasks associated with documenting and building beautiful and efficient structures. While learning the capabilities and sequencing of BIM workflows can seem like a daunting task, successful BIM implementation is a matter of understanding some basic rules and principles behind the extraction and sharing of information. Through the use of BIM applications such as Vectorworks software, architects will be able to apply these rules and principles to the documentation of their designs. This workshop will lead you through a workflow to create an information model for design, analysis, and documentation within Vectorworks software."
}