{
    "addr": "1755 Highland Avenue Los Angeles, CA 90028", 
    "title": "Vision VR/AR Summit 2016", 
    "url": "http://www.eventbrite.com/e/vision-vrar-summit-2016-tickets-18367392365?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-10T09:00:00-08:00", 
    "endtime": "2016-02-11T17:00:00-08:00", 
    "categories": [
        "Other", 
        "Conference"
    ], 
    "desc": "Click here to view the Vision VR/AR Summit Website ? Vision VR/AR Summit is an all-new cross industry event for artists, engineers, programmers, designers, musicians, directors and producers, hardware manufacturers and researchers. It will be a unique event focused on furthering the knowledge base of anyone developing virtual and/or augmented reality content. ? Vision VR/AR Summit will feature tech leaders, design innovators, and visionaries. Sessions will cover a broad range of topics, such as conceptual and practical design, technology deep dives, interface design, implementation and creation of full immersion through presence. There will be tracks dedicated to specific hardware, and participants will have a chance to get hands-on assistance with their projects at platform-specific porting labs. ? When:  February 10-11, 2016 Early badge pick-up: February 8-9, 2016 ? Summit hours:   Wednesday, February 10 and Thursday, February 11 Registration begins at 9:00 am Keynote begins at 10:00 am ? Where:   Loews Hollywood Hotel  Hollywood, CA,.  We?ll be providing more information on this page soon about accommodation.  ? Program/Schedule Overview: Check out  http://visionsummit2016.com/  for updates on the program, hotel accommodation and other important practical information. ?? Frequently Asked Questions ? Where can I contact the organizer with any questions? You may contact us at info@visionsummit2016.com. ? When should I expect a response to my inquiry? A member of the Vision team will respond within 24 hours from the time you send your inquiry. If you do not hear from us within 24 hours, please send a follow-up message.  ? Registration ? How do I get my badge? Do I have to print out a ticket? Badges will NOT be mailed to you. To reduce paper waste, please download the Eventbrite mobile app onto your mobile device, and have your electronic ticket ready on your device at event check-in, along with your photo ID. If you are unable to use the mobile app, you may bring the printed-paper ticket you received in your email. ? Do I need a credit card to buy tickets to Vision VR/AR Summit? Please use a credit card for your purchase. Major international cards are accepted. If you have a payment method issue, please contact us at? info@visionsummit2016.com  to see if we can help. ? What should I bring to the conference? No equipment is required for Vision VR/AR Summit. Don't forget to bring the e-ticket on your device and a photo ID. If you are underage and do not possess a photo ID, please contact us. **If you are registering on behalf of someone else, be sure to use their email address so they stay informed of Vision VR/AR Summit happenings! ? How does Educator/Student pricing work? There are a liminted number of discounted tickets available to student developers and educators. To qualify, you must be a current faculty member/student and possess a photo student/faculty ID, which you will be required to present at badge pick-up.  ? What is the refund policy? There are no refunds or credits for Vision VR/AR Summit, however, tickets are transferable. (See below.) ? Is my registration/ticket transferrable? Can I update or change my registration information?  Yes, you can transfer your ticket to another person or update your registration information yourself by following the instructions  here . It is important to keep all personal information updated, so your badge information will be correct. ? Vision VR/AR Summit schedule & speakers ? When will the sessions schedule for Vision VR/AR Summit be made available? Please check our website for our sessions schedule and keynote announcement. ? I would like to speak at the conference. How do I submit a proposal? Submissions closed on Friday, October 30th. We are no longer accepting proposals.  ? Visas & important info about entering the United States ? If I am an international attendee, do I need a visa to attend the conference? Please  check this site  to determine if you need a visa to visit the United States. If you do require a visa, please verify your personal visa eligibility before purchasing a ticket to Vision VR/AR Summit. Contact us to get your Letter of Invitation if you need one. (Please bear in mind that if your visa is not granted, tickets are not refundable. Please verify your personal eligibility prior to ticket purchase.) If you require a Letter of Invitation for a visa, please contact us at? info@visionsummit2016.com . info@visionsummit2016.com"
}