{
    "addr": "1201 South Figueroa Street Los Angeles, CA 90015", 
    "title": "Decorators' Showcase at LA Cookie Con and Sweets Show", 
    "url": "http://www.eventbrite.com/e/decorators-showcase-at-la-cookie-con-and-sweets-show-tickets-18720924790?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-06T10:00:00-08:00", 
    "endtime": "2016-02-07T17:00:00-08:00", 
    "categories": [
        "Food", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "LA Cookie Con and Sweets Show is the West Coast?s BIGGEST convention for baking, decorating, and sweets. Our 2015 show was totally sold out and attended by sugar artists, event planners, trendsetters, bloggers, press and celebrities from around the globe. For our 2016 show we?re proud to unveil our Decorators? Showcase to benefit Children?s Hospital Los Angeles. ? Sugar artists, help us assemble an extravagant display of your best decorated cakes, cookies, cake pops and blown sugar art. Your work will be seen by millions on social media and the web, plus our eager attendees, including our esteemed celebrity guests. ? This year we have three categories for your submissions: Wedding  Novelty Children?s Birthday  You may submit any edible sugar art to these three categories. The tables are 6 to 8 feet long and draped in white tablecloth and skirting. Each competitor will have a 2? area for their display and a sign with their name/business name and social media profiles.  ? You must set up your work between 8:30 am - 9:30 am on Saturday, February 6. You may dismantle it when the show closes on Sunday, February 7, or leave it for the maintenance crew to dispose of. ? The general public will cast votes for their favorites works on Facebook. The winners in each category will receive awesome prizes TBD!  ? This is a friendly, charitable showcase with a focus on supporting Children?s Hospital Los Angeles and celebrating edible art ? so beginners through professionals are welcome, as are team entries.  Amateurs' and professionals' work will be grouped together as appropriate. FAQs Does my entry include my ticket to LA Cookie Con and Sweets Show?? Yes, your entry fee includes your Professional Weekend Pass to the show. If you have already purchased a Professional Weekend Pass, you may use this pass for your assistant, or request for it to be transferred to a General Admission Weekend Pass for your friends or family. How much of my entry fee benefits Children's Hospital Los Angeles? All entry fees, minus the costs of setting up the tables (paid to the decorator) and printing the little signs for each entry, will go directly to CHLA. So the answer is: most of it! Do I need to stay with my entry? No! Please feel free to enjoy the show, or go back to your baking. I'd like to enter your 2nd Annual Dessert Table Competition and other competitions. How can I do that? The theme of our competitions last year will be different than those used in the Decorators' Showcase. Please join the e-newsletter list on our website for updates as we announce and open the competition."
}