{
    "addr": "11301 Olympic Blvd 204 Los Angeles, CA 90064", 
    "title": "BLACK FRIDAY Local-Shopping Expo - LA", 
    "url": "http://www.eventbrite.com/e/black-friday-local-shopping-expo-la-tickets-19085840262?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-11-26T11:00:00-08:00", 
    "endtime": "2015-11-28T21:00:00-08:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "A BLACK FRIDAY  STRESS-FREE SHOPPING EVENT Supporting?local small-businesses in Los Angeles, CA.? ? ? \"Come To? Shop ...Stay For The? Fun \" Local Residents of Los Angeles? don't miss this great opportunity to do your holiday?shopping with some amazing local businesses.? Attend our STRESS-FREE expo during three of the most important shopping days of the year: ? ? STRESS-FREE HOLIDAY SHOPPING? ? If you enjoy the great experiences that come from shopping with local small businesses, then this Expo is JUST FOR YOU ? If you are a small business owner and want to sell your products to hundreds of local holiday shoppers during Black Thursday, Black Friday & Shop Local Saturday. ?????????????????????????????????????? ??????????????????????????????????? ??  CALL FOR VENDOR BOOTH ??????????????????????????????????????????????????? (424) 297-9467 ? ? WHY ATTEND? ? WANT TO EXHIBIT & SELL TO HUNDREDS OF HOLIDAY SHOPPERS? Exhibiting at this expo is a must. Nowhere else can you reach hundreds of holiday shoppers and make on-the-spot sales!?? ? FAQ ? Q. ?? What are the dates for the expo? A. ?November 26 -28, 2015? ?- ? Thursday 11:00 AM - 9:00 PM ?- ? Friday 11:00 AM - 9:00 PM ?- ? Saturday 11:00 AM - 9:00 PM Q. ?? How much time should I allow to attend? A .?? The amount of time to visit the Expo varies for each attendee. Most attendees could spend a couple of hours doing their holiday shopping, or buying new products, meeting with local businesses and having fun viewing the specialty events. ? ? Q.? How much does it cost to attend? A. ?Our 3-day expo is FREE and open to the public. ? Q:? Is the location wheel chair accessible? A:? Yes. ? Q:? I am in a wheelchair and will be bringing and additional person for this purpose. ?Will they have to register to? A:? They will not have to register.? We are happy to have you join us and will work with you to accommodate your participation."
}