{
    "addr": "1262 Westwood Blvd. Los Angeles, CA , CA 90024", 
    "title": "An Evening with Bill Nye", 
    "url": "http://www.eventbrite.com/e/an-evening-with-bill-nye-tickets-19014816829?aff=ebrowse", 
    "location": "Los Angeles, CA , CA", 
    "starttime": "2015-12-14T20:00:00-08:00", 
    "endtime": "2015-12-14T21:30:00-08:00", 
    "categories": [
        "Science", 
        "Other"
    ], 
    "desc": "Monday, December 14, 2015,? 8:00pm An Evening with Bill Nye Unstoppable:? Harnessing Science to Change the World Crest Theatre, Westwood   1262 Westwood Blvd,  Los Angeles, CA 90024? TICKETS   $45 General?Section?seating + Book*?  $50 Reserved Section Seating + Book*   $95?Pre-Reception(6:30-7:30pm)*+ Reserved Section seating + Book  $20 General Admission tickets on sale November 6   * Books will be picked up at the event when you check in, and signed immediately after the talk ? Bill Nye  is a scientist, engineer, comedian, and inventor, as well as the  New York Times  bestselling author of  Undeniable: Evolution and the Science of Creation . He holds a BS in Mechanical Engineering from Cornell University, where he studied under Carl Sagan, and worked as an engineer at Boeing on the 747, before creating and hosting his much-loved Emmy award-winning PBS/Discovery Channel show \"Bill Nye the Science Guy.\"?? \"Unstoppable is what you get when you melt down Bill Nye the Science Guy and turn him into a book. Containing rich scientific insights on ourselves, our society, and our world, the book is a must-read for anybody who needs to be scientifically literate in the 21st century. And, of course, that?s everybody.\"  ? Neil deGrasse Tyson ? In  Unstoppable: Harnessing Science to Change the World, ?Bill Nye sheds light on today?s climate change crisis, demonstrates why we need to act immediately and shows what we need to do to create a better future.? With a scientist's thirst for knowledge and an engineer's vision of what can be, Nye sees today's environmental issues not as insurmountable, depressing problems but as chances for our society to rise to the challenge and create a cleaner, healthier, smarter world. Further, as Nye shares his vision, he debunks some of the most persistent myths and misunderstandings about global warming.? Nye issues a new challenge to today's generation: to make a cleaner, more efficient, and happier world. Throughout, he crystallizes and expands upon the message for which he is best known and beloved: that with a combination of optimism and scientific curiosity, all obstacles become opportunities, and the possibilities of our world become limitless.? We need not accept that transportation consumes half our energy, and that two-thirds of the energy you put into your car is immediately thrown away out the tailpipe. We need not accept that dangerous emissions are the price we must pay for a vibrant economy and a comfortable life. Above all, we need not accept that we will leave our children a planet that is dirty, overheated, and depleted of resources. Ticket sales are final."
}