{
    "addr": "5925 West Pico Boulevard Los Angeles, CA 90035", 
    "title": "Charity Cooking Class with Chef Sharone at Lock Box LA", 
    "url": "http://www.eventbrite.com/e/charity-cooking-class-with-chef-sharone-at-lock-box-la-tickets-19649195272?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T13:00:00-08:00", 
    "endtime": "2015-12-05T14:00:00-08:00", 
    "categories": [
        "Food", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Lock Box Charity Cooking class with Chef Sharone! Please join us at Lock Box for a special fundraiser for one of our favorite charities \"No Kid Hungry\".?Share an afternoon with Chef Sharone, from Master Chef, while he teaches you healthy cooking tips for the holiday season. He will prepare healthy and delicious?recipies for you to taste.? This event it open to everyone. Bring your family and friends and support a great cause!? When: Dec 5th 1-2:15pm Where: Lock Box LA - 5925 W Pico Blvd, LA CA 90035 Cost: $15 Donation. 100% of all proceeds will go towards the \"No Kid Hungry\" Charity CHARTITY: 100% of all proceeds will go towards the Charity \"No Kid Hungry\" No child should grow up hungry in America, but one in five children struggles with hunger. ?Share Our Strength?s No Kid Hungry campaign is ending child hunger in America by ensuring all children get the healthy food they need, every day. The No Kid Hungry campaign connects kids in need with nutritious food and teaches their families how to cook healthy, affordable meals. The campaign also engages the public to make ending child hunger a national priority. CHEF SHARONE Culinary showman Chef Sharone Hakman has an insatiable appetite for adventure and for creating delectable food. His dishes are as versatile and lively as his personality, filling you up in taste and in presentation. Formerly a financial planner, Sharone left the corporate world to follow his true love for food by pursuing a career as a chef. His standout performance on Fox?s hit show Master Chef ignited a new vision for Sharone?s aspirations in the culinary world. Now, a highly acclaimed chef, owner of a barbecue sauce company, dedicated family man and active lifestyle enthusiast, Sharone puts as much love into his food as he does into his zest for life. His celebrity clientele and international television success has not steered Sharone away from who he is: a man who creates love and passion through his food. Watching Sharone work his talent behind the fire is a lesson on how to celebrate and enjoy life?s greatest indulgences. Eat Up!"
}