{
    "addr": "932 Chung King Road Los Angeles, CA 90012", 
    "title": "Perfume Intensive: LEATHER ACCORDS", 
    "url": "http://www.eventbrite.com/e/perfume-intensive-leather-accords-tickets-19395894643?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T11:00:00-08:00", 
    "endtime": "2015-12-05T17:00:00-08:00", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Join independent perfumer and IAO collaborator Ashley Eden Kessler for a six hour intensive that focusses on leather, leather, leather.  MORE INFORMATION Explore the beautiful capabilities of perfumery in this highly detailed, professional and technical perfume-blending intensive. Led by Independent Perfumer Ashley Eden Kessler, and held in our fully stocked educational laboratory, this very hands-on session will focus on helping students train their nose, expand their capabilities for blending, and learn all about the components and blending of the finest leather accords. -- WHAT TO EXPECT Students will spend several hours as a group training their noses, as Ashley leads a thorough study of the molecular components of leather.  Then, as a class, we will blend sample accords, learn how to evaluate our formulas, and then spend plenty of hands-on time creating our own formulations. At the end of the day, students will leave with their own best possible formula, as well as a deeper understanding of the artistry and science behind perfumery. This class is for people at all levels, but some basic understanding of perfumery is recommended. We will take several small nose breaks, and one lunch break. ? -- REFUND POLICY When we host a class or workshop, we often order the materials to be used in the class well in advance. With that in mind, here is our refund and cancellation policy: ? Cancellation and refunds requested  more than 2 weeks before  the class: No problem! We?ll miss you, but will be happy to refund your spot 100%.  ? Cancellation and refunds requested  less than 2 weeks before  the scheduled class: We will refund you 50%. Why? Because we already ordered the materials!  ? Cancellation and refunds requested  less than 24 hours before the class starts, on the day of the class, or after the class   has happened  will not be granted."
}