{
    "addr": "4810 Sunset Boulevard Los Angeles, CA 90027", 
    "title": "A REPORT CARD ON HUMAN RIGHTS IN AMERICA Part 1: Racism and Injustice", 
    "url": "http://www.eventbrite.com/e/a-report-card-on-human-rights-in-america-part-1-racism-and-injustice-tickets-19504127370?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-09T18:00:00-08:00", 
    "endtime": "2015-12-09T20:30:00-08:00", 
    "categories": [
        "City/Town", 
        "Seminar or Talk"
    ], 
    "desc": "In Honor of International Human Rights Day A two part series African Americans in Los Angeles are 260% more likely to be stopped than whites. (ref: American Civil Liberties Union and Yale Law School report) America has 5% of the world?s population and 25% of the world?s prisoners ? 2.2 million adults, costing $53 billion to the US states. Over half of those in prison are people of color. (ref: BBC) It?s estimated that close to 10,000 innocent Americans are wrongfully convicted of a serious crime each year. (ref: Ohio State University report) Refreshments, followed by presentations, panel discussion. The first of two forums on the state of human rights in the United States. Part 2 is:  Homelessness, Poverty and Hunger, How Do We Fix It? RSVP Part 2: bit.ly/HumanRightsPart2 Those attending both parts receive a certificate of  The Basics of Human Rights in America . Hosted by: Church of Scientology of Los Angeles   FAQs What is Part 2 of the event?   Part 2: Homelessness, Poverty and Hunger, How Do We Fix It? Saturday, December  12 , 201 5,  9:00 am ? 1:00 pm Hosted by: Church of Scientology of Pasadena 35 South Raymond Avenue ,  Pasadena, California 91105 RSVP Part 2: bit.ly/HumanRightsPart2 Where and when is Part 2? Saturday, December  12 , 201 5,  9:00 am ? 1:00 pm Hosted by: Church of Scientology of Pasadena 35 South Raymond Avenue ,  Pasadena, California 91105 RSVP Part 2: bit.ly/HumanRightsPart2 Who issues the certificate \"The Basics of Human Rights in America?\"? Youth for Human Rights International Issues the certificate.  What are my transport/parking options getting to the event? Parking is free at location. If you wish to take Metro, get off at the Vermont/Sunset stop of the Red Line and walk 2-3 blocks west."
}