{
    "addr": "7080 Hollywood Blvd #1100 Los Angeles, CA 90028", 
    "title": "THE ART OF ACTIVE NETWORKING, LOS ANGELES December 8, 2015", 
    "url": "http://www.eventbrite.com/e/the-art-of-active-networking-los-angeles-december-8-2015-tickets-16111493912?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-08T18:30:00-08:00", 
    "endtime": "2015-12-08T21:30:00-08:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Meeting or Networking Event"
    ], 
    "desc": "Do you hate Networking as much as most of us do? Are you also bad at it, often wondering why no one returns your calls or follows up with you after a \"Networking Event\"? LET US FIX THAT FOR YOU! Join ?us for \"The Art of Active Networking\" in Los Angeles!? We'll be gathering at the beautiful offices of? IgnitedSpaces ?7080 Hollywood Blvd, Suite 1100, Los Angeles, CA 90028. Check them out and spread the word about them:?https://www.ignitedspaces.com Parking garage is located off of La Brea (building is situated right on the corner of Hollywood and La Brea). There is a sign marked 7080 Parking and an alleyway to turn into to access the structure. It's a blue structure with a bridge straight across to the building itself. It is a $6 flat fee after 6pm. ? TheArtofActiveNetworking.com Come see why nearly 11,000 people have attended worldwide! ?Tickets are 20$ on-line on our site until 6pm the day of the event and 30$ at the door until 7:30pm...the event ends about 9:30pm! You must purchase a ticket in advance to get the 20$ pricing. At this event you will make some amazing connections and you will learn why Networking is not about what you get, but what you give. And you really only need to meet one person to make your entire night worthwhile if you know what you are doing. You will have an opportunity to speak to everyone in the room, and you will absolutely meet people you might?otherwise?never have an opportunity to meet. Finally you are then invited to join all of our groups and pages and use our FREE walls to post up what you might be looking for. Everything you need to know about this event is on our site.?Join the pages and the groups, spread the word and read the testimonials on our site about what people have said after attending: TheArtofActiveNetworking.com Mark E. Sackett started this in San Francisco 5 years ago as a way to help others do better in life, love and business. Mark is a entrepreneur owning 13 companies and who lives between New York City, San Francisco and Los Angeles. He is a Director, Producer, Designer, Art Director and Public Speaker. He works daily in Branding, Marketing, Film, Television and Music and as an events producer and speaker on living an authentic, powerful and creative life. The power of us all working together is so much greater than anything each of us can accomplish on our own. See you there and I hope your year is about beautiful, powerful connections. Connect with me by clicking below to start sharing my massive networks with those you can help to do better each day! BE WELL, BE CREATIVE, BE GREAT! Mark E. Sackett President/Creative Director/Executive Producer/Director/Public Speaker ? Mobile: 415-602-9500 MarkESackett.com TheArtofActiveNetworking.com"
}