{
    "addr": "2999 Rosanna St. Los Angeles, CA, 90039", 
    "title": "Along the River and Under the Shooting Stars - Camping at Marsh Park", 
    "url": "http://www.eventbrite.com/e/along-the-river-and-under-the-shooting-stars-camping-at-marsh-park-tickets-19721136450?aff=ebrowse", 
    "location": "Los Angeles, CA, 90039", 
    "starttime": "2015-12-12T16:00:00-08:00", 
    "endtime": "2015-12-13T10:00:00-08:00", 
    "categories": [
        "Family \\u0026 Education", 
        "Camp, Trip, or Retreat"
    ], 
    "desc": "Para Espa?ol deslizar hacia abajo Come one, come all, rain or shine!! Camp Along the River and Under the  Shooting  Stars is?brought to you by? Mountains Recreation & Conservation Authority and ?Santa Monica Mountains Conservancy. See if you can catch a shooting star while camping out along the river with your friends and family at Marsh Park! That?s right, our second camping event at Marsh Park is during the peak of the Geminids Meteor Shower so with some luck, we'll see a few light up our night sky. Join our Naturalists and enjoy the park and urban nature from dusk to dawn in a way very few have. With limited space options, reservations are required. Should there be a high demand for campsites, we will have a waitlist available. These dates don't work for you? Fear not, we will be hosting quarterly campouts through out the year. * Parking within the gated park is limited ? ? Tentative Schedule Saturday 4:00pm ? ?Arrival and check-in (set-up tents) 4:44pm ? ?Sunset - Park Gates Close 5:00pm ? ? Marsh Park tour 6:00pm ? ?Dinner 7:15pm ? ? Camping games 8:00pm ? ?Campfire 9:15pm ? ?Astronomy program 10:00pm ?Quiet hours begin Sunday 6:00am ? ?Quiet hours end 7:00am ? ?Sunrise stretch 7:30am ? ?Breakfast 8:00am ? ?Nature Walk 8 :30am ? ?Cleanup / Pack up 9:00am- 10:00am ? Departure ? ? Items to bring Can I bring my dog? As much as your four-legged friend is part of the family, this event is for humans only.?Please,  no pets  at this event. Service animals are the only exception. Is music allowed? Songs around the campfire benefit from acoustic?instruments. ?Remember, quiet time starts at 10pm until 6am.?No amplified music (stereos, iPod speakers). Do I need to bring my own food and water? ?What about restrooms? You are welcome to bring snacks or food for special dietary needs, but we will provide a hot dog roast for dinner and a continental breakfast in the morning. Please, no alcohol. There is a water fountain at the park, as well as restrooms (no showers). How can I charge my phone? Marsh Park?has limited electricity availability and we are unable to guarantee open plugs for charging phones. We will look into this option for the?future camping trips. Can I smoke? There will be a designated smoking area far off from the camping area.? Can I receive a waiver for the camping fee? Yes, if the cost is a factor in your participation, please email us at interpprograms@mrca.ca.gov for a fee waiver. ? My friends are also attending; can our tent sites be side by side? Yes, we will follow up with all participants by phone and we will be able to accommodate?you then. ? Cancellation Policy Participants must notify the MRCA  48 hours  prior to the event to be issued a refund. No-shows or cancellations after the 48 hour mark will not be issued a refund.  Rain does not cancel the event. ? A lo largo del r?o y bajo las estrellas fugaces?- Acampar en Marsh Park ? Venga uno, Vengan todos, lluvia o Sol!! ?Acampando a lo largo del r ? o y bajo las estrellas fugaces?es tra?do a usted por Mountains Recreation and Conservation Authority y Santa Monica Mountains Conservancy Vea?si puede?agarrar?una estrella fugaz mientras que acampa?a lo largo del r?o con sus amigos y familiares en Marsh Park! As? es, nuestro segundo evento de campamento en Marsh Park es durante el pico de la lluvia de meteoros Gem?nidas, as? que con un poco de suerte, veremos algunos iluminando nuestro cielo nocturno.? ?nese a nuestros naturalistas y disfrute del parque y la naturaleza urbana desde el atardecer hasta el amanecer de una manera que muy pocos tienen. Con opciones de espacio limitado, es necesario hacer reservaciones. ?Si hubiera una gran demanda de campings, vamos a tener una lista de espera disponible. Si estas fechas no funcionan para usted? No tenga miedo, tendremos m?s oportunidades de acampar durante el a?o. * Estacionamiento dentro del parque es limitado.? ? ? Horario Tentativo Sabado 4:00pm ? ? Llegada y check-in (Instalar tiendas de campa?a) 4:44pm  ? ? La puesta del sol -? Puertas del parque cierran 5:00pm ? ? Conocer Visita Marsh Park 6:00pm ? ?Cena 7:15pm ? ? Actividades de Acampar 8:00pm ? ?Fogata 9:15pm ? ?Programa de Astronomia 10:00pm ? Horas tranquilas comienzan Domingo 6:00am ? ?Hora de silencio termina 7:00am ? ?Estiramiento al Almanecer 7:30am ? ?Desayuno 8:00am ? ?Caminate de Naturaleza 8:30am ? ?Limpieza/Empacar 9:00am- 10:00am ?? Hora de Salida ? ? Los Productos Para Llevar ? Bolsa de dormir, tienda de campa?a. Si usted necesita pedir prestado el nuestro, por favor h?ganoslo saber. ? Almohada ? Cantina de agua ? Ropa C?moda de invierno, pijama para dormir, zapatos? c?modos, y ropa de lluvia si la lluvia se  pron?stica ? Silla plegable o picnic manta ? Alimentos? ? Un?cami?n? para el transporte de su equipo desde su coche hasta el acampamento ? ?? Buena actitud listo para un buen rato! Preguntas Frecuentes ? ?Puedo llevar a mi perro? Por mucho que su amigo de cuatro patas es parte de la familia, este evento es s?lo para los seres humanos. Por favor,  no se permiten mascotas  en este evento. Los animales de servicio son la ?nica excepci?n. ? ? Se permite la m?sica? Canciones alrededor de la fogata se benefician de instrumentos ac?sticos. Recuerde, tiempo de silencio comienza a las 10:00 pm hasta las 6 am. No se permite m?sica amplificada (equipos de sonido, altavoces para iPod). ?Tengo que llevar mi propia comida y agua? ?Y los ba?os? Le invitamos a traer bocadillos o comida para necesidades diet?ticas especiales, pero vamos a proporcionar un asado de hot dog para la cena y un desayuno continental en la ma?ana. Por favor, nada de alcohol. Hay una fuente de agua potable en el parque, as? como ba?os (no hay duchas). ?C?mo puedo cargar mi tel?fono? Marsh Park cuenta con la disponibilidad de electricidad limitado y no podemos garantizar tapones abiertos para los tel?fonos de carga. Vamos a trabajar en esta opci?n para los futuros campamentos. ?Puedo fumar? Habr? una zona para fumadores lejos de la zona de acampada. ?Puedo recibir un descuento en la cuota para Acampar? S?, el costo es un factor en su participaci?n, por favor env?enos un email a  interpprograms@mrca.ca.gov  para recibir un descuento en la cuota. ? Mis amigos tambi?n asisten; nuestros sitios de la tienda puede ser al lado del otro? S?, vamos a confirmar con todos los participantes por tel?fono y vamos tratar de acomodarlos. ? ? Pol?tica de Cancelaci?n Los participantes deber?n notificar a MRCA? 48 horas ?antes del evento si desean recibir un reembolso. Si no se presenta o pide una cancelaci?n despu?s de la marca de 48 horas no se les emitir?n un reembolso.? La lluvia no cancela el evento."
}