{
    "addr": "1201 S Figueroa St Los Angeles, CA 90015", 
    "title": "TheFitExpo, Los Angeles 2016", 
    "url": "http://www.eventbrite.com/e/thefitexpo-los-angeles-2016-tickets-17756001679?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-23T10:00:00-08:00", 
    "endtime": "2016-01-24T17:00:00-08:00", 
    "categories": [
        "Personal health", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "TICKETS ARE NONREFUNDABLE.   ? Please read carefully: ? Discount Coupons are NOT Accepted for Online Ticket Purchases. ?? Please make sure to double check your email address for accuracy prior to submitting your purchase. ?  ? Now in its 13th year,  TheFitExpo  Los Angeles takes place January 23-24, 2016 at the Los Angeles Convention Center. The Los Angeles Convention Center is located at  1201 South Figueroa Street  Los Angeles, CA 90015 Click here for directions:  http://www.lacclink.com/lacclink/Visiting.aspx ? THEFITEXPO  LOS ANGELES SHOW HOURS  Saturday, January 23, 2016: 10:00 AM - 6:00 PM  Sunday, January 24, 2016 10:00 AM - 5:00 PM ? PARKING DETAILS:  There are a number of parking options for those driving to TheFitExpo Los Angeles. Our event is in the South Hall, so parking at the South Side Convention Center entrances are the best. The West garages are open as well. In addition, the lots at LA LIVE and the parking lots across Figueroa will be open and available.?  Click here for parking information:  http://www.lacclink.com/attendees/parking Come early and enjoy a full day with us! ? ? FAQs:  ? Where can I contact the organizer with any questions? Please call: (888) FIT-EXPO or email  TheFitExpo@gmail.com ? Is my registration/ticket transferrable? Yes, your ticket is transferrable. Please note that once the barcode has been scanned for entry, any other subsequent scans will be rejected. ? Do I have to bring my printed ticket to the event? A paper ticket is preferred, however in the event you do not have access to a printer, the barcode can be scanned from the PDF via your smartphone's emailed confirmation. ? What is the refund policy? Tickets are NON-refundable. If you are unable to attend TheFitExpo for any reason you may transfer your ticket to another person. Tickets will not be refunded. ? The name on the registration/ticket doesn't match the attendee. Is that okay? Yes, that is okay. A lot of people receive the expo tickets as a gift."
}