{
    "addr": "3500 W Adams Blvd Los Angeles, CA 90018", 
    "title": "New Year's Resolution Spiritual Spa Day with John Morton, in Los Angeles & Live Online", 
    "url": "http://www.eventbrite.com/e/new-years-resolution-spiritual-spa-day-with-john-morton-in-los-angeles-live-online-tickets-19486575873?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "New Years Eve", 
        "Class, Training, or Workshop"
    ], 
    "desc": "\"Let's each one within our own consciousness--because that's the most sacred place of all--rededicate ourselves anew to only two concepts: the Fatherhood of God and the Brotherhood of Mankind. And if you will just take those two and manifest them, we will indeed be manifesting the Christ Consciousness.\"  - John-Roger New Year's Resolution Spiritual Spa Day with John Morton, in Los Angeles &  Live  Online Saturday ?January 2 ?| ?10:00am - 12:30pm PT | Brunch @ 12:30pm? Includes - Workshop | Guided Labyrinth Walk | Delicious Buffet Brunch Includes Spanish Translation Enjoy a morning of self-discovery. This spiritual ?spa day? uses heartfelt activities such as a guided labyrinth walk, workshop, and meditations to help you start the New Year by experiencing the loving already present in your heart. Delicious brunch follows.? ? ? IN PERSON DETAILS Cost which includes Buffet Brunch $20 - teens & adults | ?$15 - seniors 70 & up ?| ?9 - kids ages 8-12 ?| ?Free--kids 7 & under Time ?  ?Workshop ?10:00am - 12:30pm ?| ?Brunch @ 12:30pm? Location ? @? Peace Awareness Labyrinth & Gardens ? Parking  ? Limited Parking inside the gate and street parking available.? Register ? ?Purchase tickets above -or- register at the door.? Questions?  ? Contact Alethea Lamb -  Registrar@peacelabyrinth.org  | 323-737-4055 ?? LIVE ONLINE DETAILS? Cost ?  Free of charge? Time  ? Los Angeles=10:00am-12:30pm PT | NY=1:00pm-3:30pm ET | London=6:00pm-8:30pm GMT Click Here For Time Converter Watch the live stream  15 minutes before start time @ ? www.msia.org/liveonline  ?? Questions?  ?Email ? msialive1@gmail.com ? ? Tech Support Recommendations For best online view results, we recommend your internet connections, computer and/or devices meet these minimum requirements: ? RELATED EVENTS:  Wednesday Dec 31 | New Year's Eve Sacred Tones with Paul Kaye - in Los Angeles & Live Online ? HAPPY NEW YOU! ?SEE YOU THERE!"
}