{
    "addr": "9901 S La Cienega Blvd Los Angeles, CA 90045", 
    "title": "Sonic Revolution 2016 - A Sonic the Hedgehog Fan Convention!", 
    "url": "http://www.eventbrite.com/e/sonic-revolution-2016-a-sonic-the-hedgehog-fan-convention-tickets-19746548458?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-06-12T10:00:00-07:00", 
    "endtime": "2016-06-12T18:00:00-07:00", 
    "categories": [
        "Gaming", 
        "Convention"
    ], 
    "desc": "Sonic Revolution 2016 is a Sonic the Hedgehog fan convention based out of Los Angeles, CA. Inspired by other events like the fan-run Summer of Sonic and SEGA of America's Sonic Boom, the event was first held in Buena Park, CA in 2014 and was able to draw dozens of fans from all over the world in its first year. ? At the 2014 event, special guests included official Sonic comic artist Evan Stanley, Tommy Tallarico of Video Games Live, well-known fan artist Elson ?Darkspeeds? Wong, and the band Serenity Seven, who gave a live musical performance of several Sonic the Hedgehog songs. ? After a hiatus in 2015, the event is proud to announce that it will be returning on Sunday, June 12th 2016 at the Holiday Inn LAX from 10 AM to 6 PM. Sonic Revolution 2016 is a family-friendly event and is open to all ages. Activities include: ? -An artist alley and vendor booths -Raffles for all sorts of prizes -Special guest (TBA) panels and the opportunity to meet special guests -Music from all across Sonic?s long history of titles -Trivia and cosplay contests -A chance to meet numerous other fans in person -And more to be announced in the coming months! ? Sonic Revolution is not-for-profit and all proceeds from ticket sales and donations are spent on the event. Sonic Revolution is run for the enjoyment of fans and is not affiliated with or sponsored by SEGA or any of its subsidiaries. ? FAQs What are my transport/parking options getting to the event? The Holiday Inn LAX is right next to the 405. If coming from the north, exit onto S La Cienega Blvd and follow the road to the hotel. If coming from the south, exit on Century Blvd, make a left, and turn right on S La Cienega Blvd. There is $10 daily parking in the hotel parking lot for event attendees. There are also parking lots nearby (such as ValueParkLAX) where spots can be reserved for $13 a day and also reserved online.  Why is the event charging this year? There are two primary reasons for this change, but this decision was not made lightly, as we had desired to keep the event free like Summer of Sonic. Our first reason is finances; while we are paying for a good deal of the event out of pocket, we are still in need of extra funds to make sure we can cover all the event expenses such as venue hire, guests, etc. Our second reason is ensure a good headcount; though we distributed 200 tickets for the 2014 event, we only had a turnout of about 60. Adding a price tag to our tickets helps us have a more accurate idea of how many attendees will be showing up, which will help in our planning the venue. Where can I contact the organizer with any questions? Questions may be forwarded to angelidia@sonic-revolution.net. They may also be asked over at the event's Facebook page."
}