{
    "addr": "301 West 1st Street Los Angeles, CA 90012", 
    "title": "MCLE Cram Day is back!", 
    "url": "http://www.eventbrite.com/e/mcle-cram-day-is-back-tickets-19500735224?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-23T09:30:00-08:00", 
    "endtime": "2016-01-23T16:00:00-08:00", 
    "categories": [
        "Career", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Elimination of Bias * Ethics * Competence Issues ? ? All 6 credits for only $95!  Includes: morning coffee, light snacks and lunch ? Do you need last minute participatory MCLE credits? California attorneys whose last names begin with the letters A-G are required to report their MCLE credits to the State Bar by February 1, 2016. If you need extra MCLE credits before the deadline, join us for current video presentations covering all three required subject areas: elimination of bias, legal ethics and competence issues (formerly ?substance abuse?). ? Hot Topics in Legal Ethics ? This three-hour panel discussion was recorded by Mark L. Tuft of Cooper, White & Cooper LLP, and Ellen R. Peck, Former Judge, State Bar Court. Mark and Ellen review hot topics in legal ethics and recent developments in California and federal case law, provide practical risk management tips, and predict legal ethics trends for the future. ? Earn 3.0 hours Legal Ethics MCLE Credit ? ? ? The Ethics of Multi-Client Representation ? Hosted by Mark L. Tuft of Cooper, White & Cooper LLP, and Ellen R. Peck, Former Judge, State Bar Court, this one hour program reviews recent California state and federal court developments and trends regarding the representation of multiple clients in a single matter. ? Earn 1.0 hour Legal Ethics MCLE credit ? ? Elimination of Bias Update ? Join Judge Charles W. ?Tim? McCoy (Ret.) of Los Angeles Superior Court and Judge Erica R. Yew of Santa Clara Superior Court for this discussion of implicit and explicit bias, and how it can adversely affect every decisionmaking process in the justice system. ? Earn 1.0 Hour Elimination of Bias MCLE Credit ? ? Competence Issues (formerly ?Substance Abuse?) Presented by practitioners Bruce S. Ross and Cameron G. Stout, this program discusses the ways, good and bad, that lawyers can cope with a stressful profession. Learn about the dangers of substance abuse, plus techniques, therapies and organizations that offer significant resources to attorneys undergoing significant stress-related problems. ? Earn 1.0 hour Competence Issues MCLE credit.  ? ? For more information or to register please visit  www.lalawlibrary.org/CLASSES   or call 213.785.2516 today! This class fills quickly!"
}