{
    "addr": "5855 West Century Boulevard Los Angeles, CA 90045", 
    "title": "Alphay 2016 Los Angeles - Regional Summit, Jan 30-31", 
    "url": "http://www.eventbrite.com/e/alphay-2016-los-angeles-regional-summit-jan-30-31-tickets-18565826888?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Meeting or Networking Event"
    ], 
    "desc": "Alphay 2016 Los Angeles- Regional Summit! January 30-31, 2016 ? Accommodation & Rates: Los Angeles Airport Marriott Click here to book your special rate at $119\\night! Special rate available until Dec 31, 2015! ? Event Pricing: There will be 4 types of ticket, determined by the date you made your purchase. The earlier you make a purchase, the more you'll save! Here's how the pricing will change as we get closer to the launch date. ? Early-Bird Ticket for Members - $89 each ? Regular Ticket for Members - $99 each ? Door Ticket for Members - $120 per person ? Leadership Ticket ? If you are making purchases for your dowlines, for your convenience please be sure to enter their information under each Attendee. This will greatly help organize your tickets. Purchases are not refundable for this event, but you can change the name on your ticket. Instructions here:? http://help.eventbrite.ca/customer/portal/articles/430100-how-to-update-your-ticket-registration-information ? Schedule of event: Saturday, Jan 30, 2016 Sunday, Jan 31, 2016 Be sure you can attend the entire summit so that you won?t miss any of the key announcements and training sessions. ? More details will follow on specific times and locations for each session at the Summit. ? ? Do I have to bring my printed ticket to the event? Yes, tickets will be scanned at the event. We will also accept tickets from your smartphone\\tablet as long as the QR code can be scanned. Please have your tickets printed and available at the door. ? ? Purchases are not refundable for this event. You can change the name on your ticket. Instructions here:? http://help.eventbrite.ca/customer/portal/articles/430100-how-to-update-your-ticket-registration-information"
}