{
    "addr": "943 N. Broadway Los Angeles, California 90012", 
    "title": "38th Annual L.A. Chinatown Firecracker Bike Ride", 
    "url": "http://www.eventbrite.com/e/38th-annual-la-chinatown-firecracker-bike-ride-tickets-19150988121?aff=ebrowse", 
    "location": "Los Angeles, California", 
    "starttime": "2016-02-20T07:00:00-08:00", 
    "endtime": "2016-02-20T10:00:00-08:00", 
    "categories": [
        "Other", 
        "Race or Endurance Event"
    ], 
    "desc": "Online Registration at? https://racewire.com/register.php?id=5362 Two Bike Ride Routes to Choose From ? 20 Mile Ride Course and 30+ Mile Challenge Course.? The 20 mile route will be geared more towards families and casual riders. A major portion of the 20 mile ride will be along the LA River on the LA River Bike Path which is away from traffic and will have great views of the LA River. A 10 mile per hour pace is advised for this route. The 30+ mile route will feature challenging hills in Elysian Park, Griffith Park, and a loop around the Silverlake Reservoir. There will be some great view spots along the way. Bring your hill climbing legs for this route. There will be some elevation to accomplish! The 30+ mile ride will be completely on city streets. Both routes will have a rest stop where water, snacks, and fruit will be available. Porta- potties will be available for all at the rest stops. Please check back later for route maps and route directions. There will be a free Bag Check and Bike Valet near the registration area. All registered riders will be given a finisher medal at the conclusion of the ride. A carbo load snack will be available after the conclusion of the ride. All registered riders will get a Goodie Bag with various items and an event t-shirt. You can pick up your Goodie Bag before or after you complete your ride. Please come early for your Goodie Bag to ensure that you get the size shirt you need. Please observe the parking time limit on the parking meters in Chinatown on Saturday?the meters will be enforced. A better choice would be to come to the Ride on Metro?there is a Metro station not more than a block away from the start of the Ride. A free bag check will be available for all registered riders. Event Highlights All participants will receive an ultra-soft, ultra-comfy premium short sleeve t-shirt.Opening ceremonies for the 5/10K Run/Walk and Bike Ride include the lighting of firecrackers.5K and 10K runs are chip timed for fast & accurate results.Medal to the overall male and female winners in the 5K and 10K runs.Medal to the 1st, 2nd, and 3rd place finishers in each age category.Finisher's Medal.Free carbo load meal (Saturday, February 20, 2016).Goodie bag.Refreshments at the Start/Finish and along the Course.Admission to the Firecracker Festival, featuring live entertainment and vendors.Free bag check (only for Metro riders who show valid Metro Pass or TAP card).Carnival games and petting zoo for Kiddie Run participants.One free beer to all registered participants 21+ years of age.General Pricing5/10K Run/Walk or 20mi/30mi+ Bike Ride:Early: $33 (thru 9/7/15)Regular: $38 (9/8/15 - 12/20/15)Late: $43 (12/21/15 - 2/14/16)On-Site: Starting at $50 (2/20/16 - 2/21/16)Kiddie Run:Early: $15 (thru 9/7)Regular: $20 (9/8 - 12/20)Late: $25 (12/21 - 2/14)On-Site: Starting at $25 (2/20 - 2/21)T-Shirt Sizing (Unisex)Contemporary, slim fit. For a more relaxed fit, it is recommended to order a size up. Adult Chest Sizing*:XS (31\" - 34\")S (34\" - 37\")M (38\" - 41\")L (42\" - 45\")XL (46\" - 49\")2XL (50\" - 53\")3XL (54\" - 57\")Youth Chest Sizing*:M (31.5\" - 33.5\")L (33.5\" - 35.5\")*All measurements are approximate.Event Location943 N. Broadway, Los Angeles, CA 90012?(For mapping purposes use) Please observe the parking time limit on the parking meters in Chinatown on Saturday. The meters will be enforced. A better choice would be to come to the Ride on the Metro Gold Line. The Chinatown Metro Station is a block away from the start of the Ride. Bag check is free and will be available for all registered riders. Refund Policy All entry fees are non-refundable and non-transferable. You may not alter, reproduce, give or sell your number to another individual ? doing so will result in your disqualification as well as the participant who uses your race number. The entry fee for this year's event will NOT transfer to next year's event, no exceptions. This policy stays in effect whether you are injured, have an unexpected business or family emergency, pregnancy, etc. There are NO exceptions. Any inquiry regarding this policy will be directed back to this page. There is NO rain date, We Go Rain or Shine."
}