{
    "addr": "Los Angeles, California", 
    "title": "The Color Du Jour Experience (Los Angeles, CA)", 
    "url": "http://www.eventbrite.com/e/the-color-du-jour-experience-los-angeles-ca-tickets-19160343102?aff=ebrowse", 
    "location": "Los Angeles, California", 
    "starttime": "2016-02-20T13:30:00-08:00", 
    "endtime": "2016-02-20T17:30:00-08:00", 
    "categories": [
        "Fashion \\u0026 Beauty", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Color Du Jour invites you to join us for.... The Color Du Jour Experience is an exclusive hands-on makeup seminar! During this?4?hour event, participants?will follow along as Color Du Jour?guides them through a complete make up application from start to finish. Together the class will navigate through?techniques including foundation selection, brow shaping, shadow?blending, color correcting,?highlighting/contouring and much more.? In addition, Alaina?will be prepared to address questions throughout the class and during the Q&A session at the event's conclusion. Light treats and refreshments will also be available for attendees. Note:? This class has been designed for those with a beginner/immediate makeup skill level. Perfect class for individuals looking to develop skills \"from scratch\" to those wishing to build upon current base knowledge.? Attendees Are Required To Bring The Following Items: Foundation (i.e. AJ Crimson or MAC Matchmaster Foundation)? Powder (i.e. MAC Mineralized Powder) - Mandatory Concealer (i.e. MAC Studio Finish or LA Girl Pro Concealer) - Mandatory Two Lip Stick Colors?(one natural and one bold) Attendees Will Keep The Following Provided Items ($120 Value) ? 8pc Color Du Jour Brush Set ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?? Color Du Jour \"No More Shine\" Translucent Powder ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? Color Du Jour Makeup Prime & Set Spray ? Color Du Jour Moisturizer/Primer ? ? Lip Liner ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?? Eye Lashes Early Bird Registration Fee - $225 ($125 deposit) Regular Registration Fee - $250? ($150 deposit) Please note that the registration is only the deposit amount required to secure your seat. The remaining balance of $100 is due the day of the event upon entry. Only cash and major credit cards will be accepted. No personal checks.? What Is The Refund Policy? Class registration fees are nonrefundable as advance preparations are needed for each class. Prior to registering, please ensure that your schedule allows for you to attend. However, if for any reason the class is cancelled, a full refund will be given to each person.? Does the class require a certain skill level to attend? No particular skill level is required for this class. Both beginners and advanced individuals may attend. We do require that you maintain a willingness to learn :)? Are there ID requirements or an age limit to enter the event? Any attendees ages 17 and up may attend this event. Please bring a ID or driver's license for check-in.? What can/can't I bring to the event? See required makeup items listed above. In addition, you may bring a small makeup bag/kit if you choose. Cameras are recommended for photo purposes, however, video recording is not permitted.? Where can I contact the organizer with any questions? Should you have any questions regarding the class, please send an email to colordujour@gmail.com"
}