{
    "addr": "3200 Motor Avenue Los Angeles, CA 90034", 
    "title": "12th Annual Edna Reiss-Sophie Greenberg Chair And Conference", 
    "url": "http://www.eventbrite.com/e/12th-annual-edna-reiss-sophie-greenberg-chair-and-conference-tickets-19306641685?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-26T09:00:00-08:00", 
    "endtime": "2016-02-26T16:00:00-08:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Conference"
    ], 
    "desc": "6 CE Credits? ??Note: This is a Friday Presentation The Reiss-Davis Child Study Center And Institute?s 12th Annual Edna Reiss-Sophie Greenberg Chair And Conference Awarded to BRUCE PERRY, M.D., PH.D. Dr. Perry is an internationally known psychiatrist, clinician, researcher, educator, and consultant who has made a major contribution to our understanding of trauma in young people by integrating the field of child/adolescent mental health and neurosciences to expose how trauma and neglect affect the biology of the brain and, thereby, the health of the child. Through his research, training, consultation, and writings including his 2008 bestselling? book, The Boy Who Was Raised As a Dog, based on his own work with maltreated children, he has incorporated the latest principles of developmental neuroscience and clinical practice; creating innovative clinical practices and programs to work with maltreated and traumatized children including, most prominently, his Neurosequential Model and its application in working clinically with children, adolescents and their parents, which will be a major focus of this conference. It is for all these contributions, that Dr. Perry is being awarded this year?s Edna Reiss-Sophie Greenberg Chair. ? Dr. Perry?s presentation is entitled: INTRODUCTION TO THE NEUROSEQUENTIAL?MODEL OF THERAPEUTICS ?In this special six hour conference, Dr. Perry will share his expertise and years of research and clinical experience working with maltreated and traumatized children and their parents, by exploring the foundational elements of his well-respected Neurosequential Model in a? presentation that will have relevance for? all clinicians who work with children, adolescents, and/or their parents, but be especially valuable for? those professionals working with maltreated or traumatized young people and their parents. ? Learning Objectives: Explain the key principles of neurodevelopment crucial for understanding the role of experience in defining functional and physical organization of the brain Describe the emerging clinical/research findings in maltreated children that suggest the negative impact of abuse, neglect and trauma on brain development List the clinical implications of a neurodevelopmental approach to child maltreatment Discuss the role of public policy and prevention relating to the impact of maltreatment on children's emotional, behavioral, cognitive, social and physical health Don?t miss the opportunity to personally experience this master clinician, researcher, and teacher to better understand why he is being honored as our 12th Edna Reiss-Sophie Greenberg Chair."
}