{
    "addr": "1933 South Broadway Los Angeles, CA 90007", 
    "title": "LA WEEKLY Presents Sips and Sweets", 
    "url": "http://www.eventbrite.com/e/la-weekly-presents-sips-and-sweets-tickets-19160826548?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-12T19:00:00-08:00", 
    "endtime": "2015-12-12T23:00:00-08:00", 
    "categories": [
        "Food", 
        "Festival or Fair"
    ], 
    "desc": "The SoCal Etsy Guild? Is An Official? Sponsor? Of LA Weekly's  Sips and Sweets ? ? ? To purchase tickets to attend this event as a customer go to  www.laweekly.com/SipsandSweets ? Book now through the SoCal Etsy Guild and receive an exclusive discounted vendor rate. This is an amazing advertising and vending opportunity! Don't miss out on this exclusive rate. The sooner you sign up the more exposure and advertising you will receive. Spaces typically sell for $500-$700 The special SoCal Etsy Guild rate is $300 if you sign up now! Only a limited amount of vendor spaces a re available at this rate.? LA Weekly is proud to Sips & Sweets 2015! In its second year, our now annual holiday party will feature over 20 of the city's top bakers, over 15 of LA's most respected mixologists and more than 25 artisanal craftspeople. Join us Saturday, December 12th from 8pm ? 11pm and sample delicious confections, sip on handcrafted cocktails and shop for amazing holiday gifts and trinkets. Curated by the LA Weekly's own food critic Besha Rodell and Roxana Jullapat, this eating, drinking and shopping extravaganza is one not to be missed. VENDOR DETAILS Each vendor space is large enough for one standard 6ft table. Multiple spaces can be purchased. ?One 6 ft table and linen is provided for each vendor. This event is indoors. Chairs are not provided. Electricity is available upon request. Wifi is not guaranteed. All vendors, staff, and attendees must be 21 and over. Each vendor space purchased will be given two free vendor passes. One for you and one for a helper. Free street parking and paid parking lots are available. ? All vendors will receive significant media support and be advertised by the SoCal Etsy Guild and LA Weekly. ? Your Business Name, website, and logo will be featured on the LA Weekly website and featured on LA Weekly social Media sites. ? ? Upon signing up please immediately send your logo to spayan@socaletsyguild.com so we may start promoting you. ? Exact details in regards to load in and break down will be sent out the week of the event. ? This event is open to vendors selling fashion, handmade, vintage, art, original design, and pre packaged food. ? NO refunds will be issued for this event unless the event is cancelled by the organizer. A certain number of sales or customers are not guaranteed. We are not responsible for lost, stolen, or damaged merchandise or displays. We are not responsible for extreme weather or acts of god."
}