{
    "addr": "East 6th Street Los Angeles, CA", 
    "title": "THE ART OF FEMALE DOMINATION: HOW TO DO ANY SCENE", 
    "url": "http://www.eventbrite.com/e/the-art-of-female-domination-how-to-do-any-scene-tickets-19720218705?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-11-29T16:00:00-08:00", 
    "endtime": "2015-11-29T17:30:00-08:00", 
    "categories": [
        "Hobbies \\u0026 Special Interest", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Are you 50 Shades of Grey curious? Then do not come to this class. If, however, you are a Woman who is curious about how You can harness Your power as a Woman to have more control in Your career, over men and in your life through the erotic art of Female Domination, then this class is for you. Whether you are looking to spice up your sex life, be more in-control professionally, thinking about becoming a Dominatrix, or are a service provider looking to expand your bag of tricks, you will get the psychology and tools you need to get started. In this class you will learn - How to do any kind of scene:  The psychology the beta male mind Congrats! You're a Dominatrix, new or experienced in the BDSM scene. So you've discovered the cool thing about SM is IT NEVER GETS BORING. There's always something new, whether you've been doing it for a few months or decades. So that's the good news. The bad news is how can any one Mistress, no matter how smart or creative be prepared to do any kind of scene? The possibilities are just too overwhelming. Well the secret is understanding the psychology, neurology and anatomy of the male slave. Once your grasp the psychology of the different fetishes and fantasies, you'll be able to predict what other kinks your male bottom has and he will think You are an amazing PSYCHIC GODDESS! He will be awestricken at how (he thinks) you read his mind, anticipate his needs and seem to know his mind better then he does. Topics covered include: 1. The 3 different types of bottoms, which one is he? 2. The 2 different types of pain and what they tell you about Your slave 3. What to say; Talking about Yourself, Talking about Your fantasies, and choosing Your unique language. Words are powerful: buzzwords & triggers 4. Foot fetish / foot slavery / shoe and boot fetish / foot and domination / trampling 5. Wardrobe Fetishes: Do the clothes make the Mistress? Leather / Latex / Rubber / PVC / Uniforms / Fantasy Costumes / Cos Play / Vintage lingerie / Pantyhose / Shoes and Boots 6. Smothering / Face sitting / scent play / Items of the Mistress's Essence / Spit / Golden Showers / Full Toilet Training / Scat Games 7 Bondage: Rope Bondage / Leather Restraint / Predicament Bondage / Contortion Bondage / Inescapable Bondage / Mummification / Encasement 8. OTK Spanking, Caning / Domestic Discipline and Taboo Fantasies: School Teacher, Mother, Auntie, Baby Sitter, Executive, Boss, Secretary, Next Door Neighbor / Friend of the Family / Older Woman 9. Role Reversals: Cross Dressing / Full Feminization / Sissy Training / Sissy Maid / Slut Training / Strap on Dildo Training / Anal / Fisting / Forced Bi / Cuckolding / Small Penis Humiliation / Chastity / Whore Training / Being turned out / BBC 10. Humiliation: Verbal, Physical and Public Humiliation, Verbal Humiliation vs Verbal Abuse, Racial Humiliation, Size Comparison Humiliation, SPH, Gender Humiliation 11. Physical Domination / Wrestling / Beat Downs / Ball Busting and Amazon Fantasies 12. Spitting / Human Spittoon Training / Face Slapping / Smoking Fetish / Cigarette Torture, Human Ashtray Service and other invasions of the face 13. CBT (cock and ball Torture) Nipple Torture / Prolonged Erotic Torture / Sensation Play / Electrical / Chastity 14. Slave and Obedience Training / Behavior Modification / Female Supremacy / Corporal Punishment 15. From Naughty Nurse Fantasies to Heavy Medical and Invasive scenes, From Exams to Unorthodox Procedures and Treatments: Enemas / Catheters / Sounds / Play Piercing / Cutting / Blood Sport 16. Prisoner /Kidnapping / Interrogation / P.O.W. / Military / Police / Nazi 17. Dog Training / Puppy Play / Equestrian / Pony Play / Piggies and other Farm Animals and Livestock Instructor: Tara Indiana Single Women $20 advance plus ticketing fee / $30 at the door (space permitting) Couples and single men $30 in advance / 40 at the door (space permitting This class is open to single women, couples, single men, and all sexual orientations For info call the Den of Iniquity at 213 623 1520"
}