{
    "addr": "1503 South Central Ave Los Angeles, California 90021", 
    "title": "Wine, Art and Justice Pop Up - #Giving Tuesday", 
    "url": "http://www.eventbrite.com/e/wine-art-and-justice-pop-up-giving-tuesday-tickets-19437180129?aff=ebrowse", 
    "location": "Los Angeles, California", 
    "starttime": "2015-12-01T18:30:00-08:00", 
    "endtime": "2015-12-01T21:30:00-08:00", 
    "categories": [
        "Wine", 
        "Festival or Fair"
    ], 
    "desc": "For those of you who like to give in style. Join Black Women for Wellness for our very special #GivingTuesday Arts, Wine and Justice Pop Up in celebration of Black women and girls. The entry fee is your online donations to BWW for #GivingTuesday. Who knew giving can be so fun! ? For a $10 minimum donation, you will be able to partake in one of our special signature cocktails, international beers and vegan/vegetarian samplers as well as take in some local art (more about the art show below), poetry and music. For a $20 donation BWW will send you a set of our speciality stickers plus  you will be able to partake in one of our special signature cocktails, international beers and vegan/vegetarian samplers as well as take in some local art (more about the art show below), poetry and music. .? For those of you who have a little more to spend, we have limited tickets for $100 donation for our special food, wine/beer tasting and demonstration pop up, with our very own Chef Veronica. She will be whipping up some of her favorite recipes on the spot and they would be paired with a flight of wine or beer. All participants will be able to go home with the recipes as well as chat with our local Chef as she does her thang. This is great for folks looking for new / healthy recipes for the holidays or the new year.? Art Show: Taste How do our food choices and traditions contribute to our understanding of identity? For many, taste is increasingly seen as cultural capital and in current visual culture, people are expressing themselves more and more by what they eat: whether through a subscription to a foodie magazine, an instagram feed showcasing recent epicurean conquests, or an understanding and appreciation for locavorism or globally-source delicacies. Taste showcases a unique look at how cultural, socio-economic background, lifestyle, gender and political expression manifest through our food. Centering on how food and food culture can make powerful statement about who we are both individually and as a community. This show will include several different disciplines including sculpture, video, painting, and photography.? We all know about Black Friday, Small shop Saturday and Cyber Monday, but what is?#GivingTuesday. Starting in 2012, #GivingTuesday is now known as a global day of giving back.?It Is the one day dedicated throughout the year to say pass it forward to the organizations and?people in them that hold down all year long. It is the Tuesday directly following Thanksgiving?and this year will be on Dec 1, 2015. Research has shown that Black girls often feel like they are not seen, heard or valued.  Your donation will go to BWW's Get Smart B4U  Get Sexy program, which is a multi prong approach to building the self worth of Black girls in hopes to address the high rates of STI?s, Intimate Partner Violence and unintended pregnancies experience by and impacting Black girls. Specifically your donation will support: providing culturally competent leadership development trainings for girls and young women developing in class curriculum for high school girls about reproductive and sexual health blending art and justice together to create diverse media representation in print, video, and in performance art training young women in advocacy skills to speak with elected officials/as well as transportation to Sacramento and Washington D.C. working on policies that deconstruct some of the institutional and social barriers that impact ?Black girls health, i.e. crisis pregnancy centers, mandated sex education, decriminalization of traffic minors and expanded access to teen healthcare needs creating and youth advisory group that informs community organizations and government agencies on the issues and the solutions that impact young people as it come to their reproductive and sexual health To check out our campaign head to? Get Smart B4U Get Sexy For more information please contact Jom or Nourbese at 323-290-5955 or jom@bwwla.com/ nourbese@bwwla.com."
}