{
    "addr": "East 6th Street Los Angeles, CA", 
    "title": "HOW to HIT ANYONE with ANYTHING! Whips, Canes and Paddles", 
    "url": "http://www.eventbrite.com/e/how-to-hit-anyone-with-anything-whips-canes-and-paddles-tickets-19390720166?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-06T14:00:00-08:00", 
    "endtime": "2015-12-06T21:00:00-08:00", 
    "categories": [
        "Adult", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Are you 50 Shades of Grey curious? Then do not come to this class. If, however, you are a Woman who is curious about how You can harness Your power as a Woman to have more control in Your career, over men and in your life through the erotic art of Female Domination, then this class is for you. Whether you are looking to spice up your sex life, be more in-control professionally, thinking about becoming a Dominatrix, or are a service provider looking to expand your bag of tricks, you will get the psychology and tools you need to get started.? This class in the Female Domination series is a 6 hour intensive on Impact play and all things ouchy; Floggers, Crops, Paddles, Canes, Singletails and more! You will learn: BASIC FLOGGING 2-3:30 1. The physics of flogging  and accessing floggers; chosssing the best flogger for You, your bottom and the occasion. 2. Basic Flogging: ?This style is used for disciplinary, punishment and training?purposes and generally adminstered to the buttocks ans sometimes back when the bottom is in a horizontal positions ? 3. Zena Warrior Princess Style Flogging:  This Style is also used for?used for?disciplinary, punishment?and training?purposes?and generally adminstered to the back and, sometimes, chest when the bottom is in a vertical position. ? 15 MINUTE BREAK SPANKING 3:45-5:15 ? 4. The different implement of spanking;? barehand, leather and wooden paddles, frat paddles, hair brushes, wooden spoons, spatchulas, and other domestic goodies. How to pick the right one for You and the physics of spanking. 5. Psychology, proprs, atmosphere, and attire? of Spanking and Domestic Discipline 6. Cross over fetishes;  School Teacher, Baby Sitter, School Marm, Age Regressions, Auntie, Nun, Daddy, Uncle, Boss, Secretary, Executive, Sissy Maid and more! 7. Spanking techniques:? Warm up, barehand, cupping, OTK administration and positioning for your bottom ? 1 HOUR BREAK FOR DINNER 5:15PM ADVANCED FLOGGING 6:15-7:45PM: 8. Sensual Flogging:  This style feels like a sensual body massage and can be gradually built up so that the nervous bottom discovers he can actually take and even enjoy a heavy whipping. It is adminstered on the back and buttucks with the bottom generally in the horizontal position. Great for both beginners and advanced players. 9. Flournetine Flogging ?(Two handed):? Thought to have originated in 18th Century France, Flourentine Flogging is a two handing whipping style to be done in rythym with music. Like sensual flogging,?This style feels like a sensual full body massage and can be gradually built up so that the nervous bottom discovers he can actually can take and even enjoy a heavy whipping. It is adminstered on the back, buttucks, thighs and entire legs, chest, groin, arms, etc with the bottom generally in the vertical position. Great for both beginners and advanced players. 15 MINUTE BREAK ? BASIC CROPS, CANES, SINGLETAILS 8-9PM 10. Crops: ?Selection, care and differenent kinds of crops. The different parts of the crop and how the different parts feel, Warm-up, form and techniques, where to hit and where not to hit, and general safety. 11. Caning: ?Selection, care and differenent kinds of canes. Warm-up, form and techniques of caning, where to hit and where not to hit, and general safety. 12. Singletails: ? Selection, care and differenent kinds of singletails. Form and techniques of singletails, where to hit and where not to hit, and general safety. Instructor: Tara Indiana This is a hands on class, you will be doing whipping. Come dressed comfortably and wearing undergarments or a swimsuit under your street clothes. No free balling or commando. This class is open to single women, ?and couples and submissive single men looking to be practice dummies. Call the Den of Iniquity at 213 623 1520 for more info"
}