{
    "addr": "369 E 1st St Los Angeles, CA 90012", 
    "title": "SIX TASTE Little Tokyo Walking Public Food Tour 12.19.15", 
    "url": "http://www.eventbrite.com/e/six-taste-little-tokyo-walking-public-food-tour-121915-tickets-19282385133?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-19T10:30:00-08:00", 
    "endtime": "2015-12-19T14:30:00-08:00", 
    "categories": [
        "Food", 
        "Tour"
    ], 
    "desc": "Get a taste of Little Tokyo, one of the country's only 'Japantowns' and the original Six Taste tour.? Guests can expect to learn about Little Tokyo history, Japanese culture, and the local culinary scene. This tour may not be suited for a vegan or a gluten-free diet. ITINERARY Guests will be led on a route of about 6-7 eateries on roughly 4 walking blocks.? The tour lasts about 4 hours.? Some restaurant stops and tastings may include tea tasting at Chado Tea Room, red bean pastries (imagawayaki) at Mitsuru Caf?, poke bowls at Snociety Urban Eatery, fusion tacos and wasabi fries at Far Bar, and rainbow dango from Fugetsu Do Bakery. Pick/Up Departure (Location) The tour begins on the steps in front of the Japanese American National Museum (369 E. 1st Street, Los Angeles, CA 90012). The tour guide can be identified by the canvas bags with 'Six Taste' on the sides that he or she will be carrying. He or she will also likely be carrying a clipboard. There are several parking lots around Little Tokyo. The cheapest nearby lot is on 1st and Central across from the museum at the cost of $8 for the day.? Parking rates are subject to change. Drop / Off Return (Location) ? Guests will be walked back to the front of the museum at the end of the tour. Metro Take the Gold Line to the Little Tokyo/Arts District stop. For information about schedule and fares, use the Metro trip planner at www.metro.net or call 323.GO.METRO. GENERAL INFORMATION If you have any dietary restrictions or allergies, please let us know at least 72 hours in advance .? Otherwise, alternatives cannot be guaranteed and additional charges may apply. ?We do our best to accommodate any special needs or considerations including wheelchairs, strollers, babies or young children.? Advance purchase required. Any same-day add-ons of guests will incur an additional $20 fee. ? The amount of tastings on the tour is equivalent to a full meal. The tours begin with a 15-minute introduction, so if you are running late, you will still be able to find your group at the meeting location. **In the tourism industry, it is customary to tip a standard gratuity of 15% to 20% of the retail price of the tour. If you enjoyed your time on the tour, please be sure to take care of our tour guides. Tip Guide: 15% of 1 ticket= $9; 20% of 1 ticket= $12 TERMS AND CONDITIONS Tickets are non-refundable.? If you need to reschedule, you must contact Six Taste at least 72 hours in advance.? Otherwise, there are no refunds or exchanges for no-shows.? Six Taste reserves the right to cancel tours due to low attendance.? In this case, you will be notified and refunded the evening before the tour date.?? SUGGESTED ITEMS TO BRING Water,  sunscreen, comfortable walking shoes, cash for any desired purchases, a camera. CONTACT INFORMATION 213.798.4749"
}