{
    "addr": "611 North Fairfax Los Angeles, CA 90036", 
    "title": "Barbro Karlen in person -- The Reincarnation of Anne Frank!", 
    "url": "http://www.eventbrite.com/e/barbro-karlen-in-person-the-reincarnation-of-anne-frank-tickets-19418791127?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-23T11:30:00-08:00", 
    "endtime": "2016-01-23T14:30:00-08:00", 
    "categories": [], 
    "desc": "Please join YES Salon and hear ?Barbro Karlen, in person, share the riveting story of her life as Anne Frank. This will be a very personal presentation with time for questions and answers, time to mingle and share with each other on the patio, and, of course, time for good food. It's a potuck! Barbro's big YES was her decision to go public with her life story, risking potential ridicule and criticism when she wrote her autobiography, And the Wolves Howled. Barbro will share the story of how, at age 2, she told her mother that her name was Anne Frank, (before the story of Anne Frank had been published) how at age 12, she became a best selling author in Sweden, and how experiences in her adult life triggered memories and trauma--until she said YES to telling the story of her essential self, and the journey of the telling set her free. Her screen-writing partner, Aramis Fontenol, will also be joining us and will share the remarkable story of his meeting with Barbro and the journey they took together co-writing a multi-dimensional screen-play. In 2013, along with Dr. Walter Semkiw, MD and esteemed writer/researcher on reincarnation, Barbro was a featured speaker at Cal State San Bernadino. The event was inspired by Professor Mary Fong who created the hugely popular course, Spiritual Communication. ?After 5 decades of research, the subject of reincarnation has made the Cal State University curriculum. Mary told me she is planning on joining our event! We'll ?keep you posted through Facebook. November, 2015, once again, Barbro Karlen and Dr. Semkiw will be featured speakers--this time at NAC (National Association of Communication) in Las Vegas. ? At our YES Salon, there will be a limited number of her books available for purchase. If you would like her to autograph one, you might consider purchasing one ahead of time and bring it with you. Here's a YouTube interview of Barbro Karlen by Walter Semkiw that includes highlights of her story. https://www.youtube.com/ watch?v=xcUX8ZIwxIk Much love and gratitude, as we change the world together, one YES at a time. Lael Belove, Founder YES Innerprizes / YES Salons Thank you to our sponsors: Cinefamily, SICA (Subud International Cultural Association) an IONS~LA (Institute of Noetic Sciences-LA ?? \"Changing the world together, one YES at a time.\""
}