{
    "addr": "1201 South Figueroa Street Los Angeles, CA 90015", 
    "title": "Los Angeles Ultimate Women's Expo May 21-22, 2016", 
    "url": "http://www.eventbrite.com/e/los-angeles-ultimate-womens-expo-may-21-22-2016-tickets-19372461554?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Beauty", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "Shop at hundreds of?Boutique shopping booths featuring the very best Los Angeles?has to offer in shopping, fashion, food, entertainment, cosmetics, travel, jewelry, accessories, home decor, entertaining and much more.? Spend a relaxing day being pampered with spa treatments, massages, shopping, samples, inspiring Celebrity Keynote Speakers and endless retail therapy. Y ou've been balancing a busy life and it's time to grab your girlfriends and enjoy free manicures, facials, exciting makeovers and fragrance treatments featuring Chanel, Dior, Dolce and Gabbana, Gucci, Marc Jacobs, Calvin Klein, Thierry Mugler, Lancome, Estee Lauder and more.? Plus, complimentary hair styling and haircuts, amazing spa treatments and massages. Indulge in lots of free samples, gourmet tastings and delicacies. Get  inspired at the Do-It-Herself Workshops, the cupcake and cake d?cor, cooking stage, floral decorating and gardening workshops, wine tastings, martinis, chocolate and truffle making, ?transforming trash into treasure furniture rehab workshops and jewelry making.  Discover the season's best from luxury boutiques to emerging designers. We scour the world searching for the very best products and services, and?bring hundreds of these amazing companies together.??  We've gathered the very best leading companies, boutiques and brands together to bring a new level of Women's Expo to Los Angeles.?  Tickets include all Keynote Speakers, Complimentary Beauty Treatments and Makeovers, Seminars, Fashion Shows, Do-It-Herself Workshops, Stages and over 400 Shopping Booths! Never before have there been so many great reasons to visit a?Women's Expo - The Los Angeles Ultimate Women's Expo!??  www.lawomensexpo.com"
}