{
    "addr": "Los Angeles, CA 90066", 
    "title": "Cuddle Up - A Place to Connect, Cuddle & Commune Together!", 
    "url": "http://www.eventbrite.com/e/cuddle-up-a-place-to-connect-cuddle-commune-together-tickets-19254950074?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-20T18:00:00-08:00", 
    "endtime": "2015-12-20T21:00:00-08:00", 
    "categories": [
        "Personal health", 
        "Party or Social Gathering"
    ], 
    "desc": "Are you ready to? Cuddle Up! ? It?s that time of year! And yes...Another Cuddle Up right after the last! Time to Cozy in, Warm up next to others! Pull a warm human close, talk, share, giggle? Ask for what you want and need And Cuddle UP! ? This is a place to dance in the bliss of touch, receiving and giving consensual touch in a safe & loving environment! ? WHEN:  Sunday December 20th, 6-9:00pm (doors close at 6:30) WHERE:  In private home in Mar Vista COST:  $25.00 in advance/$35.00 day of event *space is limited* ? ?This is a partially structured, safe,  non-sexual, non-drug and alcohol-free  event. ? WHAT:  A Cuddle Up is a fun, playful, potluck & workshop about connection, boundaries and communication that includes an abundance of nurturing and affectionate touch. ? WHY: We know that healthy touch slows our heart rate, reduces anxiety, and promotes feelings of safety and security. Research tells us, in fact, that touch is the most neglected of our five basic senses, and yet the only sense essential to life. It's a GREAT way to create community!!! ? WHAT WE WILL SHARE: Meeting new people, loving touch, food, giving and receiving consensual touch, asking for what we want, experiencing the joy of our YES and NO, and opening your heart and senses to loving touch and connection with amazing people. ? WHAT HAPPENS AT A CUDDLE UP Cuddling can mean feet against feet, head or shoulder rubs, full-body hugs, spooning - it is entirely up to you. You can participate according to your desires and comfort level (it is perfectly ok if you just want to talk and not touch anyone for a while or not at all - YOU ARE ALWAYS AT CHOICE!!!). You will have a great opportunity to meet and connect with other cuddle-minded people in a safe and relaxing environment. ? ?I felt so filled with love? ? Join the fun! Improve your health! Meet new people! And even, perhaps, learn something along the way?? Come cuddle:) ? Facilitated by Heather Rhea Dawn-Cuddle Bug!  A Cuddle Facilitator; Massage Therapist for over 25 years, a Touch & Intimacy Coach and a Certified Tantra Educator. Touch and Dance has been her whole life?she knows how much healing and opening can happen when people are touched, held and cuddled! ? RSVP & Prepayment is necessary as I will be working to make it as gender balanced as possible. Please contact me at  gypsysundancer@yahoo.com  or 424-222-2517! Look up Cuddle Up on Facebook for more info. I look forward to cuddling with you! ? \"Complete bliss, so what I needed\" ? SCHEDULE 6:00pm-6:30pm - Arrive, relax, set up blankets and pillows (be sure to  arrive before   6:30pm  as doors will close at that time). 6:30pm-7:30pm-ish - Go over rules, practice exercises, boundary setting, and be guided through some ways to cuddle, touch and caress another.?? 7:30pm-8:45pm - Cuddling, hanging out, enjoy getting to know others?making requests or not.? 8:45pm ? Closing circle, sharing, cleaning up and good byes! ? ? What to Bring:  bring water bottle, blankets, pillows, a stuffed animal if you'd like, some light snacks?and?juice, sparkling cider/water (no alcohol)?to share.? What to wear:  think cozy, comfy, feel good, soft, yummy, bring layers, you may get warm, you may cool off, socks or Onesies are always good too. Or sweats, full body pj's- tops and bottoms, flannel or cotton. Feel good clothes! (more drawstrings,?less lace! No shorts.) ? ? GUIDELINES: All clothes must stay on the whole time You must ask permission and get a verbal ?yes? before touching anyone. You don?t have to cuddle, touch or be touched by anyone if you don?t want to?you can be a witness?witnessing is participation! If you are a Yes?say yes, if not?say no?there are on maybe?s here. You can change your mind and are encouraged to change you mind any time you want to! All emotions are welcomed here?tears and laughter! Respect all agreements you have with your partner and with yourself. ? Feel free to invite friends?bring friends?.and have some fun with us! Bliss, Heather"
}