{
    "addr": "1640 N Cahuenga Blvd Los Angeles, CA 90028", 
    "title": "7th Hollywood VIP New Years - 4 Party All Access Pass", 
    "url": "http://www.eventbrite.com/e/7th-hollywood-vip-new-years-4-party-all-access-pass-tickets-18305631637?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-31T21:00:00-08:00", 
    "endtime": "2016-01-01T04:00:00-08:00", 
    "categories": [
        "New Years Eve", 
        "Party or Social Gathering"
    ], 
    "desc": "California Nightlife ?Presents... The 7 th Annual? Hollywood VIP 2016 New Year?s Eve 3-5 Top LA New Years Parties (up to 7 Venues) All-in-One VIP ALL ACCESS PASS This is the? Ultimate ?New Year?s Eve experience , It gives VIPs the freedom to walk the Hollywood Boulevard of Fame, and you can step into the biggest & best clubs Hollywood has to offer with little to no wait, and you can life the life of a true Hollywood Celebrity. We're pleased to announce our best line-up of New Years's Parties in the entire 6 years of doing our Hollywood All Access Pass:? You will have VIP entrance at all the clubs with one all access pass: 1) Golden Hollywood VIP Ticket | The Perks: Once you check-in and receive your pass at the Check-in?Location between 9:00pm ? 11:00pm. 3) Diamond Ultra VIP Ticket | The Perks: Absolutely the best value for the most fun on New Year?s Eve. All Parties are within walking distance from each other. You'll get a map, a badge, and tickets to each party, if one doesn't fit your fancy, you can head to another, and another, and another... Your New Year's Eve could have the Ultimate VIP Experience if you're a complete Rock Star like we know you are! : | Full Disclaimer | : Each venue must abide by Fire Marshall and capacity issues. In which case, you may not be able to enter a venue immediately. VIP hosts will be at each entrance to make sure you get in a timely fashion or will give you up to the minute information on locations that are not at capacity. VIP Holders have first opportunity to enter as patrons exit. For the Midnight Countdown purposes, please allow ample time up to 15-20 minutes upon leaving a venue upon arriving at another venue. We don't want you to miss this opportunity so please take this into consideration. Each venue may have private/reserved sections of the venue that are not accessible to Hollywood VIP Ticket holders. Have fun:-) ::| Check in TBD / Hollywood Blvd | Hollywood, CA 90028 ::: Only 200 Passes Available, once they sell out, we cannot sell one more. We sell out every year."
}