{
    "addr": "Los Angeles, CA 90015", 
    "title": "2016 LIT College Tour Los Angeles - National Conference & Expo", 
    "url": "http://www.eventbrite.com/e/2016-lit-college-tour-los-angeles-national-conference-expo-tickets-18264711243?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-30T09:30:00-08:00", 
    "endtime": "2016-01-30T17:00:00-08:00", 
    "categories": [
        "Career", 
        "Conference"
    ], 
    "desc": "LIT College Tour \"The Ultimate Student Leadership Conference\" kicks off the new year in L.A.? on Saturday, January 30, 2016, with an action packed day of LIT = Leadership, Innovation, Transformation.? ? The 2016 National Conference & Expo will feature more national guests, a career expo, speed mentoring, and more.  2016 featured guest speakers:  Zayda Rivera, Entertainment Reporter, New York Daily News Mario Cobian , CEO, Cobian Marketing Group LIT College Tour is designed to inspire student (LIT) Leadership, Innovation and Transformation, and fuel change through experiential learning, mentorship, internships, jobs, networking and professional development. LIT College Tour brings together an exciting mix of entrepreneurs, professionals and millennial student influencers ready to share their insights and strategies for \"Igniting Futures,\" and helping bridge the gap between college and the working world for the next generation of millennial leaders. Our full-day boot-camp offers an action-packed day of rapid-fire learning, leadership development and transformational experiences. The conference includes 5 learning tracks, 3 keynotes and 2 workshops, and 20-30 industry experts, emerging leaders and student influencers from diverse industries including Entrepreneurship, STEAM, Marketing, Media, Entertainment, Law, Finance and related fields. LIT College Tour is hosted 6+ major markets, presents over 200 speakers and reaches over 2,000 multicultural student leaders!? Past speakers include CEO?s & Executive?s of Fortune 500?s and industry leading companies, Emmy-award winning journalists, future astronauts, investors, startup gurus, tech innovators, student influencers, recruiters and other thought leaders. ? Highlights from 2015 events: Want to reach, engage and activate your Brand at LIT College Tour? ? We offer superb sponsorship opportunities backed by integrated marketing and communications campaigns that will achieve your brand goals and position your company for success. From high-profile social media efforts to face-to-face on-site engagement, our programs deliver effective, productive and profitable results.? Have questions regarding partnerships, sponsorships or general event info?? Contact ignitingfutures@litcollegetour.com or 323-844-1864. Connect with LIT:  www.litcollegetour.com   Twitter.com/litcollegetour ? Facebook.com/litcollegetour ? Instagram.com/litcollegetour ?? Google.com/+litcollegetour ?? linkedin.com/company/lit-college-tour"
}