{
    "addr": "7655 Sunset Boulevard Los Angeles, CA 90046", 
    "title": "American Violence LA Premiere", 
    "url": "http://www.eventbrite.com/e/american-violence-la-premiere-tickets-19002292368?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-07T19:00:00-08:00", 
    "endtime": "2015-12-07T22:00:00-08:00", 
    "categories": [
        "Film", 
        "Screening"
    ], 
    "desc": "Book your tickets for the 'American Violence' Los Angeles Premiere ahead of its VOD and digital platform release on December 8th, 2015, courtesy of Integrated Arts & Media, Stockholm Pictures and EMR Media. The highly anticipated Integrated Arts & Media and Stockholm Pictures feature-film ?American Violence? has set its VOD and digital release date. The nail biting rollercoaster action-thriller movie, starring Dominican Republic actress Katherine Castro, is being released on all digital platforms through Premier Entertainment Group and eOne Entertainment on December 8th, 2015. General Admission Doors: 6:45pm Red Carpet Arrivals: 7:00pm American Violence Screening: 7:30pm Written and directed by Brent Conley, and produced by Adric Braithwaite,  ?American Violence?  follows crooked police that plague the city and a Russian mafia family who is at war with a Mexican cartel group for drug laundering. However, little do these two families know that these chain of events will lead to their own demise by the hands of the notorious indigo serial killer. Watch the latest ? American Violence?  teaser trailer here on Vimeo -  https://vimeo.com/140988390 .  Other cast members of  ?American Violence?  include; Nelson Bonilla (Let?s Be Cops), Alina Gorun (Contract Lovers),? Adi Spektor (How To Rob A House), Johnjay Fitih (Born In Battle) Rose Bianco (Contraband), Tony Guerrero (Mena), Eugene Alper (Call of Duty) and Marek Matousek (Jane The Virgin). Fans of ?American Violence? will be able to download the film from midnight on December 8th after its Los Angeles premiere on December 7th at Harmony Gold on Sunset Boulevard, Hollywood.  Book your tickets and bring the Eventbrite print out to gain theatre access on December 7th. This event will fill up quick and will be on a first-come first-served basis on the day.   Follow the film at:  www.facebook.com/AmericanViolence  - #AmericanViolence"
}