{
    "addr": "Los Angeles, CA", 
    "title": "Super Bowl Cruise 2016", 
    "url": "http://www.eventbrite.com/e/super-bowl-cruise-2016-tickets-17949327923?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-05T16:00:00-08:00", 
    "endtime": "2016-02-09T07:00:00-08:00", 
    "categories": [
        "Travel", 
        "Party or Social Gathering"
    ], 
    "desc": "LAST CALL!!! ? ? ? The Ultimate 2016 Super Bowl Party at Sea! ? ? Join Us on This 4 Night, Ultimate Super Bowl Party at Sea from Los Angeles, CA to Ensenada, Mexico!? ? Reserve YOUR Cabin Today For only $100 per person! (Final Payment Due by December 3, 2015) ?? NO PASSPORTS NEEDED! Read Cruise Policies Below ? ? BEST PRICE GUARANTEE! You Won't Find a Better Price for? This Super Bowl Cruise  Sailing! If You Do, Just Let Us Know  & We Will Match It GUARANTEED! ? ? DON'T FORGET! SHARE, BOOKMARK & SAVE THIS PAGE FOR FUTURE REFERENCE! ? Itinerary: Fri, Feb. 5 - Tues, Feb. 9, 2016 Indulge in all-you-can eat food, unbeatable nightlife, award winning spa treatments, delightful shopping and memorable excursions in both San Diego & Ensenada.???Take in the action on the Big Screens aboard \"the Crown Princess\" after a day of shopping and site-seeing in San Diego. In Ensenada, Mexico you can go on a tour of the local culture, score some great deals in the Mexican market or party at World Famous Pappa's and Beer. Whatever you decide to do, you'll enjoy a Super Bowl experience, you won't soon forget! ? PRICES ? Prices for Double Occupancy Starting at*:? $299 per person for an Interior cabin? $339 per person for an Ocean View cabin $369 per person for a Balcony? $469 per person for a Mini-Suite Taxes & port fees totaling $75 per person not included.?   Lower rates of $149-$199 available for the 3rd & 4th occupant. *All prices are subject to change until booked. Book 16 Cabins for YOUR Group, Get the 17th Cabin FREE!  Excludes taxes & gratuities What's Included Your choice of cabin 4 Nights on board the elegant Crown Princess All meals onboard, including 24 hour room service Onboard entertainment, including shows, comedy clubs, discos, bars, etc. Use of pools, hot tubs, fitness facilities, etc.  All Taxes, Fees and Port Charges ? What's Not Included Airfare and transfers to the ship Overnight parking at the Port  Mandatory Gratuities of $11.50 - $12 per person/ per day Soft drinks; bottled water and alcoholic beverages Casino & Gambling Shore Excursions and Sightseeing - Book early! Spa and salon services Items of a personal nature Travel Insurance (recommended)  Specialty Dinning Options Booking and Cruise Policies - All reservations require a completed booking form.? - EARLY SAVER DEPOSITS ARE NON-REFUNDABLE - Passports are NOT required but strongly recommended. If not using passport, an original or certified copy of your birth certificate and government issued ID is required. Click  here  to learn more about Princess Cruise?s policies. - Prices are not guaranteed until the full deposit of payment has been made on your booking and you have received?a confirmation number from your booking agent. ? - All cancellations will be charged a  $25  per person administrative fee, in addition to  any cruise line penalties or fees. -  Name changes - Fee $55 -  All payments are non-refundable and non-transferrable; unless  Vacation Protection  is purchased. - Your reservation is subject to cancellation and/or penalties if payments are not made as specified on your?invoice. - PayPal processing fee applies to all deposits made through Eventbrite. - All payments made after December 7, 2015 will be assessed a $55 late fee charge and run the risk of being cancelled and charged the penalty fees by the cruise line. See  Princess' Penalty fees . Event details can be substituted or modified without notice Contact Mayfield Elite Travel (949) 328-6919 Business Hours: Monday - Friday 9 am to 8 pm Saturday & Sunday 10 am ? 5pm Email: reservations@mayfieldelitetravel.com"
}