{
    "addr": "YOU CHOOSE Los Angeles, CA 90052", 
    "title": "Runner's Best Friend: Toilet Day 5K - Los Angeles", 
    "url": "http://www.eventbrite.com/e/runners-best-friend-toilet-day-5k-los-angeles-registration-17765634491?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-11-14T19:00:00-08:00", 
    "endtime": "2015-11-30T22:00:00-08:00", 
    "categories": [
        "Running", 
        "Race or Endurance Event"
    ], 
    "desc": "WORLD TOILET DAY FINISHER?S MEDAL It?s almost ?WORLD TOILET DAY! You can sign up directly on our website  HERE! If you?ve ever participated in a running event, you know that the longest lines are usually the lines for the Port-a-Potties! Perhaps you?ve been out on a long run or walk, and the site of a toilet is the greatest thing you?ve even seen! ?Many would say that a toilet is a runner?s best friend. November 19th is World Toilet Day. ?Here are some facts to consider: In honor of World Toilet Day, we are hosting a? VIRTUAL 5K ? race. You will get a Runner?s Best Friend Port-a-potty?finisher?s medal! ?We?ve only got 500, so sign up now to get yours! We?ll close registration once the medals are sold out. Along with celebrating RUNNING, ?we will also be donating at least $4 of every registration to? WaterAid.org , ?an amazing organization that provides clean water and toilets that are essential for life. ?For every $50 donated, they are able to provide a toilet for two families. ?Let?s see how many families we can get toilets for!? What:? This is a 5K virtual run (or walk) to celebrate the FRIENDS in our lives. When: ?Complete your race any time during the month of November.? If you can do it on November 19?(the actual World Toilet Day) that would be even better!? *Medals will be shipped out at the? beginning ?of November?2015.? Where: ??You choose the course and you time yourself (you?ll report your finishing time to us). Why :??Because this is our way of honoring World Toilet Day and raising funds to provide toilets for numerous families around the world, through a donation to? WaterAid.org COST:? ?$18, which includes your medal and shipping. ?Plus,? at least?$4 ?of every registration will go to? WaterAid.org . **Check out our sister site, ?Moon Joggers! ? Join their main event,? MEET ME ON MARS ?(one of the paid registration options) now and you?ll be able to save 25% on all of their? virtual races! ?Sign up? HERE . (Use code VIRTUALRUN?to save 15% on? Meet Me on Mars ). You can also sign up for their free option and start logging your miles now."
}