{
    "addr": "Addresses to be given upon registration Los Angeles, CA", 
    "title": "Channel 4 Change Warrior Training™", 
    "url": "http://www.eventbrite.com/e/channel-4-change-warrior-trainingtm-tickets-19158587852?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "CHANNEL 4 CHANGE WARRIOR TRAINING? ?? February 7th, 14th, 21st 2016 Transcend the ordinary to manifest the extraordinary ? Event is non-denominational, open to men and women ages 18 and older Day #1: Sunday, February 7, 2016 (1:00 to 4:00 PM)  Unlocking the Channel 4 Change Warrior Within Founder and host, Mia Adler Ozair, takes you deep into understanding the four pillars of unlocking your greatest potential and how each of us has an inherent responsibility, to ourselves and to the world, to manifest our greatest abilities. The four pillars discussed are mental, physical, spiritual, and global. Mia?s teachings will be followed by an in-depth session with celebrity health and fitness professional Shawn Phillips,an exceptional certified holistic trainer and nutrition expert who will teach you the essential fundamentals of how to care for your body through nutrition and fitness and even facilitate weight loss if that is an issue for you. ?Learn secret advice and key suggestions used with clients, as well as have your personal questions answered to make sure you leave with actions you can implement immediately. This module will ignite your mind, body, and soul to find and unlock that powerful warrior within! Day #2: Sunday, February 14, 2016 (1:00 to 4:00 PM) Channel 4 Change Warrior Self-Defense Self-defense training promotes body awareness, connection between mind and body, as well as creates a solid sense of self-confidence and internal power. In this three hour workshop you will learn from world-renowned self-defense expert IDF Staff Sergeant Sensei Roy? Elghanayan ?from REKM (www.kravmagala.com) how to defend yourself and your loved ones in the event that violence or threat crosses your path.? Your life is of enormous value and it is essential to know basic techniques for how to protect it if the event arises.? Day #3 (optional) Sunday, February 21, 2015 (Range times will vary) Basic Firearms Training at LAX Gun Range Learning how to shoot?how to stand, breathe, aim, and demonstrate respect for this powerful tool?can be life-changing and build a sense of empowerment like nothing else. It requires mental, physical, and spiritual strength and the interaction of all three. In this module you will learn everything necessary about gun safety including loading and unloading a gun, how to point and shoot, and how to aim for your target.? Often times fear is the greatest factor in not wanting to participate. Fear is not an option for a warrior! Even if you are not a gun owner and never plan to be one, you never know what types of situations might arise where you will be the one who needs to know how to operate a hand gun.? The world is a very unpredictable place right now. What if a criminal?s gun gets away from them and lands next to you?? Would you know what to do in order to prevent further harm?? Understanding the basic workings of a firearm is an essential skill that can save your and other?s lives.? Although this is an optional module, we highly recommend it to receive the full impact of Channel 4 Change Warrior Training! FAQs Once on-line registration has been completed our offices will email you all the necessary release forms and event information that you will need to have a smooth and excellent experience. ?Below are answers to other questions you may like to know: Are there ID requirements or an age limit to enter the event? All participants must be 18 years or older and will be required to sign all necessary waivers to ensure a successful and fun experience. ? What can/can't I bring to the event? No recording devices of any kind will be allowed which includes, audio, video, etc. ? Where can I contact the organizer with any questions? You may contact our office at office@miaadlerozair.com. ? Is my registration/ticket transferrable? You may transfer your ticket to a qualifying attendee up to one week prior to the first event date. ? Can I update my registration information? Yes, please contact our office at office@miaadlerozair.com. ? Are my tickets refundable? Tickets, once purchased, are non-refundable as your committment to purchase a ticket removes another person's opportunity to attend. ?Should an emergency arise prior to the event, such as a legitimate medical emergency that can be substantiated by a medical professional, then you will be given a credit towards a future Channel 4 Change Warrior Training event. Copyright 2015 Mia Adler Ozair All Rights Reserved"
}