{
    "addr": "5855 West Century Boulevard Los Angeles, CA 90045", 
    "title": "Camp Congress for Girls Los Angeles 2015", 
    "url": "http://www.eventbrite.com/e/camp-congress-for-girls-los-angeles-2015-tickets-17287876504?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T09:00:00-08:00", 
    "endtime": "2015-12-05T17:00:00-08:00", 
    "categories": [
        "Children \\u0026 Youth ", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Watch the Girls in Politics Initiative? on MSNBC?s Melissa Harris-Perry Show.? ?Camp empowers young girls to run for office?? http://video.msnbc.msn.com/mhp/52698319 Camp Congress for Girls Los Angeles 2015 is a leadership program that introduces girls ages?10 to 15 to politics. Camp begins with a girl-friendly lesson on the structure of our political system. Each girl will choose to run for a seat in the US House of Representatives, the US Senate or for the presidency. She will create her own campaign with a platform, campaign slogan, campaign finance plan, campaign website and a political ad for television. All campers will register to vote and then vote in an election. Once elected to Congress and sworn in, the newly installed members of Congress will learn how to introduce a bill, debate the merits of the bill, lobby fellow legislators, collaborate with the Executive branch and finally vote on the proposed bill. Camp will culminate with a ceremonial signing of the bill by our Ms. President.? Girl Scouts participating in Camp Congress for Girls will earn a Citizen Legacy badge upon completion of the program. All participants will receive a Certificate of Completion for participation. The general camp fee is $160 and the Girl Scout registration fee is $120. The camp fee includes all program materials and lunch. For additional information please email us at info@girlsinpolitics.org, call us at 202-660-1457 ext 2 or visit our website at  www.girlsinpolitics.org .?If registering more than 3 participants please email us?at  info@girlsinpolitics.org ."
}