{
    "addr": "418 Bamboo Lane Los Angeles, CA 90012", 
    "title": "Build Your Own Online Store with Wordpress", 
    "url": "http://www.eventbrite.com/e/build-your-own-online-store-with-wordpress-tickets-19609761324?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T10:00:00-08:00", 
    "endtime": "2015-12-06T17:00:00-08:00", 
    "categories": [
        "High Tech", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Want to build an online store? Create your Online Store in a weekend, Save Time and Money! 10am - 5pm Saturday and Sunday.? Build it with WordPress and take advantage of all the sophisticated plugins and rich development features the platform has to offer. In this step-by-step workshop, I walk you through how to create a professional and customizable eCommerce website with WordPress so you can start your own online store today. This tutorial is comprehensive so that nothing is left out and everyone can easily follow along! Features of this e-commerce website will include: Organizing your online store Installing WordPress Product galleries Product variations Incorporating high quality stock photos Embedding YouTube videos Customizing your theme Shopping carts Payment gateways Contact Forms Adding social networks Security -SSL Testing and optimizing Prereqs & Preparation Please bring your laptop Bring your store/ product idea This course is designed for the student that already understands the fundamentals of WordPress. About the Instructor sharon-folio.com For years, shaRon has been educating clients, colleagues, friends and students about modern web development/ design techniques. As a front end developer she uses  Wordpress, Bootstrap, Drupal,? HTML5, CSS3, JavaScript, Jquery and PHP daily. She has built websites that are supportive of business and marketing goals in a freelance capacity and as part of an agency. shaRon is also available for individual private tutoring, customized corporate training, and consulting."
}