{
    "addr": "11150 W. Olympic Blvd. Suite 1120. Los Angeles, CA 90025", 
    "title": "Intermediate Mandarin Section A - Dec 2015", 
    "url": "http://www.eventbrite.com/e/intermediate-mandarin-section-a-dec-2015-tickets-19666334536?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-06T14:00:00-08:00", 
    "endtime": "2015-12-06T18:00:00-08:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "The Chinese Language Academy of Los Angeles is offering our 21 Hour Intermediate Mandarin Section A course? which will run on  Sundays?commencing Dec 6th?from 2:00-6:00pm and ending on ?February 14th. There will be one month off between 12/20 and 1/17 and we will resume class on 1/24.? The CLA Practical Chinese Program is designed for students who need to learn practical skills in Chinese Mandarin and have a goal to achieve professional proficiency. The students will acquire Chinese Mandarin naturally through efficient instruction, situational practices and dynamic assignments and activities. Students will develop their listening, speaking, reading and writing skills in Mandarin through communicative teaching approach and obtain the capability to use the language in real life and business. This intensive program has four levels: elementary, intermediate, advanced and proficient. Each level will have two sections. In each section, the students are expected to complete 24 hours of in-class study and another about 24 hours of guided self-study. The Intermediate Level of this program will have 12 sessions with each session lasting 4 hours with two short breaks. The 12 sessions are divided into Intermediate Section A and Intermediate Section B.? Tuition cost does not include the textbook fee. ? **Make-up sessions are available upon request. **Referall discount on all of our courses are available. ?Contact us directly for details.. For complete beginners and students who know some Mandarin but have never learned in a formal setting, we suggest that you enroll in our CLA 16 Program For students who have learned some Mandarin in a formal setting, we suggest that you contact us before signing up so we can suggest the appropriate course ? Cancellation Policy for Courses Cancellation requests must be received in writing by email. ?You are responsible for ensuring that CLA receives your written request. ?CLA will reply with a written acknowledgement. After your cancellation request is confirmed in writing by CLA, refunds or credits will be issued based on the time of class cancellation, as follows: ?Cancellation at least 72 hours before first class: 100% refund or credit ?Cancellation within 72 hours before first class: 85% refund or credit ?Cancellation within 24 hours after first class: 75% refund or credit ?Cancellation after 24 hours of first class: No refund or credit A CLA credit is valid for one year from the date of issue If Your Course is Cancelled Although very few courses are cancelled, CLA reserves the right to cancel a course if it has not enrolled enough students before the beginning of the course's instruction. ?In the case of course cancellation, all enrolled students are notified by email and given a full refund of the course fee or credit towards another course. Thank You. Chinese Language Academy of LA Office: ?(424) 281-0125 info@chineseacademyla.com http://www.chineseacademyla.com"
}