{
    "addr": "Los Angeles, CA 90066", 
    "title": "BodyDance Massage - Body-to-Body Sensual & Erotic Massage", 
    "url": "http://www.eventbrite.com/e/bodydance-massage-body-to-body-sensual-erotic-massage-tickets-19466122697?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T18:00:00-08:00", 
    "endtime": "2015-12-05T21:00:00-08:00", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "BodyDance Massage Body-to-Body Sensual & Erotic Massage Intro to BodyDance Masssage Are you ready to increase your intimacy as you glide across your partners body?.massaging with your whole body, dropping into utter bliss and growing the passion between you! It?s time to connect?.relax and breathe in a new you as we set the space for love and sensuality to flow between you! The room will be set with soft music, candle light, a relaxing environment, all you?ll need is your partner and we are ready to go! This sacred massage dance opens the heart to the divine within so you can share it with the beloved or friend before you. As you massage body to body the love within you grows and goes into the other and cycles through as the massage gets more and more intense, sensual and possibly erotic.?if you choose!? This massage combines massage, breath, sound, Contact Improv (no experience necessary), Tantra and deep presence. This work takes you out of your head and into your body and into deep intimacy with your partner. It can be playful, fun, erotic, intense, full of love and light and most of all increases intimacy and sensuality in your relationship. This is a non-sexual massage, though there is sexual energy involved?what you do with this outside the classroom?I will leave that up to your imagination!! But within the confines of the classroom, there will be no sexual activity, though there will be nudity and touching of full chest?this is why it is important for you to come with a partner that you are fully comfortable sharing touch with.? You will be using your whole body in this massage?.this is the place to let go of your inhibitions and shyness, and embrace the lover that you are in your sensual body?and be free! I will be doing and demonstration of the massage, different techniques and then it will be your turn to practice with each other. Choose to have one just receive or switch! When:  Saturday,?December?5th 6-9pm Where:  A Private Home in Mar Vista. (Address will be when class is paid for) Price:  $80 per couple if paid by November 30th/ $90.00 after Nov 30th. This is a pre-paid event!? What to bring:  an open heart, a desire to learn, passion for life?each person needs to bring a thick blanket (this way we have 2 for each couple, a sheet, Coconut Oil, wear bikini bottoms or just skin on skin (which is very nice), a sarong, a bottle of water, trimmed and filed nails, ladies bring a hair clip/band. Come freshly bathed please wearing no scents! **All partners are included?opposite sex, same sex, a friend, lover or married partner. Just bring someone you want to have fun and rub naked on and you are good to go! *No Experience Necessary! For any questions please call me at 424-222-2517.? Bliss, Heather"
}