{
    "addr": "8284 Melrose Avenue Los Angeles, CA 90046", 
    "title": "Singles Mixer - Unlock The Night Party (LA) 12/12", 
    "url": "http://www.eventbrite.com/e/singles-mixer-unlock-the-night-party-la-1212-tickets-19721890706?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-12T19:00:00-08:00", 
    "endtime": "2015-12-12T21:00:00-08:00", 
    "categories": [
        "Food", 
        "Party or Social Gathering"
    ], 
    "desc": "SINGLES MIXER - UNLOCK THE NIGHT PARTY ? Come join us for an Unlock the Night Party in LA? on Saturday, December 12 at? 7:00pm . ? Meet Up To 100 People in One Night! ? ? Who: Ages 40s & Up ? ? ? If you are single and ready to mingle then you need to come out?Saturday night. ? Our party will be held at a unique and sexy lounge! It?s time for you to unlock your soul-mate, while the men have keys and the women wear locks! ? PRICE: $24.00 NO PAY AT THE DOOR! NO PAY AT THE DOOR! ? NO PAY AT THE DOOR! Buy Tickets Today!?? T hese events sell out every time!! ? Unlock the Night Parties are the interactive and   FUN? way to network, meet your match, make new friends?.or just to have a great time!? ? Men get keys, women get locks. As soon as you check in and get your first lock or key, set off to try and find its match.?? Once you find your match, turn in your hardware and get a new piece and start all over. The more matches you make, the more entries into the end of the night raffle you receive. ? Mingle, network, meet someone special, win prizes, stay after and dance. ? The party is from? 7:00 - 9:00 p.m. ?with raffle prizes and giveaways. ? ? ? PRIZES:?WIN A SPA SERVICE from Formosi ?and many other great prizes!! You can stay after for a night of dancing, flirting and mingling. ? Meet some great people and then party the night away! ? ? ? PRICE: $24.00 per person NO PAY AT THE DOOR!  NO PAY AT THE DOOR! NO PAY AT THE DOOR! NO REFUNDS ? Any questions, just contact Cross Town Professionals at: info@ctownpros.com ?or (323) 744-1758. ? Dress Code: ? Upscale - Casual and Trendy ? Parking:   Street parking and there are lots nearby."
}