{
    "addr": "2001 South Barrington Avenue Los Angeles, CA 90025", 
    "title": "UPLIFT Kickback - Support Systems", 
    "url": "http://www.eventbrite.com/e/uplift-kickback-support-systems-tickets-19607792435?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-10T19:30:00-08:00", 
    "endtime": "2015-12-10T21:30:00-08:00", 
    "categories": [
        "Personal health", 
        "Class, Training, or Workshop"
    ], 
    "desc": "SUPPORT SYSTEMS . UPLIFT Women's Group is proud to present their first kickback! Let's be honest, the important things in life often require need a small army to accomplish! We'll be diving into identifying and expressing our needs, breaking down barriers toward receiving support, and leave with an action plan feeling? ?#?uplifted? ?about life!? For this first meeting in conjunction with our theme \"Support\" please bring something that is meaningful to you that makes you feel supported or reminds you of something that makes you feel supported. When:? December 10th from 730 - 930 PM. Where:? YogaRaj,? 2001 S Barrington Ave, Los Angeles, CA 90025.? Energy Exchange:? $20 suggested contribution; $10 minimum. Funds go toward the cost of renting the space, administrative work, and workshop materials. Please pay in advance or at the beginning of the workshop. Nobody turned away for lack of funds. Outline: We hope you can join us! FAQs What are my transport/parking options getting to the event? We encourage everyone to consider eco-friendly options in choosing transportation. Link up with other girls in the Facebook Group for carpooling options! YogaRaj has a parking garage which is to the left of the front door. Please park in the garage, or find street parking.? THE MAIN EVENT IS NOT HELD IN THE STUDIO. It will be held in a separate workshop space on the second floor of the building. To find the studio space, walk to the white fence to the RIGHT/NORTH of the main YogaRaj entrance. Walk up the concrete staircase to the second floor, then turn right to enter a hallway of offices. Take your first left and the workshop space is halfway down on the right.? ?IF YOU GET LOST: call Missy at 650-491-4232 or Elena at 818-523-4666. There will be someone posted at the front helping you to find where you need to go! What can/can't I bring to the event? Please bring a seat cushion if you need, water, food, or any other contribution you want for the group. (Teddy bears are totally valid.)? Please do NOT bring glass or open containers. Where can I contact the organizer with any questions? Please contact iamuplifted@gmail.com with any questions, concerns, or suggestions.? Can I update my registration information? Yes. Please refer to Eventbrite support instructions for how to update registration information.? Do I have to bring my printed ticket to the event? No. Please SIGN IN at the beginning of the event and be sure to state on the sign in form that you have RSVP'd through EventBrite. What is the refund policy? You can use your funds to reserve your spot in the next session. If truly necessary we are happy to give you a refund but invite you to think of it as a \"future investment\" in your community as an incentive to yourself to come next time!? The name on the registration/ticket doesn't match the attendee. Is that okay? Absolutely. Just let us know ahead of time, or day-of, so we can keep track of who truly is attending."
}