{
    "addr": "650 South Grand Ave Los Angeles, CA 90017", 
    "title": "Python Data Science Bootcamp with HACKDAY - Los Angeles, CA", 
    "url": "http://www.eventbrite.com/e/python-data-science-bootcamp-with-hackday-los-angeles-ca-tickets-18477580942?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-12T09:00:00-08:00", 
    "endtime": "2015-12-20T17:00:00-08:00", 
    "categories": [], 
    "desc": "Python Data Science Bootcamp With a HACKDAY ? ? If you have experience in programming or are looking to get started for the first time, this boot camp will put you on the fast track to your python and data analysis skills. In this boot camp you'll get hands-on programming experience in Python that you'll be able to immediately apply in the real world. The boot camp will cover the fundamentals of Python and several tools used in data science.? This boot camp is for analysts, product managers, mathematicians, business managers or anyone else that wants to learn how to code in Python.? ? Prereqs & Preparation You must bring a laptop with a text editor.? Sublime Text is recommended and has a free trial version ( http://www.sublimetext.com/ ).? In addition, students should install Anaconda, which is a free package that includes python and a number of tools that will be used in class ( http://continuum.io/downloads ). This is a very practical and hands-on workshop that has lots of class exercises. You'll build your own library of Python scripts that can be reused after your done with the course This Bootcamp you'll learn the end-to-end data science process: ? ? Recommendations Bootcampers should bring there own lapotop.? Java editor eclipse JDK 7.0 ? Arshad.K? is ?a Data Scientist with 15-plus years of software development experience. His MBA with a concentration in Entrepreneurship and BE (CSE) have opened doors for him at fortune 500 companies like Bank of America for more than a decade. Arshad has multiple certifications in various technology platforms. He has devoted himself to educating, improving and fine-tuning skill sets for superior rapid employment advancement. He is leading sport analytics platform at eSportDNA. Currently working on productive analysis and machine learning in sports.  Alan.L ? Alan. L holds a Bachelors in Mathematics from California State University, Northridge and a Masters in Applied Mathematics from UCLA. He is a Sr Data Scientist at eSportsDNA team. He has over seven years experience in software development and has been building up various businesses last seven years. He has built Serval data engineering projects and currently working at eSportsDNA team for data analysis in machine learning and predictive analysis team. ? ? Refund a week before bootcamp."
}