{
    "addr": "1201 South Figueroa Street Los Angeles, CA 90015", 
    "title": "LA Cookie Con and Sweets Show 2016", 
    "url": "http://www.eventbrite.com/e/la-cookie-con-and-sweets-show-2016-tickets-18540251391?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Food", 
        "Convention"
    ], 
    "desc": "LA Cookie Con and Sweets Show is the West Coast?s biggest baking and sweets convention! * Due to its popularity, we?ve expanded this event to 3x the space and 2 days of sampling, seeing and creating! * ? LA Cookie Con and Sweets Show is a foodie heaven for those who love creating - or simply enjoying - anything and everything in the world of sweets. Your ticket gives you access to: Sample hundreds of delicious sweet creations  from local and national brands alike. Plenty of gluten-free and vegan options, too!  A packed culinary celebrity guest lineup  from the stars of Masterchef, Next Food Network Star, Chopped, The Cooking Channel and YouTube.  Our Saturday headliner  is Chef Ron Ben-Israel, world famous \"King of Cakes\" and star of Food Network's \"Sweet Genius\"!  ? ? Our Sunday headliner  is Rosanna Pansino, the superstar host, creator and star and author of \"Nerdy Nummies\".  Hands-on cookie and cake decorating classes . Expand your skills with fondant, buttercream, sugar flowers, blown sugar, candy apple making, chocolate modeling? Baking demos and classes  from your favorite TV and blog personalities on topics such as Traditional Baking and Vegan Treats. Then, sample everything afterward! YouTube star Sugarcoder will be on hand to teach her kawaii macarons. Our programming partners New School of Cooking and The Gourmandise School of Sweets and Savories will present classes and demos for all to enjoy. More demonstrators and teachers will be announced weekly.  Decorators? Showcase to benefit Children?s Hospital Los Angeles  with local cake, cookie, cake pop and cupcake decorators showing their most intricate creations. ? ? Amazing Fun & Activity Zones for the Whole Family Our  Kids Zone  with toddler and big kid play zones, crafts, snacks, games and activities, plus cookie decorating by Baking With Melissa and face painting by Urban Sitter ? all free. ? Two  VIP Rooms  for our VIP Weekend Pass ticketholders, press, professionals and celebrities. VIPs enjoy early entry to the show both days of the show, free massages by the National Holistic Institute, and an exclusive selection of alcoholic and nonalcoholic sips and bites, plus an exclusive collectible canvas swag bag filled with coupons and samples. ? Programming for Professionals  to help you build your business and learn new sugar art and baking skills. Professionals also receive early entry both days of the show. Five Classrooms and Stages  just for learning more about baking and decorating! ? ***We sold out well in advance of our 2015 show. This event page is for the February 6 and 7, 2016 LA Cookie Con and Sweets Show and we expect to sell out again.*** ? FAQs How will your 2016 show be different than your 2015 show? We were blown away by the amazing response to our 2015 show! In 2016, we're delivering even more exhibitors, more demos and hands-on classes with full audiovisual support, more sugar art to marvel at, and much more shopping for bakers, decorators and foodies. We also have 3x the space, a 2-day schedule, and early entry for VIPs, professionals, and press.? What isn't changing: our incredible lineup of celebrity guests, endless extravaganza of delicious free samples and family-friendly atmosphere! I love baking and decorating. Can I do some quality shopping at the event? You don't want to miss LA Cookie Con and Sweets Show. Our list of retailers grows sweeter every day. Come check out the best in ingredients, tools and decor from sponsors Amoretti, Kake Kreations, BakersBodega, Heilala Vanilla, Divine Specialties, Americana Ingredients and exhibitors from all over the world including Simi Cakes & Confections, All Your Baking Kneads, Fiesta Cake Supplies, Caljava, FondX Rolled Fondant and more. Professional baker or creator? Our sponsors Formosa Flexible Packaging America, Americana Ingredients, Paasche Airbrush Company and Divine Specialties are on hand to help you grow your business, too!? Is my registration/ticket transferrable? Yes, you may transfer your paid ticket to someone else after purchase. Complimentary tickets given to celebrity guests, contest winners, etc. are non-transferrable.? Can I update my registration information? Yes ? please use this link for instructions:  http://help.eventbrite.com/customer/portal/articles/430100-how-to-update-your-ticket-registration-information  ?There is also a 'Contact Us' button at the bottom if you need help!? I bought multiple tickets but I'm giving some away as gifts. Do I need to change the name on all of them? We're only checking IDs for complimentary passes given to press and special guests, so if you buy multiple tickets you can leave your name on each one if you're not sure who you're bringing. However, each ticket can be scanned at registration only once, so make sure you only share the ticket with its rightful owner.? What are the show hours? SATURDAY, FEBRUARY 6 ? VIP/Pro/Press 10 am - 5 pm, General Admission 11 am - 5 pm SUNDAY, FEBRUARY 7 - VIP/Pro/Press 10 am - 4 pm, General Admission 11 am - 4 pm Will you have 1-day VIP Passes available? After our VIP Weekend Passes sell out, we may release 1-day VIP Passes ? but the price will be the same, so the Weekend Passes currently available are the best deal."
}