{
    "addr": "Private  Los Angeles, California 90019", 
    "title": "Christmas Cannabis Cup", 
    "url": "http://www.eventbrite.com/e/christmas-cannabis-cup-tickets-18254558877?aff=ebrowse", 
    "location": "Los Angeles, California", 
    "starttime": "2015-12-19T20:00:00-08:00", 
    "endtime": "2015-12-20T03:00:00-08:00", 
    "categories": [
        "Other", 
        "Concert or Performance"
    ], 
    "desc": "Our Christmas Cannabis Cup honors the best of the industry in our year end event with over 1500 people celebrating and honoring the best in our industry from the trees to IG, who were reading online to our favorite businesses and smoking products. On Saturday we will be letting loose hanging out a top LA Nightclubs for our 1 st  annual cup, special musical guest, DJ?s and live music until 3 am. This year I going to be very special we are expecting to have over 2,000 patients and enthusiast hang out at our holiday kickback with DJ?s at a great spot spot in Los Angeles. This is a chance for your brand to be seen and raise awareness and sales during the Friday Kickback. At our kickback we will be raising funds, toys , food and clothing donations for LA Women?s Shelter and by giving a donation, taking our 420 Games survey and being a patient you will get to sample some of the strains we will be bringing out. For Free Tickets go to? sweetleafevents.com/free ?You will need a 215 Rec to smoke with us and to Judge. Full lineup is announced on December 5th. Its going to an amazing show. We will send the venue information 1 week before the event.? We will be Judging and giving awards for? Best of the Year Concentrate Cannabis Edibles Concentrate of the Year Best Sativa Best Sativa Indica Collective of the Year Best Indica Best Indica Sativa Best Tasting Strain of the Year Best Hybrid Best Hybrid Hybrid Strain of the Year Best Tasting Sativa High CBD High CBD Product of the Year Best Tasting Indica ? ? Best Vaporizer Best Tasting Hybrid ? ? Best Delivery Service ? ? ? ? Best Social Media Best Personality Favorite Online and Print Favorite Instagram Chef of the Year Favorite Business Site Favorite Youtube Song of the Year ?Organizer of the Year Favorite Snapchat Best Nug Porn Feed Favorite Facebook Page Best App to Find Weed Writer of the Year Favorite Community Site Favorite Clothing Line Comedian of the Year Favorite MMJ News Site Favorite Radio Show ? ? App of the Year ? Android ? ? App of the Year ? iOS ? ? ? Favorite Vaporizer Favorite Papers Favorite Disposable Favorite Blunt/Wrap Favorite Glass Favortie Storage Containers Favorite Enail Favortie Grinders Fav Rigs Fave Ceramic Fav TI Nail Fav Travler"
}