{
    "addr": "East 6th Street Los Angeles, CA 90013", 
    "title": "THE ART OF FEMALE DOMINATION: SLAVE TRAINING", 
    "url": "http://www.eventbrite.com/e/the-art-of-female-domination-slave-training-tickets-19612858588?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-20T18:00:00-08:00", 
    "endtime": "2015-12-20T20:00:00-08:00", 
    "categories": [
        "Adult", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Are you 50 Shades of Grey curious? Then do not come to this class. If, however, you are a Woman who is curious about how You can harness Your power as a Woman to have more control in Your career, over men and in your life through the erotic art of Female Domination, then this class is for you. Whether you are looking to spice up your sex life, be more in-control professionally, thinking about becoming a Dominatrix, or are a service p rovider looking to expand your bag of tricks, you will get the psychology and tools you need to get started. The 14th class in this series is slave & obedience training In this class you will learn: 1. How to exert Your ownership of a man (or woman, ladies!) 2. The Four Phases of Your dungeon; How to create erotic suspence using your voice, touch and environment 3. Slave positioning: Gain ultimate control of Your subject with these 10 positions a.?kneel down b.?kneel up c. present wrists d.?all fours e.?present ass f.?present ass for caning g.?present ass for reminder h.?stand at attention i.?present to be collared j.?thumb and finger k. and, as a special bonus, we will cover positions for proper foot service. ? 4. Corporal Punishment as a method of teaching and behavior modification And, as a bonus, men will learn:  Where to meet Dommes, how to tell if They are safe to play with,? How to greet a Mistress in public and private settings,? proper eye positioning,? Greeting the foot, p roper dialogue and titles, ?The 10 positions of a slave and why they are good for you: Instructor: Tara Indiana? ? This class is open to men, women and couples!!!? $20 in advance/ $30 at the door single Women (space permitting) $30 in advance/ $40 at the door single men (space permitting) For address call Den of Iniquity at 213 623 1520"
}