{
    "addr": "4350 Wilshire Boulevard Los Angeles, CA 90005", 
    "title": "LA Lawyers Phil & Legal Voices: Holiday Concert", 
    "url": "http://www.eventbrite.com/e/la-lawyers-phil-legal-voices-holiday-concert-tickets-19091503200?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-12T19:00:00-08:00", 
    "endtime": "2015-12-12T21:20:00-08:00", 
    "categories": [
        "Music", 
        "Concert or Performance"
    ], 
    "desc": "HOLIDAY CONCERT From Beethoven's 5th to Bernstein's West Side Story...? Lawyers and judges will entertain you in ?this delightful ?Holiday Concert. Join?Maestro Gary S. Greene as he leads the LA Lawyers Philharmonic and its chorus, Legal Voices,?in a lovely evening of music. Highlights include Beethoven's  Fifth Symphony  (4th movement), a medley of Bernstein's  West Side Story , Lauridsen's  Lux Aeterna  (4th & 5th movements) and Christmas and Hannukah favorites. Tony Award winner and attorney Michael Maguire will awe the audience as a featured soloist in  The Impossible Dream , and he will also sing  Luck Be A Lady  as a tribute to Frank Sinatra's 100th Birthday.?Principal cellist and retired attorney David Waller will mesmerize the crowd in an inspiring rendition of Faure's  Elegie . ?Pianist/lawyer Darren Blumfield will debut with the orchestra in a beautiful performance of Rachmaninoff's  Piano Concerto no. 3? (1st movement). Legal Voices' tenor and attorney Randall Garrou will sing the memorable aria  Nessun Dorma  from  Turnadot  by Puccini. Choral Director Jim Raycroft will lead Legal Voices, and actress June Lockhart will MC.? This concert is perfect for the entire family. ? ABOUT THE CONDUCTOR Gary S. Greene, Esq., an attorney for more than 38 years, is a violinist and conductor for more than 40 years. ?He earned his BA  summa cum laude  from UCLA in 1971 and was awarded membership in Phi Beta Kappa. He received his JD from Loyola Law School in 1975. Greene is also the conductor of the Jr. Philharmonic, the acclaimed young people's symphony orchestra founded in 1937 by his late uncle, Dr. Ernst Katz. Maestro Greene was named the 2010 Person of the Year by the  Metropolitan News-Enterprise  for not only entertaining the legal community but also for having done much to unify it. He was recognized as \"A Man with a Briefcase and a Baton -- the Only Lawyer From Whom Judges Take Direction.\" In 2012, Greene was presented with the prestigious Board of Governors Award from the Beverly Hills Bar Association. THANK YOU TO OUR SPONSORS: Girardi | Keese Lawyers ? --? ? http://www.girardikeese.com Oldman, Cooley, Sallus, Birnberg & Coleman, LLP --? http://www.oldmancooley.com"
}