{
    "addr": "612 S Flower St Los Angeles, CA 90017", 
    "title": "SoCal Biotech Referral Group", 
    "url": "http://www.eventbrite.com/e/socal-biotech-referral-group-tickets-16666538064?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-02T07:00:00-08:00", 
    "endtime": "2015-12-02T08:00:00-08:00", 
    "categories": [
        "Sales \\u0026 Marketing", 
        "Meeting or Networking Event"
    ], 
    "desc": "We are a newly-formed (April 2015) group of professionals that serve? SoCal Biotech, Pharmaceutical and Medical Device firms employing fewer than 500 employees. We meet regularly to share intelligence about our shared customer base and to make introductions and referrals for each other. 7:00am-8:00am ?-- Arrivals, Networking, Order food/coffee, Meeting Members commit to regular attendance, holding a leadership post, and annual dues. We are an independent group not affiliated with any other networking or referral organizations.? Visitors are welcome to attend only twice, after which they may apply for membership to join the group. Filled Professions* Architect -Brian Spence,  BAM Architecture Studio HR Services & Employee Benefits -Steve Pershing,  TriNet Life Science Laboratory Equipment -Margaret Stava,  Lab Equipment Company Legal/Business Attorney/Patent Lawyer - Matthew Bresnahan,  WSRG Quality Assurance - Diane Kulisek,  CAPAtrak Staffing and Recruiting ?-Paul Dionne,  MEIRxRS Open Professions (Suggestions) Business Banker Commercial Cleaning Services Commercial Realtor/Broker  Construction Contractor -General Construction Engineer/Management CPA/External Financial Auditors Executive Coach Financial Management Interior Designer IT Services  Insurance Laboratory Planning & Engineering Laboratory Supplies Marketing Mechanical, Electrical, Plumbing Engineer Operations Management Consultant Printing Project Manager - Construction Structural Engineer Translation Venture Capital/Investment Fund? Others ____________ * We only allow one member from each profession so that we do not compete with each other. ?Visitors from filled professions may visit twice but will not be eligible to join."
}