{
    "addr": "3580 Wilshire Blvd Suite 1705 C. Metered Parking across Kingsley. Free after 6 pm.. Los Angeles 90010", 
    "title": "Wednesday CPR/AED/BLS", 
    "url": "http://www.eventbrite.com/e/wednesday-cpraedbls-tickets-14812774407?aff=ebrowse", 
    "location": "Los Angeles, United States", 
    "starttime": "2015-12-02T16:00:00-08:00", 
    "endtime": "2015-12-02T20:00:00-08:00", 
    "categories": [
        "Classes", 
        "Conventions", 
        "Class, Training, or Workshop"
    ], 
    "desc": "ALL ? our?discount  codes?are on Facebook so visit our page ! ? ?   http://www.facebook.com/educatesimplify ? ? Yelp!  us ? by writing a review  ? ?after taking the class  & Earn a $5 Starbucks gift card !! ? ? ? ? http://www.yelp.com/biz/creativeresol-ve-educational-company-los-angeles ? ? ? ? ? Class starts @ 4:00 p.m. ? Registration begins @ 3:45 p.m. ? * Skills Test begins @ 6:00 p.m. ? * (Please provide the Certification for the Online Portion) ? Which CPR/First Aid Class?You need? ? American Heart Association   ? Basic Life Support for Healthcare providers If you need to be certified for CPR to do patient care in  hospital or facility-based setting, or?? if you are a licensed healthcare provider - this certification is mandatory.  ? ? Basic Life Support (BLS) Healthcare Provider   Course designed for the rescuer who has a duty to respond or anyone with the desire for advanced ?CPR knowledge. Course content includes: recognizing and caring for breathing and cardiac ?emergencies in a Adult, Child, and Infant, Two-Rescuer CPR, Airway Obstruction, use of an AED, ?use of Resuscitation Mask and Bag Mask.  ? Upon successful completion, Health Care Provider ?participants will receive an American Heart Association Basic Life Support (BLS) Healthcare ?Provider certificate valid for 2?years. ? ? ? HeartSaver CPR & HeartSaver AED?  The Heartsaver CPR, HeartSaver AED and First Aid courses?are specially designed to train anyone who might be the first to respond in the workplace or community, and can be tailored to address the needs of a specific workplace or group of employees. These courses also provide the skills to effectively assess and maintain life from the critical minutes immediately following an emergency until the arrival of emergency medical services personnel.  Ideal for non-medical professionals such as teachers, personal or fitness trainers, coaches,?and those who work closely with children [day care employees, etc]. Each Certification is Valid for 2 years ? HeartSaver FirstAid  ? Topics covered include First Aid Basics, Medical Emergencies, Injury Emergencies,  ? ? ?????????????????????????????????????????????????????????? ? Step 1 ?Costs fo Online Portion?listed above ?(paid directly to American Heart Association via web site),  ?Click on the link below:  ?http://www.onlinetrainingplace.com/   Step 2   Complete the online training, Register above. We will provide the skills review and issue you? the American Heart BLS/CPR certification card the same day! ? Use of American Heart Association materials in an educational course does not represent course sponsorship by the American Heart Association. Any fees charged for such a course, except for a portion of fees needed for AHA course materials, do not represent income to the Association ? Contact Us: ? ???????????????????????????????????????  ????????????????????????????? 1.888.327.0003 ? ? ??????????????????????????????213.300.5045???? local ? ? ?Our Class Coordinator,  Taezsa S., ?is standing by ?to answer any questions ? ? Visit our website: ? http://www.educatesimplify.com/"
}