{
    "addr": "932 Chung King Road Los Angeles, CA 90012", 
    "title": "Open Sessions: December", 
    "url": "http://www.eventbrite.com/e/open-sessions-december-tickets-19548529177?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-02T17:30:00-08:00", 
    "endtime": "2015-12-02T20:30:00-08:00", 
    "categories": [
        "Craft", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Come experiment with making perfume at The Institute for Art and Olfaction?s weekly drop-in public open sessions. Due to limited space, we operate on a strict reservation basis. You MUST reserve your spot in advance!  -- ABOUT In our informal weekly open sessions, you will learn, socialize and relax while you tinker with perfumery materials. We have a growing selection of natural and synthetic aromamolecules, perfumer?s alcohol, beakers and droppers, scent strips and bottles? Everything you?d need to start or develop your experiments with perfumery. Please note that this is a  knowledge-share environment, not a formal class . What you learn, you will learn by experimentation and our light guidance. If you are interested in formal classes, please visit  our calendar  to see what we have coming up. Please review  our refund policy  before signing up for a session! -- COSTS  Intro Session:  $40.00 This includes the use of our labware, glassware, pipettes, scent strips, and your choice of five 1 dram vials of aromamolecules to work with. You can buy extra materials on site, at the prices below. Returning Students: $8.50 + A la carte  Returning students simply pay a lab fee, and any materials they use. You can purchase as many ? or as few ? as you desire, and of course can also bring materials from home. Materials (beyond what is included in the intro session fee) are available for purchase on site. 1 dram vial:  $5.00  2 dram vial:  $8.00 We accept cash, paypal or credit cards. If paying by cash, bring small bills. Please note that whether or not you have attended before,  you must reserve your space in advance . If you just show up without reserving a spot, there is no guarantee we will be able to accommodate you. All levels are welcome, but our open sessions are 18 and up (or 14+, with adult supervision). -- HOURS + LOCATION 5:30 pm-8:30 pm, Wednesdays  We hold these sessions at the IAO headquarters in Chinatown. Visit our  directions page   for access information + parking . ? MORE INFORMATION Our open sessions are fulfilling our mission to create public access to materials and learning around perfumery. We invite the public to come in and experiment with scent in these lightly guided open sessions in our functional perfumery laboratory. For first-timers:  Upon first arrival, there is a 10 minute lab orientation and safety session. You will be provided a confirmation of receipt paper, which we will ask you to sign, as well as a release of liability form. We will be keeping these on file, so you do not have to take the orientation session more than once. Once that?s done, we invite you to spend some time smelling what we have in our student organ. When you?ve decided which scents you?d like to work with, we?ll make your vials and set you up at a work station with your materials. You can take the vials home, of course, as well as anything you make during your session."
}