{
    "addr": "12312 W Olympic Blvd Los Angeles, CA 90064", 
    "title": "2015 LCS ALL STARS: OUTDOOR Day 1", 
    "url": "http://www.eventbrite.com/e/2015-lcs-all-stars-outdoor-day-1-tickets-19580865897?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-10T17:00:00-08:00", 
    "endtime": "2015-12-10T22:00:00-08:00", 
    "categories": [
        "Gaming", 
        "Game or Competition"
    ], 
    "desc": "Watch the worlds battle in a revamped LCS arena at the 2015 All-Star Event.? ? Go to  http://lolesports.com  for more info including voting, schedule, game modes, etc. ? Doors open an hour before the first scheduled game start. ? If you have questions or concerns related to tickets or ticket sales, please call Lisa Neshanian at +1 (310) 925-2440, or Mack Sanders at +1 (614) 625-1050 Tickets FAQ ? Q: Do I have to bring Photo ID? A: No, unless you do not have a copy of your ticket Q: Is there an age requirement? A: Children under the age of 10 are required to be accompanied by an adult. Q: When should I arrive? What if I am late? A: Check-in is two hours before show starts. Audience load in one hour before show starts. No worries if you are late there will always be someone available to check you in.? Q: How is seating arranged? A: There is bleacher seating inside and outside on a first come, first serve basis. Q: Is there food for sale? Can I bring my own? A: There is a concession stand in the studio that has various food items for sale, and t here will also be food trucks on site. ?We do allow outside food and drinks.? Q: Is there merchandise for sale? A: Yes, there is a merchandise store in the NA studio. It opens after the beginning of the first match and closes before the end of the last match.? Q: Is there parking? A:? (Thursday-Friday) Details will be updated shortly..  (Saturday-Sunday)? P arking is available in the parking structure located at 12200 West Olympic Boulevard. Enter the parking structure on Olympic Boulevard between Bundy and Centinela (next to 12312 Olympic Blvd) and park in any available space on the P1 and P2 levels. ?Parking is not permitted in reserved spaces at any time and vehicles are subject to removal at the owner?s expense. Parking in a tandem space will require that you leave your key with the valet attendant. Once you have parked your vehicle please proceed to the elevator at the 12200 West Olympic Building and get off on the 1 st ?floor (main lobby), exit the lobby doors facing Olympic Boulevard, make an immediate left and proceed to the adjacent 12312 building. A parking validation will be provided to you by the Riot Games staff. Q: Is there a place to drop off? A: Yes, drop offs will be on Olympic Blvd (at the curb) outside of 12312 W. Olypic Blvd."
}