{
    "addr": "301 West 1st Street Los Angeles, CA 90012", 
    "title": "MCLE: Animal Law Seminar: Upholding California’s Farm Animal Protections", 
    "url": "http://www.eventbrite.com/e/mcle-animal-law-seminar-upholding-californias-farm-animal-protections-tickets-19430184204?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-02T12:15:00-08:00", 
    "endtime": "2015-12-02T13:15:00-08:00", 
    "categories": [
        "Non Profit \\u0026 NGOs", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Class covers: Earn 1 hour general?MCLE credit Presented by Lindsay Larris and Kelsey Eberly: Lindsay Larris ?directs ALDF operations and resources in Southern California. Prior to working at ALDF, Lindsay spent seven years practicing civil litigation in the Los Angeles area, including environmental and trust and estate litigation, and international arbitration. While in private practice at Gibson, Dunn & Crutcher, LLP, Lindsay also litigated animal rights matters on a pro bono basis. She graduated from University of Pennsylvania Law School in 2007, where she co-founded the Journal of Animal Law and Ethics.? Kelsey Eberly ?is a litigation fellow at ALDF, where she assists with cases and projects involving advocacy for animals. She graduated from UCLA Law School in 2014, where she focused on animal, environmental, and administrative law. While attending law school, Kelsey was the chair of the UCLA Animal Law Society. She also holds a graduate certificate in Animal Policy and Advocacy from Humane Society University, and received her bachelor?s degree magna cum laude from Middlebury College. Registration fees: ?$45 for this class including vegan lunch Non-refundable, payment reserves spot. A portion of registration proceeds go to The Animal Legal Defense Fund No legal advice: LA Law Library does not provide legal advice. LA Law Library provides legal resources and assistance with legal research as an educational service. The Law Library is pleased to offer our patrons the opportunity to obtain assistance from third party legal service providers at this and other events within the Library. However, the Library does not control and is not responsible for the content or scope of any assistance given by those providers. ? To register please visit  www.lalawlibrary.org/CLASSES  or call 213.785.2516 - parking options available at registration."
}