{
    "addr": "7456 Melrose Ave Los Angeles, CA 90046", 
    "title": "Stanislavski/Meisner Acting Class for Camera - Coached by Actor/Filmmaker BoJesse Christopher (preparation & moment)", 
    "url": "http://www.eventbrite.com/e/stanislavskimeisner-acting-class-for-camera-coached-by-actorfilmmaker-bojesse-christopher-tickets-18672907168?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-01T19:00:00-08:00", 
    "endtime": "2015-12-01T23:00:00-08:00", 
    "categories": [
        "Film", 
        "Class, Training, or Workshop"
    ], 
    "desc": "http://truthbetoldactingcollectivecoachedbybojessechristopher.eventbrite.com/ Emotional instrument  (re: feelings); Don't wait for a cue..pick up on the impulse.? Find it, express it, suppress it.? Don't let it hit the top.? Stay underneath it.? Be brave, surrender to the truth...join us!  Inquiries:?  BoJesse@BoJesse.com 'Truth Be Told'   A Stanislavski/Meisner Acting Collectived Coached by Actor/Filmmaker   BoJesse Christopher? www.BoJesse.com http://www.imdb.me/bojessechristopher https://vimeo.com/bojessechristopher/5minactingreeloct2015 ? Every Tuesday Evening   7-11pm  @ The Zephyr Theatre   7456 Melrose Ave. Hollywood, CA 90046 www.zephyrtheatre.com  Actors get in shape! Prepare, achieve emotionally connected, grounded, honest work on camera & win jobs!'     Creative Therapy Acting Studio LA - 2016 (Proud New Home of 'Truth Be Told' Acting Collective) ? Follow, like, share, thank you:   https://vimeo.com/truthbetoldactingclass https://www.facebook.com/truthbetold.actingcollective https://twitter.com/tbtacting   www.tbtactingclass.yelp.com   www.vimeo.com/truthbetoldactingclass   www.youtube.com/truthbetoldactingclass   www.instagram.com/truthbetoldactingclass   www.facebook.com/truthbetoldactingcollective ?  \"The actor should not imitate or impersonate, but become the part by working on the link between the role and the reality of your own life and emotions. In short, free your imagination and develop complete self awareness both physically and mentally.\" -  Konstantin Stanislavski  -  \"The more an actor can take in about the partner and the surroundings while performing in character, the more they can 'leave themselves alone' and 'live truthfully'.\" -  Sanford Meisner  -     TECHNIQUE  Emphasis on the following combination of techniques:  * Making strong smart choices in the world of the play in your scene work preparation leading up to the moment.  * Getting familiar with, understanding, emotionally connecting to, and memorization of the material.  * Identifying who your are, what you want, how you feel about the other person, visualization of any third party characters, and strong point of view.  * Observation of other persons behavior and feelings, being aware of how it effects the impulse of your feelings, adjusts your point of view, and achieving moment to moment truth, both in and out of the world of the play.     PARTICIPATE, WORKSHOP, OBSERVE, SUPPORT  * Emerging & notable actors welcome.  * Special guests actors, casting directors, writers, directors, producers, agents, managers, etc.     PRIVATES, PRE-TAPES, SET COACHING, ETC.  * Privates are available upon request and availability.  * Privates include one on one, for one hour; repetition exercise, scene work with repetition exercises to maximize the most emotionally connected and truthful result.  * Pre-tape coaching.  * Dialect coaching.  * Camera technique & philosophy.  * Set coaching.  * Emotional consulting.? Getting to know your emotional self, so you can bring forward organic feelings into the work of your creative outlet.  * Q & A.? Open format. ? COST: PACKAGE A) ?  8 CONSECUTIVE CLASSES | NO CREDITS | @ $50 EACH = $400 TOTAL    PACKAGE B)  4 CONSECUTIVE CLASSES | NO CREDITS | @ $65 EACH = $260 TOTAL    ALA CARTE)  1 CLASS AT A TIME | $80 | BASED ON AVAILABILITY OBSERVE CLASS | 1 TIME | $15 ? MEMBERSHIP | 6 MONTHS | ROUGHLY 24 CLASSES | @ $25 EACH = $600 TOTAL     LIMITED SPACE | ONLY 30 ACTORS PER CLASS | PLEASE RESERVE YOUR SPOT NOW    Questions? Let us know what's on your mind. ? Actors,  Check out our IMDB page for the upcoming documentary drama series:    'Truth Be Told' A Stanislavski/Meisner Acting Collective   https://pro-labs.imdb.com/title/tt4360460/   http://www.imdb.com/title/tt4360460/combined    Note:? We will be casting 10 select emerging & notable actors for series regulars in August.? The show shoots for 6 weeks in Sept/Oct, 2015.    Info Lines:? 310.985.0465 |  BoJesse@BoJesse.com ? http://truthbetoldactingcollectivecoachedbybojessechristopher.eventbrite.com/ Please also look for my master acting class for camera at Relativity School: http://relativityschool.org/ ? BoJesse Christopher | Mini-Bio | Actor-Filmmaker-Coach American actor BoJesse Christopher was born and raised in San Francisco, Ca, and is best known for his portrayal of Grommet/LBJ, the reckless younger brother of Patrick Swayze in the 20th Century Fox classic original feature film Point Break, directed by academy award winner Kathryn Bigelow (The Hurt Locker, Zero Dark Thirty), released 1991. BoJesse also costars as the FBI Director Chapman in the $100 million dollar re imagined Point Break, directed by  Ericson Core, distributed by Warner Bros., opening Christmas Day 2015. BoJesse also costars opposite J.K. Simmons & Emile Hersh in the dark comedy The Runaround, premiering at The Sundance Film Festival January, 2016. Thus far, BoJesse has starred, co-starred, reoccurred, guest starred, appeared in, and/or written, produced and  directed, a variety of over 47 film and television projects over the years, opposite a wide range of notable talent. Early days, BoJesse personally trained with legendary acting coach Stella Adler at prestigious Stella Adler  Conservatory Theatre, while mentored and privately coached by two-time academy award winner Shelley Winters at The Actors Studio West, and is a lifetime member. Over time, BoJesse trained with acclaimed acting coach Sandy Marshall, immersing himself into the Sanford Meisner repetition technique. In recent years, BoJesse developed, organized, and directs the Truth Be Told Stanislavski/Meisner acting collective, where he continues to share and grow as an actor-filmmaker-coach.?  In addition, BoJesse coaches an impressive roster of notable and emerging actors, privately and on set. More recently, BoJesse has lectured at both the Masters Acting class for Camera and Scene Study class at  Relativity School, an integrated film school program in collaboration with Relativity Media/Studios, as well as the  Acting for Camera class at the prestigious New York Film Academy in Los Angeles, CA. For booking please contact: 310.985.0465  BoJesse@BoJesse.com https://vimeo.com/bojessechristopher/5minactingreeloct2015 https://vimeo.com/bojessechristopher/actingreeloct2015extended https://vimeo.com/bojessechristopher/bojessedirectorsreel http://www.imdb.me/bojessechristopher http://www.eventbrite.com/o/actorfilmmaker-bojesse-christopher-7508785123 m"
}