{
    "addr": "7456 Melrose Avenue Los Angeles, CA 90036", 
    "title": "Actors Studio Group Theater for the Professional", 
    "url": "http://www.eventbrite.com/e/actors-studio-group-theater-for-the-professional-tickets-18317957504?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-03T15:00:00-08:00", 
    "endtime": "2015-12-03T17:00:00-08:00", 
    "categories": [
        "Film", 
        "Class, Training, or Workshop"
    ], 
    "desc": "TRAINING FOR THE PROFESSIONAL ACTOR ? Class based on Actors Studio Intense scene study, acting techniques: Stanislavski, Lee Strasberg.? William Burns is a life time member of the Actors Studio.  ? William has been a Life member of the Actors Studio over 25 years, and studied privately with Lee Strasberg for 10 years. Stared in 14 Feature Films, Dozens of Television Shows, and 7 Broadway Plays, along with numerous Off Broadway and Regional Theatre Productions. William was on staff at Princeton University for 2 years and set up Princeton University ACTORS STUDIO as well as directing and starring in THE THREE SISTERS. He had a 7 year contract with Universal Studios and was the principle in over 200 National Network Commercials. His work as ?Kilroy? in Tennessee Williams play ?Camino Real,? was filmed and placed in the National Archives, Lincoln Centre, NYC. ? ?I bring a life time of excellence to my work. Each talent is a unique essence unto itself-and also the most important, single, irreducible creative element in any production. Also unique (almost without exception) each talent observed will be found to have their own personal ?working problems? as a creative artist. Small or large, the working problem can effectively sabotage any actor?s creative abilities, and hence, their career. I will correctly and accurately identify the working problem of any actor-and provide expertise and a workable route by which it can be overcome through understanding and improved artistic ability.?  ? Directors William has worked with: Francis Ford Coppola, Lamont Johnson, Mel Brooks, Joshua Logan, Albert Marr, Lee Strasberg, Vivian Matalon, Hector Olivera (Argentina), Robert Weaver, Thomas Job (Germany), Andy Monahan (England). Sergei Bordov, three time Academy Award Nominated Director for MONGOL. Martha Fiennes, Director of the Russian Classic ONEGIN. ? ?In addition to the newly formed ACTORS STUDIO GROUP THEATER William has a feature film company, partnered with his wife Elena Bleskina Burns. ?Willow Tree Entertainment LLC ?has six (6) feature films in its slate, which William wrote, they are: A HERO OF OUR TIME - SUMMERTIME ON GULL LAKE - CHIEM - JOHANNES - BOUDICA and MATA HARI?  ? Interviews and Auditions are required for membership into the Actors Studio Group Theater. ? 310 358-0568 / Cell: 310 795-5227?  ? WE@wtefilms.com  /  www.wtefilms.com"
}