{
    "addr": "1243A Perloff Hall  Los Angeles, CA 90095", 
    "title": "UCLA English as a Second Language Placement Exam (ESLPE)", 
    "url": "http://www.eventbrite.com/e/ucla-english-as-a-second-language-placement-exam-eslpe-registration-19602243839?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-04T09:00:00-08:00", 
    "endtime": "2015-12-04T11:00:00-08:00", 
    "categories": [
        "Other", 
        "Other"
    ], 
    "desc": "ESLPE registration for our December 4, 2015 exam sessions is now open. Please register here and refer to this page for all necessary information about the exam.? FAQs Who needs to take the ESLPE?  Graduate students and undergraduate students transferring to UCLA. Below is detailed information for both groups.? Graduate students:  Students whose native language is not English are required to take the UCLA English as a Second Language Placement Examination (ESLPE), in addition to the TOEFL or IELTS examination, before or during the term in which they are to register. Failure to sit for the ESLPE results in a hold on student records. Students may take the ESLPE once only. Depending on the ESLPE results, students may be required to complete one or more courses in the English as a Second Language (ESL) credit-bearing series, beginning in their first term in residence at UCLA. If students do not achieve a minimum score on the ESLPE, their admission is deferred until they have acquired the necessary proficiency in English.  Neither the TOEFL, nor IELTS, nor any other English proficiency test can be submitted or accepted in lieu of the ESLPE. ( new policy as of 9/22/15:? The Graduate Council has revised the English as a Second Language Placement Exam (ESLPE) policy for graduate students.  Effective Fall 2015, incoming students who scored at least 100 on the TOEFL iBT (internet based test) or at least a 7.5 overall band score on the IELTS exam will no longer be required to take this placement exam.) ? ? International students who hold a bachelor?s or higher degree from a university located in the U.S. or in another country in which English is both the primary spoken language of daily life (e.g., Australia, Barbados, Canada, Ireland, Jamaica, New Zealand, United Kingdom) and the medium of instruction, or who have completed at least two years of full-time study at such an institution, are exempt from the Test of English as a Foreign Language (TOEFL) or the International English Language Testing System (IELTS) examination and the UCLA English as a Second Language Placement Examination (ESLPE).? (For further details, please refer to the UCLA catalog: http://catalog.registrar.ucla.edu/uclacatalog2015-16-6m.htm )  Transfer students: ?UCLA undergraduate transfer students whose native language is not English and who have not otherwise satisfied the English as a Second Language (ESL) requirement or who are directed to do so by UCLA Undergraduate Admissions are required to take the English as a Second Language Placement Examination (ESLPE). Neither the Test of English as a Foreign Language (TOEFL) nor any other English proficiency test can be submitted or accepted in lieu of the AWPE or ESLPE. Students may take the AWPE or ESLPE once only. Unauthorized retakes of the examinations result in an invalid examination score. (For further details, please refer to the UCLA catalog: http://catalog.registrar.ucla.edu/uclacatalog2015-16-6f.htm )  Do I have to bring my printed ticket to the event? Yes. What else should I bring?  Please bring your Bruincard, a pencil or pen, and your printed ticket from this registration. Can I retake the test if I don't do well?? No. Please come prepared to do your best work. What does the exam contain?  The exam consists of a 60 minute essay, in which you will respond to a very short reading passage and essay prompt. It's a pen and paper test.? How should I prepare?  Reading in English is always a great way to internalize the structure of the language and help you remember vocabulary to use in writing. I've already passed the TOP. Do I need to take this test, too?  Yes. The Test of Oral Proficiency allows graduate students to qualify to become Teaching Assistants. This exam assesses your command of written academic English. How will I get my results?  You will receive an email 1-2 weeks after the test. In the email, we will tell you your course requirements or that you have passed and fulfilled your language requirement. On the test date, we will tell you about future counseling times, when you may come and talk to the ESLPE coordinator about your required courses. I submitted my TOEFL and GRE scores already, can I be exempt from taking this test?  No. TOEFL and other standardized test scores are used for UCLA admissions. The ESLPE serves as a placement test to fulfill your language requirement. A more complete explanation of Graduate Division's English requirement can be found here: https://grad.ucla.edu/admissions/english-requirements/ I'd like to take the test on October 16, not September 23. Where do I register?  Please check back at this same link in early October. We are currently finalizing the test location."
}