{
    "addr": "11677 San Vicente Blvd  Los Angeles, CA 90049", 
    "title": "Free Dance Fitness! MOORE Dancing + The Track&Field Store", 
    "url": "http://www.eventbrite.com/e/free-dance-fitness-moore-dancing-the-trackfield-store-tickets-19479614050?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T09:00:00-08:00", 
    "endtime": "2015-12-05T10:00:00-08:00", 
    "categories": [
        "Exercise", 
        "Class, Training, or Workshop"
    ], 
    "desc": "As  The Track&Field Store's? selected \"Studio of the Month,\"  MOORE?Dancing ?is?bringing you FREE classes each?Saturday?of?December at the Brentwood Gardens courtyard. Grab your friends and join our studio's top instructors for heart pumping choreography and strength-training moves. Burn calories to the beat?and flood your body with dancer's endorphins as you?enjoy a workout full of good vibes and positive energy brought to you by? MOORE ! MOORE Dancing   is LA's?Premiere Cardio Dance Studio! We?believe in having fun and getting?fit by offering dynamic, diverse classes to match all dance and fitness levels.  Don't miss the fun!  ? Lineup: Classes held Saturday's 9am-10am Open to all dance & fitness levels, no prior experience needed ? December 5th -?ZUMBA  w/ Raul Arauz December 12th -?ZUMBA  w/ Melissa Zugell December 19th - U- Jam w/?Jerod Williams? December 26th  - CoreJam  w/ Diana Hex? ? Dance. Sweat. Shop. Repeat! Stick around on the 26th and fuel up with some healthy snacks and refreshments from our community partners, special offers, Plus raffle surprises! *Earn one extra ticket every class you attend for a? grand prize raffle?December 26th *Winner must be present ? Please arrive 5 minutes before class to complete new student registration ? Parking: Two hour parking is available for $2.00 with validation for The Track&Field store customers in the Brentwood Garden's parking structure. Street parking is also close by within the surrounding residential neighborhood. ?  More  Fun.  More  Fitness.? MOORE ?Dancing! The Track&Field Store's  clothing?is inspired by?our passion for fitness and Brazilian lifestyle, we create high-end fitness sports performance and beach apparel infused with innovative technologies that help you perform better.?Our clothing features bold patterns, chic prints and hand-made fabrics with a fresh, Brazilian twist that make you want to sweat more!? ?? ?  ?  Please visit The?Track&Field Brentwood store at 11677 San Vicente Blvd, LA, CA-90049 to check out the latest collections.  www.tfstore.com"
}