{
    "addr": "11943 Montana Ave Los Angeles, CA 90049", 
    "title": "Beginning Salsa with Javier Campines", 
    "url": "http://www.eventbrite.com/e/beginning-salsa-with-javier-campines-tickets-18217660513?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-04T19:00:00-08:00", 
    "endtime": "2015-12-04T20:00:00-08:00", 
    "categories": [
        "Dance", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Check out beginning Salsa class with world class teacher, Javier Campines. ?You'll learn the basics of footwork, musicality, how to lead and follow, and many other fun skills. ?Not to mention meeting some new fun, interesting people. ? Want to see what you'll learn? ? Click here to watch the sample video Click here for more information about Salsa Class with Javier Campines ? ? FAQs ? Are there ID requirements or an age limit to enter the event? There is no age limit for class. ?However, this is considered an adult level class, so anyone roughly age 16 and up would be welcome. ? What are my transport/parking options getting to the event? There is street parking available on Montana, no meters after 8PM. ? What can/can't I bring to the event? You can bring a towel, gym bag, water bottle, etc. ?Please do not bring street shoes with black soles. ? Where can I contact the organizer with any questions? Either by email at javier@javiercampines.com or at (310)904-8789 ? Is my registration/ticket transferrable? No, your ticket is non-transferable. ? Can I update my registration information? Yes, you can update your information anytime on EventBrite. ? Do I have to bring my printed ticket to the event? You can either bring your printed ticket or your e-ticket on your smart phone. ? What is the refund policy? All online sales are final. ?However, if a refund is necessary, we will issue that at the class. ? The name on the registration/ticket doesn't match the attendee. Is that okay? That is fine. ?However, once the registration has been assigned to someone, it cannot be transferred."
}