{
    "addr": "6448 Santa Monica Blvd. Los Angeles, CA 90038", 
    "title": "Fa La La La: A Threesome Of Holiday Fun", 
    "url": "http://www.eventbrite.com/e/fa-la-la-la-a-threesome-of-holiday-fun-tickets-19437647527?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-04T20:00:00-08:00", 
    "endtime": "2015-12-04T21:30:00-08:00", 
    "categories": [
        "Theatre", 
        "Concert or Performance"
    ], 
    "desc": "MORE DETAILS & TICKETS FOR ALL PERFORMANCES AVAILABLE AT HOLIDAYSHOW.STUDIOCARTISTS.COM  ? Studio C Artists? presents... ? FA LA LA LA A Threesome Of Holiday Fun ? ? A trio of fun and frivolous comedies for your holiday viewing pleasure! ? Death By Poinsettia Written by Dwayne Yancey Directed by Edgar Pablos Starring Sumi Folz & Andres Solorzano Reality TV North Pole Written by Matt Hanf Directed by Sabrina Lloyd Starring Joshua Benton, Emily Button, Michael Matts, & Scot Shamblin - and TJ O'Brien (12/4-12/5 performances) Christmas Caroline Written by Joe Gulla Directed by J. Bailey Burcham Starring Shawn Davis, Scott Gerard, Megan Gill, Michelle Luchese,  Sarah McElligott, & Myshell Tabu ? Runs Fridays & Saturdays @ 8PM November 13th - December 12th ? December 5th Performance To Benefit One World Stage & Screen All Proceeds From 12/5 Show Go To OWSS! ? ? General Admission ? $20.00 ($15 Early Bird*)  Approximate running time: 75 minutes ? * Use the promo code \"earlybird\" to get $5 off General Admission seating up to 24 hours prior to the performance. ? ? FAQs What are my parking options for the event? There is a valet available in front of the theatre,  on Santa Monica Blvd.? near the corner of Wilcox Ave. ?Street parking is also available on the surrounding side streets around the theater. Where can I contact the organizer with any questions? You can email? info@studiocartists.com ?or call (323) 988-1175. Is my registration/ticket transferrable? Yes. Can I update my registration information? Yes. Do I have to bring my printed ticket to the event? It helps, but is not necessary. What is the refund policy? We do our best to refund tickets when possible. ?If seats are SOLD OUT, we are unable to offer a refund; but if a show has not yet SOLD OUT, then we will gladly refund your tickets, so that you can purchase them for a different night. What about late seating? We aim to start the show on time, so please do your best to be seated by 8PM. ?We will try to hold the show for a few minutes to accommodate late-comers. ?If you are not in attendance by 8:05PM, and we have a waitlist, your seats will be given to those on the waitlist. ?If you arrive after your seat has been given away, we will accommodate you with standing room, and refund you the difference (if any) in your ticket price. The name on the registration/ticket doesn't match the attendee. Is that okay? Yes, that's not a problem, as long as you have the tickets with you."
}