{
    "addr": "Los Angeles, CA", 
    "title": "Big Data and Hadoop Certification Training Bootcamp (includes Apache Spark) - Live Instructor Led Classes | Certification included | 100% Moneyback guarantee | Los Angeles", 
    "url": "http://www.eventbrite.com/e/big-data-and-hadoop-certification-training-bootcamp-includes-apache-spark-live-instructor-led-tickets-17350197909?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T07:00:00-08:00", 
    "endtime": "2016-01-30T10:00:00-08:00", 
    "categories": [
        "High Tech", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Big Data and Hadoop Certification Training (Includes Apache Spark) - Live Instructor Led Online Classes? Our? Big Data and Hadoop certification Training Bootcamp with 100% moneyback guarantee ?is designed to impart knowledge, skills and hands on experience required to become a successful Hadoop Developer, Administrator or Tester. ? Get Certified at No Extra Cost with 100% Moneyback Guarantee ? Concepts Covered: ?Big Data, NoSQL, Streaming, Analytics Tools Covered: ?HDFS, MapReduce, Pig, Hive, HBASE, Zookeeper, Flume, Sqoop, Oozie, Spark, Storm, Mahout. ? \" Big Data and Hadoop Certification Training \" ?course by KnowBigData is a blend of administration and writing code using Hadoop Eco-System components. We conduct ?3 Hours / Session, Total 11 Sessions (Sat-Sun)? Certification training and provide a Project / real life experience. We form teams of 3-4 members and based on their interests we assign a project to each team. A project is usually of three weeks duration. We continuously support and guide the teams during projects by conducting regular scheduled meetings and also provide individual assistance. ? Big Data and Hadoop Certification Training (Includes Apache Spark) - Live Instructor Led Online Classes: ? For any queries, write to us: ? Raul James, Business Development manager ? Email:? sales@knowbigdata.com ? Ph: +1 (419) 665 3276 ? ? KnowBigData / Products Tree"
}