{
    "addr": "Hollywood Hills. Checkin at Staging location disclosed to ticket holders. Los Angeles, CA 90068", 
    "title": "The DreamMaker Company Presents a Casa de Dita Social Hosted by Dita de Leon & DreamMaker Angels", 
    "url": "http://www.eventbrite.com/e/the-dreammaker-company-presents-a-casa-de-dita-social-hosted-by-dita-de-leon-dreammaker-angels-tickets-19561708597?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T14:00:00-08:00", 
    "endtime": "2015-12-05T22:00:00-08:00", 
    "categories": [
        "Other", 
        "Party or Social Gathering"
    ], 
    "desc": "The DreamMaker Company presents a Casa de Dita Showcase hosted by Actress Dita de Leon and our atmosphere models, the DreamMaker Angels.? The Dreammaker Company location rental division which manages luxury mansions for events and film location rentals, showcases its newest property \"Casa de Dita\", a luxury modern villa owned by actress Dita de Leon in the Hollywood Hills just a short walk from Lake Hollywood. This showcase will feature  demonstrate of applications for DoTerra ?essential oil where our DreamMaker Angels will serve catered foods cooked with Doterra Essential oils, scents created with DoTerra essential oils. As space permits some of our guests will be able to endulge in other applications of Doterra essential oil like our jacuzzi enfused experience. Some of our ticket packages include DoTerra Essential Oil Samples and DITA Chocolate samples.? There will be no need to find our location - you'll be diven to the property by our shuttle service from a staging area near the W Hotel at Vine & Argyle, close to the subway entrance of LA Metro's Red Line. The DreamMaker Company is a full service entertainment and media company.  Our innovative team of visionaries devote their efforts? in the areas of Film Production, Talent Management and Brand Marketing. The DreamMaker Company, Casa de Dita and Dita de Leon reserve the right to refuse access and revoke ticket privileges to anyone at our discretion i.e. anyone disruptive, disrespectful or engaging in behavior that is unacceptable to our guests and/or management without refund of ticket purchase price."
}