{
    "addr": "2366 Pelham Avenue Los Angeles, CA 90064", 
    "title": "Knife Skills Class - Sat, 12/5/15 @3pm w/Chef Eric Crowley- West LA-Kids OK", 
    "url": "http://www.eventbrite.com/e/knife-skills-class-sat-12515-3pm-wchef-eric-crowley-west-la-kids-ok-tickets-19614941819?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T15:00:00-08:00", 
    "endtime": "2015-12-05T17:30:00-08:00", 
    "categories": [
        "Food", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Knife Skills ????? $95 Per Person Sat, 12/5/15????? 3pm-5:30pm???? OR?????? Sat, 1/30/16????? 3pm-5:30pm Learn  how professionals Chop, Dice, Slice and Julienne items quickly and efficiently.?  CHEF ERIC  shows you knife holding grips, knife cuts and how to choose, sharpen, hone and care for your knives.? Learn to cut with ease advancing to more complicated and decorative Brunoise, Paysanne, Batonnet and Tourne Cuts.? Everything looks and tastes better when ingredients are cut uniformly, cook evenly and are presented beautifully.? Work with Vegetables, cut Chicken Breasts off the Bone, and see demonstration of De-boning a Whole Chicken.? You make a delicious meal to be enjoyed at the end of class. Bring your creativity and questions as you explore Cooking and Pastry/Baking to start a new career or impress your friends with your SKILLS as a Master Chef or Pastry Chef ? ? Gift Certificates Available Via Email ? The Perfect Gift for ANY Occasion Register On-Line 24 Hours a Day @  http://culinaryclassroom.com/store Sign up for our Newsletter ? we?ll send you Class Listings and Seasonal Recipes! Cook Well, Eat Well and BE Well!? With Chef Eric Crowley Convenient Parking/Freeway Close-405/10 1 Block East of Overland, Just North of Pico -  Parking Just North of Pico on Overland ????????????????????????????????????????????????????????????????????????????????????????????????????????????  www.facebook.com/chefericsculinaryclassroom www.twitter.com/chefericcrowley www.instagram.com/chefericsculinaryclassroom   www.culinaryclassroom.com www.youtube.com/user/culinaryclassroom www.pinterest.com/chefericscc"
}