{
    "addr": "13240 Weidner St Los Angeles, CA 91331", 
    "title": "The Pan Am Experience", 
    "url": "http://www.eventbrite.com/e/the-pan-am-experience-tickets-18979192275?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T18:30:00-08:00", 
    "endtime": "2015-12-05T22:30:00-08:00", 
    "categories": [
        "Food", 
        "Party or Social Gathering"
    ], 
    "desc": "Pan Am Flies Again? Relive the magic of flying onboard a luxurious Pan Am 747. ?An experience available only at Air Hollywood, Los Angeles, California. From its birth in 1927, Pan American World Airways was the pioneer airline whose routes spanned 6 continents and more than 80 countries. ?Almost a century later, the name Pan Am is still a very powerful brand, and inside this Southern California motion picture studio sits an exact replica of the airline?s Boeing 747 and everything that made it so special. ? Click here to watch us on the \"Today Show\" ? Your Pan Am Experience begins at our exclusive First & Clipper class check-in desk. where our Pan Am customer service agent provides each passenger with a 70?s style boarding pass, ticket jacket and first class carry-on tags. ?   ? You?ll be invited into the Clipper Club where you?ll have an opportunity to peruse the vintage Pan Am memorabilia including authentic uniforms, airline seats, handbags, artwork, and more. ? You can mingle with other enthusiasts at the Clipper Club lounge, share stories, and make new friends.   Soon thereafter, you?ll board ?Clipper Juan T. Trippe?, our dedication to Pan Am ?s first Boeing 747, where you?ll be sprung back in time to the 1970s. ?  As soon you set foot inside the aircraft, your Stewardesses adorned in original Pan Am uniforms will welcome you onboard with a fine cocktail of your choice as Frank Sinatra?s soothing voice will transport you back in time.   ? With libation in hand, we encourage you to explore the aircraft ? from First Class on the main deck, to Clipper Class aft of the galley, and the Upper Deck dining room.   ? The interiors of each cabin have all been uniquely restored to Pan Am?s original cabin d?cor and branding elements. Before we ?take off?, the crew will perform an in-flight safety demonstration followed by a brief welcoming message from the flight deck. Soon you will be asked to take your seat as a stewardess sets your table for a truly memorable dining event. Main Deck passengers will sit back in plush Sleeperette seats and relax in a quiet, intimate dining setting while Upper Deck passengers will climb the winding staircase and enjoy a dynamic social atmosphere. ? Everything from the china to the glassware is authentic with careful attention to the exquisite service delivery of the era and menu offerings of Pan Am. In classic Pan Am style, you will be served a delightful, gourmet four-course meal, starting with choices like shrimp cocktail or?tomato and mozzarella drizzled with a pesto glaze. ?? For the main course, we offer?a choice of Chateaubriand carved from the trolley, or Roasted Chicken with Peppercorn sauce. For vegetarians we offer a pasta entree that is sure to please.   Each meal comes with garden fresh vegetables and roasted potatoes.?   Our 3rd course is a fine selection of fruit, cheese & biscuits accompanied by port wine.   And finally the fourth course is a dessert cart with a large selection of digestifs. Tea & ?coffee completes the meal. ? At the end of your flight, we offer all passengers an optional tour of the various production sets at Air Hollywood, including the original cockpit from cult classic Airplane! as well as sets and props used in major motion pictures such as Bridesmaids, The Wolf of Wall Street, and the hit television show Lost. For the first time since Pan Am ceased operations, you can now relive the magic of this golden era in travel. ?We cordially invite you to personally experience this unique ?flying? opportunity in the tradition of Pan Am. CANCELLATION / FULL HOUSE POLICY: Tickets are non-refundable. We prefer every seat to be filled on every \"flight\", so if you are unable to join us and unable to gift your tickets, please contact Air Hollywood at 818.890.0444 to discuss available options. Thank you."
}