{
    "addr": "2515 Beverly Blvd. 2nd floor. Los Angeles, CA 90057", 
    "title": "퓨전사극 '살로메'", 
    "url": "http://www.eventbrite.com/e/19306754021?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T20:00:00-08:00", 
    "endtime": "2015-12-05T21:30:00-08:00", 
    "categories": [
        "Theatre", 
        "Concert or Performance"
    ], 
    "desc": "Christian film and theater are becoming revitalized. The religious film,  Passion of Christ , still maintains its place as the highest grossing R-rated movie of all time, and every film studio is churning out movies such as  Blind Side, The Book of Eli, Fireproof,  and  Courageous , which are seasoned with religious themes and scoring surpluses surpassing expectation thanks to Christians? word-of-mouth marketing. Turning to the theater scene, Korea offers plays such as  Is There Room? , staged every year at the  Daehakro  (the off-Broadway of Korea), and the 23-year-old  Confession of?Pontius Pilate , which holds the title as the most performed show in Korea. These plays meet the constant stream of Christians thirsting for entertainment and nonbelievers interested in Christian messages. In comparison, Christian theater in Los Angeles is largely limited to individual churches? preschool/middle school department?s seasonal performances due to a lack of expertise and an exhaustion of material. Ezekiel Theater Company, as a professional adult Christian theater company, was founded by theater professionals and actors who have been active for decades in their respective fields with the purpose of ?expanding the audience from Christians to the general public.?Christian theater has admittedly been less-than-friendly to non-Christians because it has traditionally derived its content and charactersfrom the Bible. After its founding in 2013, Ezekiel has held regular workshops to develop professional artists and has presented \"the art of life\" to countless Christians and the general public by showcasing two or more works each year. Through these shows, Ezekiel has challenged Christian theater stereotypes, and has raised the quality of performances while delivering the gospel message in an engaging, dynamic, and delicate way.? The Fusion Korean Traditional Dance & Play, ? Salme , to be performed in October, will revolve around the story of Salome, the princess of Judea who led King Herod to kill John the Baptist as a reward for dancing in the banquet. Ezekiel  (??????????,) Ezekiel was a prophet during the years spanning the end of the Kingdom of Judah to the first half of Babylonian exile (approx. 593 B.C. - 571 B.C.). Prophet Ezekiel performed theater symbolizing the siege of Jerusalem atop a clay tablet (4:1-3), and God instructed him not to say anything beyond what was revealed to him (3:26, 24:27). The name \"Ezekiel,\" means \"God strengthens\" or \"God trains.\" ?? ???? ???:? https://www.facebook.com/EzekielDramaMinistry ? ??? ??? ??? ??? ?? ???? .  ?? ??  ? ?? ?? ????? ? ? ?? ???  R ?? ?? ?? ??? ????? ??? ?? ?? ??? ? ?????? ??? ???? ??? ???  ? ???? ???  (Blind Side)? ? ???? ?  (The Book of Eli)? ? ??? ???  (Fireproof)? ? ?????  (Courageous)?  ?? ?? ?? ?? ?? ,  ?????? ??? ????? ???? ?? ?? ??? ???? ???? .  ?? ??? ??? ?????? ????? ?? ???? ??  ? ?? ???? ?? ?  23 ?? ?? ??? ???  ? ???? ?? ? ?? ??????? ??? ?? ?? ??? ??? ??? ???? ??? ?? ????? ??? ???? ???? ???? .  ?? ???  LA ?? ??? ??? ??? ??? ??? ??? ? ??? ??? ,  ?????? ?? ???? ??? ???? ??? ??? . ? ?? ???? ? ? ?? ?? ?????? ? ???? ????? ? ??? ???? ?? ?? ????? ?? ????  ? ??? ???? ????? ????? ? ?? ??? ??? ??????? .  ????? ?? ,  ???? ?? ?? ??? ??? ? ???? ??? ???? ?? ????? . 2013 ? ???? ??? ???? ???? ?? ?? ????? ????  1 ?? ?? ?? ??? ???  ? ??? ?? ? ? ??? ??? ??? ???? ???? ???? . ????? ??? ???? ??? ????? ?? ??? ?? ??? ?? ??? ???? ??????? ??? ??? ???? ?????? .?10? ?? ??? ???? ?????? ?? ??? ????? ??? ????? ???? ??? ???? ?? ?? ??? ??? ??? ???? ?? ?? ????? ??? ??? ???? ???? ? ?? ??? ?? ??? ??? ?????. ???? (Ezekiel/ ??? ) ? ???? ???? ??? ??? ?? ( ?  BC 593 ?  - BC 571 ? ) ? ?? ??? ??? ?? .  ????? ?? ??? ????? ??? ???? ??? ??? (4:1-3),  ?????? ????? ??? ???? ? ?? ?? ?? ?? ???? ????? (3:26, 24:27)  ????? ???  \" ???? ??? ??? .\",\" ???? ????? .\" ?? ??? ."
}