{
    "addr": "1149 N. Gower Street. 1st Floor Conference Room. Los Angeles, CA 90038 ", 
    "title": "THE TREE OF LIFE: A Paint Your Essence Workshop", 
    "url": "http://www.eventbrite.com/e/the-tree-of-life-a-paint-your-essence-workshop-tickets-19376121501?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-06T13:00:00-08:00", 
    "endtime": "2015-12-06T16:00:00-08:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Class, Training, or Workshop"
    ], 
    "desc": "THE TREE OF LIFE A PAINT YOUR ESSENCE WORKSHOP   Do you want to plant new seeds for 2016?  Do you want to sink your roots into your beliefs?  Do you want to be more of your authentic self?  If you answered yes to any of these, then you will have a fun time painting in this workshop. You will create a new inner landscape that is fertile ground for discovering  Y O U  and creating change. Color, imagery and symbolism, will be your guides in this expressive art painting workshop. The symbol you will paint is a  TREE .  ?Trees can symbolize our belief system, or ?story,? that may or may not be our own creation. Maybe its roots are sunk into stories and beliefs that are not your own, or that do not align with your truth, your most authentic self.?*  This workshop is an opportunity for you to meditate on the symbol that is the  TREE OF LIFE  and intentionally and creatively plant our own roots in beliefs that serve and resonate with? Y O U  and then grow into our fullest expression in this lifetime!  What an awesome way to start 2016 by creating your own lush, green, fruitful and nurturing? TREE  that is your LIFE!  Thank you for joining us in painting your   E S S E N C E   No art experience necessary or worrying about only being able to draw a stick figure!  This is open to men, women and children 13 & Up  DATE & TIME :  Sunday December 6, 1p-4p  LOCATION : Hollywood Production Center, 1149 N. Gower Street, Hollywood, CA  PRICE : $50 INCLUDES SUPPLIES"
}