{
    "addr": "835 W Olympic Blvd. Ste 900. Los Angeles, CA 90064", 
    "title": "RX4 MDs: Physician and Health Professionals Innovation Hub", 
    "url": "http://www.eventbrite.com/e/rx4-mds-physician-and-health-professionals-innovation-hub-tickets-19550058752?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-07T07:30:00-08:00", 
    "endtime": "2015-12-07T09:30:00-08:00", 
    "categories": [
        "Medical", 
        "Meeting or Networking Event"
    ], 
    "desc": "RX4 Group supports physicians and other health professionals in the challenges and opportunities of change, innovation and growth. This opportunity is for physicians and other licensed health professionals who: ? Own or co-own their own healthcare practice or other business or are in a process of launching new practices/businesses ? Want to grow and adapt their businesses to meet the changing marketplace ? Have an interest in entrepreneurship or ther business of healthcare ? Want to learn, share insights, and explore collaboration opportunities, and network.? If this description is a fit, we invite you to join our Innovation Hub, a chance to learn, share knowledge and insights about entrepreneurship, busine ss and collaboration.? Although our network will be national, we are launching in greater Los Angeles. Beginning in January 2016,  we will be holding monthly meetings on the first Monday of each month . The very first introductory meeting will be on 7th December, 2015 at 7.30am at 11835 W. Olympic Blvd, Los Angeles, 90064, Suite 900 (near Olympic and Bundy).? There will be around 30 minutes for networking (and coffee/tea/drink and snacks will be available) and the meeting itself will run from 8am till 9.30am. We will also be announcing other opportunities to participate both in-person and digitally. Each month, we will focus on relevant emerging trends and developments in practice, and feature insights and intelligence with the principal goal of a deeper understanding of the trend/development and its business impact/opportunity, followed by a high-level discussion (at which all individuals will also be able to introduce themselves and what they do so as to discover common interests and possible future collaboration opportunities)."
}