{
    "addr": "110 East 9th Street, 13th Floor Los Angeles, CA 90079", 
    "title": "The 8th Annual UNIQUE LA Holiday Market", 
    "url": "http://www.eventbrite.com/e/the-8th-annual-unique-la-holiday-market-tickets-19585866855?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-05T11:00:00-08:00", 
    "endtime": "2015-12-06T18:00:00-08:00", 
    "categories": [
        "Festival or Fair"
    ], 
    "desc": "This Holiday Buy Local! *Only 1 50 0 P re-Sale? Tickets are available online ,? but tickets can always be purchased at the event for $10 (Buying online means you don't have to wait in a line at the door!) * UNIQUE LA HOLIDAY MARKET is the only curated, modern made-in-America design  show in the country - and the largest shopping event around!? Seriously, it's big - get ready to shop from  350+ ?designers & artists, support the local economy,? join in community and have a blast!? When: ?Saturday & Sunday, DEC 5 & 6, 11am - 6pm both days Where:  California Market Center in DTLA Cost: $10  (Good for both days!) Admission includes: ?? Free snacks and drinks ?from Bundaberg, Kevita, Just Chill and Nature's Bakery ?? Unlimited re-entry ?for both days ?? Free Manicures and Nail Art? from LAQR Manicure Bar ? ? Free photo portraits  & prints from Oh Snap Studios!? ? ? Free gift wrapping? for all of your purchases at Unique! Clothing & Accessories ? Stationery ? Jewelry ? Housewares ? Artwork ? Ceramics? Gourmet Edibles ? Bags & Purses  ? Furniture ? Lots more! More About UNIQUE MARKETS? UNIQUE USA produces pop-up markets in Los Angeles, San Francisco and New York, with plans to expand across the country in 2016. The markets are an exciting two-day shopping event?that showcases fresh, hand-selected design talent.? With no 'middle man' you'll shop directly from the designers themselves, which means prices?will be less than retail yet the designers actually make more profit.? It's a win-win for everyone! ?More importantly, UNIQUE MARKETS is truly about fostering and growing a great local community and bringing attention to the Made in America movement."
}