{
    "addr": "120 South Los Angeles Street Los Angeles, CA 90012", 
    "title": "Acne Therapies Training - Los Angeles, CA", 
    "url": "http://www.eventbrite.com/e/acne-therapies-training-los-angeles-ca-tickets-18116796827?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-11T08:30:00-08:00", 
    "endtime": "2015-12-11T17:00:00-08:00", 
    "categories": [
        "Medical", 
        "Conference"
    ], 
    "desc": "Upon Completion of this acne training program, the physician should be able to: Advanced Acne TreatmentLearn to recognize numerous acne conditions and create an effective treatment plan. Learn and receive specific protocols for prescribing systematic antibiotics, topical retinoids, and for non-responsive patients - Accutane or new light sensitive prescriptions. Understand the proper dosages, duration of dosage, side effects, and contradictions for Accutane. Learn to utilize the newer modalities for acne conditions such as with microdermabrasion, chemical peels, cosmeceuticals, and the use of the more effective dermal delivery devices. Understand, evaluate and create a treatment plan for the PCOS patient. Learn to perform a comprehensive skin evaluation. Review other traditional therapies such as the use of drying agent, topical and oral medications (prescribed and over the counter medications). Learn about PhotoDynamic therapies (Blue Light) now available for office and home-use as an adjunct to your treatments. Understand how to use Intense Pulse Light Therapy for the treatment of Acne. Learn specific techniques and treatments for Acne Rosacea and to control the appearance of such using cosmeceuticals and light therapies. Learn how to eliminate unwanted acne scarring including hypertrophic and keloid scarring associated with acne. Gain expertise in pricing and marketing these new high demand services as well as integrating these new services within your practice. ? For more course information contact us at: Empire Medical Training Toll Free: 866.333.6747? email: info@empiremedicaltraining.com web:? www.empiremedicaltraining.com"
}