{
    "addr": "3680 Wilshire Blvd, 2nd Fl Los Angeles, CA 90010", 
    "title": "Wave Plastic Surgery Center: FREE 2-Day Beauty Expo", 
    "url": "http://www.eventbrite.com/e/wave-plastic-surgery-center-free-2-day-beauty-expo-tickets-19393389149?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-11T10:00:00-08:00", 
    "endtime": "2015-12-11T18:00:00-08:00", 
    "categories": [
        "Christmas", 
        "Festival or Fair"
    ], 
    "desc": "Wave Plastic Surgery Beauty Expo Friday, December 11, 2015, 10:00 AM - 6:00 PM and? Saturday, December 12, 2015, 10:00 AM - 5:00 PM? Aroma Center 3680 Wilshire Blvd, 2nd Floor, Los Angeles, CA 90010? On December 11th and 12th Wave Plastic Surgery Center will be hosting its first annual Beauty Expo. This special 2-day event is FREE to the public.? The Wave Beauty Expo will be the first of its kind within the cosmetic surgery industry; we have invited the industry leaders in cosmetic treatments to gather in one location to discuss their newest technologies and techniques. We are excited to present this unique opportunity to our guests since a gathering of industry professionals at this scale is typically rese rved for larger medical conferences. At Wave, we scour the market for the most cutting edge technologies that would be most beneficial for our patients. We believe in educating our patients and including them as an active member of the team in creating a personalized treatment plan.? The Beauty Expo will feature: Access to leading industry professionals in cosmetic services and Wave staff, who will be happy to answer your questions Seminars and live demos on popular procedures led by our doctors? Raffle drawings for free surgery, non-surgical procedures, and skincare gift baskets Day of purchase specials for surgical and non-surgical procedures, as well as medical grade skincare products Booths by Hair Do salon, Premiere Dental, and Sushi Ko Early Bird RSVPs will receive a free gift (limited quantity) Complimentary food and beverage will be served RSVP for the event by November 30 to be eligible to enter a drawing to receive a free procedure as our live demo patient during the two-day event. Please note the following steps:? 1. RSVP by emailing ask@waveplasticsurgery.com . Include your full name, date of birth, phone number, day that you will be attending, and procedure(s) that you are interested in.? 2. We will email you the first week of December if you have been chosen to be a live demo patient"
}