{
    "addr": "3877 Grand View Boulevard Los Angeles, CA 90066", 
    "title": "Creativity Lab - Art & Meditation Monthly Group", 
    "url": "http://www.eventbrite.com/e/creativity-lab-art-meditation-monthly-group-tickets-16132914983?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-12T11:00:00-08:00", 
    "endtime": "2015-12-12T13:00:00-08:00", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "First Thought, Poetry, Meditation, Movement, Brush, Square One, Collage, Object Arranging, Painting, Contemplation, Music, Photography, Discussion, Collaboration ... LEARN MORE GOT TO OUR MEETUP GROUP TO LEARN WHAT TOPICS WE'LL DISCUSS:   www.meetup.com/Shambhala-Arts Second Saturday of the Month at? Westside Shambhala ABOUT THIS GROUP:  We are a group of art and meditation practitioners and teachers who want to play with the Dharma Art teachings of Ch?gyam Trungpa Rinpoche, and to share it with others. To let go of concepts about \"Art\" and collaborate. Not primarily to make stuff, but to engage each other and develop a ground of mutual trust born of curiosity, willingness to be a fool, and trust in the process of coming back to the present moment. To see where it goes.Please join us! Who's invited? You are anyone between the ages of 14 and 140, artist or not, meditator or not. There will be meditation instruction and opportunities to relate these teachings to your personal projects or practice. Recommended Reading:  True Perception  by Ch?gyam Trungpa Bring: a notebook or sketchbook and pen or pencil Door opens: 10:30 a.m. for tea Lab starts promptly at 11:00 a.m. No art experience is ever necessary at Creativity Lab. Shambhala Center in Mar Vista:  3877A Grand View Blvd, Los Angeles, CA 90066 PLEASE NOTE: The Westside Center is situated behind 3871 Grandview. The entrance is through the alley between \"Under the Sea\" and \"GreenCoast Hydroponics\", which is directly across the street from \"STOCK Building Supply\"."
}