{
    "addr": "Los Angeles, CA", 
    "title": "Perfecting your Perfect Face L.A. with Makeup Artist April M. Chaney", 
    "url": "http://www.eventbrite.com/e/perfecting-your-perfect-face-la-with-makeup-artist-april-m-chaney-tickets-19570891062?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-13T12:00:00-08:00", 
    "endtime": "2015-12-13T16:00:00-08:00", 
    "categories": [
        "Beauty", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Join? Hollywood? Celebrity? Make-Up Artist and Expert , April M. Chaney , ?for an Exclusive Day ?of ?Perfecting Your Perfect Face? on Sunday December 13th, 2015 ? The Four-Hour Educational Event to? Offer Insider? Beauty? Tips ?a nd ?Techniques? from Hollywood ? ? Having just? completed work? during the Primetime Emmy Awards  celebrity make-up artist ,? April M. Chaney, invites you to ??Perfecting You r Perfect? Face,? an exclusive day offering ? Hollywood? insider beauty tips and techniques on Sunday , December 13th, 2015 ?fr om 12pm-4pm in Downtown LA location TBD? ? This hands-on course is ideal for aspiring make-up artists and? those? interested in learning how to transform their face naturally , ?and flawlessly , ?with? Hollywood-centric? techniques and skills .? The i n -depth analysis of achieving a? perfectly natural make- up face? will include up-close-and-personal demonstrations and applications with Chaney, and some of her? favorite products. ? Limited attendance is open to the public and is available on a first come, first serve basis by visiting? www.AprilChaneyMasterclassLA.eventbrite.com ? Attendees will gain insight on techniques? from Chaney?s more than 17 years of experience, including : ? A licensed esthetician,? Chaney is a s o uthern b elle ?with a passion for glamour? and has? been creating beautiful faces ?with timeless and classic looks ? for nearly two decades . ? With experience working on hit shows such as? The Real, Shah's of Sunset, America?s Next Top Model? and ?The Real Housewives of Orange County ,? Project Runway,? Chaney ?is ?a frequent collaborator with cosmetic giant L?Oreal at majo r Hollywood industry events including? the Academy Awards, Primetime Emmy Awards and Golden Globe Awards.? With humble beginnings behind a make-up counter in Alabama, Chaney ?s? work? has been featured internationally in ?television, ?film and? the fashion runway.? In addition to working? with major magazines such as ?? People , Essence? Us Weekly ,? O ?The Oprah ?Magazine , her make-up skills have appeared in? national editorial? campaigns for retailers? including? Kohls , GAP, Nordstrom, TJ Maxx? and Sears.? Chaney is a proud member of the Make-Up ?Artists & Hair Stylists Guild, IATSE Loca l 706, and represented by Cloutier Remix. ? Find Chaney on Facebook, Twitter ?and Instagram ?( @LirpaMakeup)? where she? frequently? shares make-up tips and tr icks, plus ? more information and? portfolio work at? www.aprilchaney.com . ? ?*** Note Prices go up Dec.13th, 2015 to $220 at door, Spaces are limited *** ? Name of Contact Person : Laura Camacho? Email : lauracamacho808@gmail.com ?Agent : Libby@cloutierremix.com FAQs ? Is my registration/ticket transferrable? yes, please send email of details regarding? ? Do I have to bring my printed ticket to the event? Yes or show online ticket via phone ? What is the refund policy? No refund is available at this time.? ? The name on the registration/ticket doesn't match the attendee. Is that okay? Yes but please give in detail the name of purchaser and the name of attendee"
}