{
    "addr": "201 North Westmoreland Avenue, Unit 128 Los Angeles, CA 90004", 
    "title": "CoreFab102 - An Introduction to 3D Printing", 
    "url": "http://www.eventbrite.com/e/corefab102-an-introduction-to-3d-printing-tickets-16287654814?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-13T17:00:00-08:00", 
    "endtime": "2015-12-13T19:00:00-08:00", 
    "categories": [
        "High Tech", 
        "Class, Training, or Workshop"
    ], 
    "desc": "An Introduction to 3D Printing and The ZPrinter 310   Core Fab  Prereq:  None  Cost:  $20 + $5 materials fee Learn to take any virtual 3D file on the computer and print it into a real world object!? 3d printers are the wave of the future for in-home fabrication.? This technology will one day render production and distribution obsolete by allowing you to pull from a virtual product database and produce any object within your own home at the click of a button. Part 1 - An Intro to 3D Printing This class provides the core overview of all things 3D printing that you will need to operate machines like the Makerbot and FORM1.? This comprehensive overview covers everything 3D printing from the different technologies of fabrication under the umbrella of 3D printing, the amazing innovations in fabrication technique that this enables, and the key design constraints inherent to 3D modelling for fabricating physical objects. Part 2 - The ZPrinter 310 We will teach you everything you need to know to operate the ZPrinter 310 we have at the shop.? This commercial 3D printer can produce any part at a stunning 300x300x450 dpi resolution in beautiful white gypsum.? You will get a hands-on introduction to operating the machine which will clear you for the necessary prerequisites to come in and operate this 3D printer yourself during our normal shop hours. Each student taking this class will have a chance to excavate a part from the machine and take home their very own 3D print! Sign up now on eventbrite: \" http://introzprinting.eventbrite.com \""
}