{
    "addr": "East 6th Street Los Angeles, CA", 
    "title": "THE ART OF FEMALE DOMINATION: SPANKING & OTK", 
    "url": "http://www.eventbrite.com/e/the-art-of-female-domination-spanking-otk-tickets-19612706132?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-13T18:00:00-08:00", 
    "endtime": "2015-12-13T20:00:00-08:00", 
    "categories": [
        "Adult", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Are you 50 Shades of Grey curious? Then do not come to this class. If, however, you are a Woman who is curious about how You can harness Your power as a Woman to have more control in Your career, over men and in your life through the erotic art of Female Domination, then this class is for you. Whether you are looking to spice up your sex life, be more in-control professionally, thinking about becoming a Dominatrix, or are a service p rovider looking to expand your bag of tricks, you will get the psychology and tools you need to get started.? This class in the Female Domination series you will learn - SPANKING & OTK 1. The different implement of spanking; barehand, leather and wooden paddles, frat paddles, hair brushes, wooden spoons, spatchulas, and other domestic goodies.? 2. Spanking techniques: Warm up, barehand, cupping, OTK administration and positioning for your bottom? 3. Spanking with paddles one and two handed? 4. Psychology, proprs, atmosphere, and attire of Spanking and Domestic Discipline 5. Cross over fetishes; School Teacher, Baby Sitter, School Marm, Age Regressions, Auntie, Nun, Daddy, Uncle, Boss, Secretary, Executive, Sissy Maid and more! 6. What you'll need to get started with any budget and proper impliments of this exciting fetish. Believe it or not the one thing you'll really need is the right kind of chair!? This is a hands on class, you will be doing spanking. Come dressed comfortably.? Instructor: Tara Indiana This is a hands on class, you will be spanking. Come dressed comfortably? and wearing undergarments or a swimsuit under your street clothes.  Preferably, be comfortable to be in just underwear or a thong for a portion of the class. It is harder to teach spanking when one can't properly see the target.? No free balling or commando. $20 in advance / $30 at the door? (space permitting) single women $60 in advance for ONE practice dummy This class is open to single women, couples, and ONE submissive and respectful single man or? sissy? willing to be a practice dummy. For info call the Den of Iniquity at 213 623 1520"
}