{
    "addr": "6380 Wilshire Boulevard. Suite 200. Los Angeles, CA 90048", 
    "title": "Ulpan Hebrew Classes for Kids (6-13) - Step 1", 
    "url": "http://www.eventbrite.com/e/ulpan-hebrew-classes-for-kids-6-13-step-1-tickets-19632232536?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-16T17:30:00-08:00", 
    "endtime": "2016-03-16T18:30:00-07:00", 
    "categories": [
        "Community \\u0026 Culture", 
        "Class, Training, or Workshop"
    ], 
    "desc": "MITCHABRIM LOS ANGELES KIDS HEBREW CLASS/STEP 1? December 16, 2015 - March 16, 2016 Mitchabrim Los Angeles Hebrew Language Classes offer an Ulpan to any member, spouse, or partner, or friend of the Mitchabrim LA community. The purpose of this course is to encourage Israeli American or Israeli-friendly Americans to learn or improve their Hebrew language knowledge. The Semester at Mitchabrim LA will span over a 3 months period, between December 09, 2015 and March 09, 2016. The course will include 12 classes, each class is 60 mins. Starting on December 09th at 5:30pm. Classes will take place at the Mitchabrim LA Center located at 6380 Wilshire Blvd, Suite #200 (Second Floor), Los Angeles, CA 90048, on every Wednesday evening. Classes will occur consecutively with the exception of the following date: December 23 & 30? (Winter break). If any other rescheduling occurs, Mitchabrim will be responsible to ensure that all 12 classes are completed by March 2016. Mitchabrim LA will provide notebooks and writing utensils to the students. Participants are expected to arrive on time! All Ulpan class participants must purchase the 12 weeks package in advance. No refunds are provided. The 12 weeks package costs $180 + $20 for study material, total of $200. Check or cash must be made out to Mitchabrim on or before the first day of class, Wednesday, December 09th, 2015. Ulpan classes will be taught by Meital Ben David. Meital has B.E.D in education from Israel. She is a professional Hebrew teacher who specialize in reading and writing. In case that Meital is unable to teach a course, a professional Hebrew teacher will step in as substitute. IMPORTANT: Upon registration to the class you will receive an email with an obligation form to read and sign.? Your participation depends on your filling and signing this form. You can find street parking on Wilshire Boulevard or paid parking in the nearby parking lots (the nearest parking lot is on Wilshire and La Jolla). When you arrive at 6380 Wilshire, you will come up the stairs to a big office building; the lobby attendant will let you in and direct you to go up the elevators to P2, second floor."
}