{
    "addr": "3838 S. Centinela Ave Los Angeles, CA 90066", 
    "title": "Live 2 Lead: Los Angeles", 
    "url": "http://www.eventbrite.com/e/live-2-lead-los-angeles-tickets-19047580827?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-29T08:00:00-08:00", 
    "endtime": "2016-01-29T15:00:00-08:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Conference"
    ], 
    "desc": "A leadership development experience designed to equip you with new perspectives, practical tools and key takeaways. You?ll breathe new life into your leadership during this information-packed event. Learn from world-class leadership experts and return to your office ready to implement your new action plan and lead with renewed passion and commitment. (These speakers will be speaking via simulcast and there will also be live presenters).? ? JOHN C. MAXWELL - INTENTIONAL LIVING ? John C. Maxwell is a #1?New York Times?bestselling author, coach, and speaker who has sold more than 25 million books in fifty languages. In 2014 he was identified as the #1 leader in business by the American Management Association? and the most influential leadership expert in the world by Business Insider and Inc. magazine. He has also been voted the top leadership professional in the world on LeadershipGurus.net for six consecutive years. As the founder of The John Maxwell Company, The John Maxwell Team, and EQUIP, he has trained more than 5 million leaders in nearly every country of the world. The recipient of the Mother Teresa Prize for Global Peace and Leadership from the Luminary Leadership Network, Dr. Maxwell speaks each year to?Fortune?500 companies, presidents of nations, and many of the world?s top business leaders. He can be followed at? Twitter.com/JohnCMaxwell . For more information about him visit? JohnMaxwell.com ? PATRICK LENCIONI - ORGANIZATIONAL HEALTH ? Patrick Lencioni is founder and president of The Table Group, a firm dedicated to providing organizations with ideas, products and services that improve teamwork, clarity and employee engagement. Lencioni?s passion for organizations and teams is reflected in his writing, speaking and executive consulting. Pat is the author of ten best-selling books with nearly four million copies sold. After twelve years in print, his book The Five Dysfunctions of a Team remains a fixture on national best-seller lists. His most recent book, The Advantage: Why Organizational Health Trumps Everything Else in Business, became an immediate national best-seller. Named in Fortune magazine as one of the ?ten new gurus you should know,??Lencioni? and his work have been featured in USA TODAY, Bloomberg Businessweek, and Harvard Business Review, to name a few. Prior to founding his firm, he worked as a corporate executive for Sybase, Oracle and Bain & Company. Lencioni lives in the San Francisco Bay Area with his wife and four sons. ? VALORIE BURTON - RESILIENT AND READY ? Valorie Burton is a bestselling author and Certified Personal and Executive Coach who has served clients in over 40 states and ten countries. Burton has written ten books on personal development, including Successful Women Think Diferently, What's Really Holding You Back?, Happy Women Live Better and her lastest, Get Unstuck, Be Unstoppable.? She is the founder of the CaPP Instatute, which provides tools and training that build resilience, well-being and productivity for life and work. Burton has been a regular contributor on the Today Show, CNN, and HLN.? She has also appeared in and on Dr. Oz, NPR, Oprah Radio, \"O\" The Oprah Magazine, Essence and hundreds of others. Burton has a master?s degree in applied positive psychology from the University of Pennsylvania, a master?s degree in journalism from Florida A&M University and a BA from Florida State University.? Join 30,000 subscribers to her weekly e-newsletter at www.valorieburton.com ?and visit her company site at? www.cappinstitute.com . ? ? KEVIN TURNER - LEADERSHIP LESSONS ? As Microsoft?s chief operating officer, Kevin Turner leads the company?s global sales, marketing and services organization of more than 47,000 employees in more than 190 countries. Under his leadership, the sales and marketing group delivered more than $78.6 billion in revenue in fiscal 2013. Turner oversees worldwide sales, field marketing, services, support and partner channels as well Microsoft Stores and corporate support functions including Information Technology, Worldwide Licensing & Pricing and Operations. The sales and marketing organization is focused on delivering Microsoft?s family of devices and services to customers and partners all over the world. In his eight years as chief operating officer, Turner has driven a strong track record of results, execution excellence and improved efficiency while also driving the customer satisfaction scores to the highest in company history. Turner spent nearly 20 years at Wal-Mart Stores, where he rose through the ranks and was named the youngest corporate officer ever at Wal-Mart at age 29. He held various leadership positions at Wal-Mart including becoming the Chief Information Officer for Wal-Mart Stores, and as his last assignment he served as the President and Chief Executive Officer of SAM?S CLUB, a $37 billion division of Wal-Mart Stores."
}