{
    "addr": "Los Angeles, CA", 
    "title": "Risk Based Internal Auditing (RBIA): 2-day Comprehensive Training Workshop", 
    "url": "http://www.eventbrite.com/e/risk-based-internal-auditing-rbia-2-day-comprehensive-training-workshop-tickets-15630182296?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-04T08:30:00-08:00", 
    "endtime": "2016-02-05T16:30:00-08:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Seminar or Talk"
    ], 
    "desc": "The Institute of Internal Auditors defines Risk Based Internal Auditing (RBIA) as a methodology that links internal auditing to an organization?s overall risk management framework. RBIA allows internal audit to provide assurance to the board that risk management processes are managing risks effectively, in relation to the risk appetite. But every organization is different. There are different attitudes to risk, different management and organizational structures, different processes and procedures, and the need to subscribe to and comply with different conventions and regulations. Experienced internal auditors need to adapt these ideas to the structures, processes and language of their organization in order to implement RBIA. Implemented correctly, RBIA offers tremendous advantages to the organization. RBIA allows internal audit to provide the Board of Directors with the assurance that it needs on three areas: By using the RBIA approach, the organization?s internal audit should be able to conclude that: This practical hands-on training course is designed for professionals from industry, financial institutions and risk intensive organizations. The following job titles/ positions will benefit from attending: ? ? We are registered with and adhere to the Statement on Standards for Continuing Professional Education programs of the National Registry of CPE Sponsors. Our registration number is 109066. Please check with the governing body of your license and state for specific CPE requirements. Grievances may be forwarded to the company at Ph: 650 620 3961; email:? cpe@complianceonline.com . Grievances may also be forwarded to the National Registry of CPE Sponsors-NASBA, 150 Fourth Avenue North, Suite 700, Nashville, TN 37219-2417, 615-880-4200, www.nasba.org, e-mail cpe@nasba.org . ? For Registration  -? http://www.complianceonline.com/risk-based-internal-auditing-rbia-seminar-training-80265SEM-prdsm?channel=eventbrite Note:  Use coupon code 232082 and get 10% off on registration."
}