{
    "addr": "Los Angeles, CA", 
    "title": "GRC Professional - Los Angeles - February 2016", 
    "url": "http://www.eventbrite.com/e/grc-professional-los-angeles-february-2016-tickets-18009773718?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-08T08:00:00-08:00", 
    "endtime": "2016-02-10T17:00:00-08:00", 
    "categories": [
        "Finance", 
        "Class, Training, or Workshop"
    ], 
    "desc": "GRC Professional Seminar ? ? The GRC Professional seminar is the best interactive course available to teach you how to efficiently design and enhance GRC capabilities within your business based on established the only international GRC standards. This program will also prepare you to enhance your professional credentials by taking the GRC Professional certification exam, offered by OCEG's affiliate organization, GRC Certify.? ? Through lectures and practical group interaction, discussions, and exercises, you will learn about defining a GRC strategy; integrating and improving corporate performance, risk and compliance programs; strengthening core business processes; and improving use of technology to support the integrated governance,management and assurance of performance, risk and compliance. There simply is no other training program that provides you with the skills and resources you need to help your organization improve its GRC capability by implementing the publicly vetted open source standards set out in OCEG?s GRC Capability Model. OCEG recently updated the GRC Capability Model to version 3.0. ?This is the only live training offered by OCEG that teaches about the new version of the model. ? This course is suitable for executives, managers and key staff? in all GRC roles (including risk, audit, compliance, legal, performance, and IT). Members of technology providers and professional service firms will also benefit from understanding the issues and approaches to GRC challenges faced by organizations they seek to serve. ? Class runs from 8:00a-5:00p each day. ? ? This is a group live event for NASBA authorized continuing education credit. Attendees who are All Access Pass holders or enterprise members of OCEG will receive a certificate of completion of this event indicating 24 hours of CPE.? OCEG is registered with the National Association of State Boards of Accountancy (NASBA) as a sponsor of continuing professional education on the National Registry of CPE Sponsors. State boards of accountancy have final authority on the acceptance of individual courses for CPE credit. Complaints regarding registered sponsors may be addressed to the National Registry of CPE Sponsors, 150 Fourth Avenue North, Suite 700, Nashville, TN, 37219-2417. Web site: www.nasba.org. For information regarding administrative issues such as complaints or refunds please contact info@oceg.org. About OCEG ? OCEG is a global nonprofit think-tank that helps organizations drive Principled Performance? and enhance culture by providing standards, tools and resources to integrate governance, risk, internal control and compliance processes. More info is at ? www.OCEG.org"
}