{
    "addr": "11461 Sunset Boulevard Los Angeles, CA 90049", 
    "title": "RECURRING REVENUE CONFERENCE 2016", 
    "url": "http://www.eventbrite.com/e/recurring-revenue-conference-2016-tickets-19410836334?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-23T08:00:00-08:00", 
    "endtime": "2016-02-23T19:00:00-08:00", 
    "categories": [
        "Other", 
        "Conference"
    ], 
    "desc": "Watch Video JOIN US February 23, 2016 Luxe Sunset Boulevard Hotel, Los Angeles Register Early and Save! ?2015 sold out! The?subscription?model ? it?s powered the success of Salesf orce,?Netsuite , Amazon, Netflix and many other companies.?We are a subscription economy and the implications are profound.  Whether you are deeply immersed in this space, or your company is looking for new revenue streams, the Recurring Revenue Conference 2016 is the place to meet the best people in this dynamically changing market. At this exclusive event, you'll discover: Join industry leaders to discuss the subscription economy.? Whether it is SaaS (software as a service) that enables companies to outsource effectively or a product that consumers subscribe to monthly, this event attracts the most exciting disruptors and innovators. Hear from entrepreneurs who have successfully built cloud-based solutions and learn from their best practices.  2015 was a sell-out with 400 attendees, 40 speakers, an amazing keynote speaker, a Fireside Chat, a Shark Tank and great networking! Register early and SAVE! About CLEAR CAPITAL ADVISORS CLEAR CAPITAL ADVISORS is a premier independent provider of strategic and financial advice on mergers, acquisitions, sales, private capital solutions, and strategic growth initiatives. ?Our clients are the founders and owners of leading middle market and emerging growth companies in tech enabled services, digital media, software, health care, and other high growth services.? Bringing creativity and passion, we are intensely focused on the success of every assignment. Securities offered through Fallbrook Capital Securities Corp., Member FINRA-SIPC www.clearcapitaladvisors.com"
}