{
    "addr": "8939 South Sepulveda Boulevard. ## 102. Los Angeles, CA 90045", 
    "title": "PMP Certification Training Course in Los Angeles, CA, United States of America", 
    "url": "http://www.eventbrite.com/e/pmp-certification-training-course-in-los-angeles-ca-united-states-of-america-tickets-19703507722?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-23T08:30:00-08:00", 
    "endtime": "2016-02-26T17:30:00-08:00", 
    "categories": [
        "Career", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Our Students speak :? ? Jonathan Niciter, CISCO ? Overall Satisfaction:? 4 /5 ? Feedback: ?Instructor brought years of experience into the course. I appreciated his room life, examples he brought to make the course more engaging. The course was informative and well laid out. One suggestion would be for the instructor to spend more time at the beginning of the course on how to use the material. ? Would you like to recommend our Training to your colleagues, teams and friends? ? Definitely Yes.? ? Madhu Gottumukkalla, Project Manager, Polycom ? Overall Satisfaction: ?5 /5 ? Feedback: ?Thanks to EzCertifications and many thanks to Mr. Hans Meijer, my instructor who has been exceptional. His teaching methodology, pace, consistency are truly professional. His subject matter and material are very helpful in dissecting the PMBOK 5 th ?edition. I think I am ready to take the exam and get certified soon. Thanks so much to Hans and EZ. ? Would you like to recommend our Training to your colleagues, teams and friends? ? Definitely Yes.? ? EZ certifications would like to present to you our upcoming 4 day  PMP Boot Camp  in: ???????????????????????????????????????????? Location:?  Los Angeles, CA This is an Instructor-led Classroom Training which will help you to prepare for the PMP examination conducted by PMI, USA.? For your convenience, we conduct PMP Classroom Training every month!? If you can?t make this one, join us next month! Click here for our calendar of upcoming PMP Training Sessions  because you can avail EARLY BIRD. About  EZ certifications: EzCertifications specializes in Professional certifications ? PMP, ITIL, Agile and Six Sigma. We are a Registered Education Provider (REP ID #2702) of PMI? - Project Management Institute. EzCertifications has trained over 50,000+ participants in 30+ countries across 5 regions. 500+ certified and experienced trainers worldwide. 98% pass rate in certification exams. Accredited by 8 global bodies and counting. Launched in 2009, our web site offers 50+ different training courses with an average order size of $1499. Orders range from $1399 to $1899. Ongoing customer promotions include 10% Discount on repeat purchases or FREE Apple products ranging from Apple TV to Apple MacBook. Our Affiliate Program Features: ????????????? Target geography 30+ locations every month in US states for classroom and online LVC courses. ????????????? Promotional Apple products available for customers Enroll Now ?Take advantage of our Classroom Training & world class e-learning content. Training Benefits provide by  EZ certifications: We are a Global Registered Education Provider (Global REP) of PMI ?  in the area of professional certification courses.? We provide high quality and cost-effective training solutions to meet individual and organizational training requirements in mission critical areas of Project Management, IT Service Management, Information Security, Enterprise Architecture, Business Analysisand Agile/Scrum. Enroll today because seats are limited!  We Make It EZ For You! For further queries please contact us Toll Free at 1-866-438-0220 Kind Regards, Kris Mohan Training Manager Contact us Toll Free at 1-866-438-0220 Kris.mohan@ezcertifications.com Website:  www.ezcertifications.com"
}