{
    "addr": "301 West 1st Street Los Angeles, CA 90012", 
    "title": "Business Series: Make It Official: Get Your Business Licensed", 
    "url": "http://www.eventbrite.com/e/business-series-make-it-official-get-your-business-licensed-tickets-19535394892?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-23T12:00:00-08:00", 
    "endtime": "2016-02-23T14:00:00-08:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Class, Training, or Workshop"
    ], 
    "desc": "In this class, local government officials from the City and County of Los Angeles will give new business owners and entrepreneurs important, practical information on how to ?make it official,? obtain business licenses and comply with local tax requirements.   ?? Class covers: Registration fees: ? FREE   - sponsored by the Friends of the Los Angeles County Law Library through the?generous support of? Pacific Western Bank . Classes fill up fast, register today to reserve your seat! All registrants must check-in?10 minutes prior to class timeto ensure your seat is not reassigned to waiting-list and walk-in attendees when classes are full. Photography / Videography: If you register for this class, you may be photographed or recorded. By registering for this class you are giving the LA Law Library your consent to photograph, videotape, record and broadcast your picture, likeness, voice and statements. ? No legal advice: LA Law Library does not provide legal advice. LA Law Library provides legal resources and assistance with legal research as an educational service. The Law Library is pleased to offer our patrons the opportunity to obtain assistance from third party legal service providers at this and other events within the Library. However, the Library does not control and is not responsible for the content or scope of any assistance given by those providers. ? For more information or to register please visit   www.lalawlibrary.org/CLASSES  or call 213.785.2516"
}