{
    "addr": "8939 Sepulveda Blvd. Suite 102 Los Angeles, CA 90045", 
    "title": "ITIL Certification Training Course in Los Angeles, CA , United States of America", 
    "url": "http://www.eventbrite.com/e/itil-certification-training-course-in-los-angeles-ca-united-states-of-america-tickets-19706496662?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-25T08:30:00-08:00", 
    "endtime": "2016-02-26T17:30:00-08:00", 
    "categories": [
        "Career", 
        "Conference"
    ], 
    "desc": "Our Students speak :? ? ? ? ??Mara Dower, BMS ? ? ? ?? Overall Satisfaction: ?5 /5 ? ? ? ? Feedback: ?Libby was great!!? She gave us great insight to the entire process of ITIL. She was ?????????entertaining and very motivational. I would love to take additional courses taught by her ? ? ? Would you like to recommend our Training to your colleagues, teams and friends? ? ? ? Definitely Yes! ? ? ? Eddy Lam, SDL ? ? ? Overall Satisfaction: ?5 /5 ? ? ? Feedback: ?Janet Hayes provides real life examples and situations not covered in course material. ? ? ? Janet made sure me understand key points before moving on in the lesson. ? ? ? Would you like to recommend our Training to your colleagues, teams and friends? ? ? ? May be! ? EZ certifications  would like to present to you our upcoming  ITIL Certification Prep Training  Workshop  ???  Location:?Los Angeles, CA ??? Date:?25-26 February 2016 This is an Instructor-led Classroom Training which will help you to prepare for the ITIL Foundation examination conducted by AXELOS.? For your convenience, we conduct ITIL Foundation Classroom Training every month!? If you can?t make it to this one, join us next month! Click here for our calendar of upcoming ITIL Foundation Training Sessions ? About ITIL Foundation Training: ITIL Foundation is one of the most widely adopted approaches, used globally by IT Service Management. It provides a practical, no-nonsense framework for identifying, planning, delivering and supporting IT services to any business. ?Recognition of this credential also increases your professional marketability to employers and higher salary levels. The benefits of having ITIL Certification are: ? ?  Improves IT Services??  ? ?  Reduces Costs ? ?  Improves Customer Satisfaction?????????  ? ?  Improves Productivity. About  EZ certifications: EZ certifications  is a Global Education Provider in the area of Professional Certification Courses. We provide high quality and cost-effective training solutions to meet individual and organizational training requirements in mission-critical areas of Project Management, IT Service Management, Information Security, Enterprise Architecture, Business Analysis & Agile/Scrum. Enroll Now ? Take advantage of our Classroom Training and World class e-learning content. Benefits of ITIL Foundation Training through EZCertifications: ? ?  High pass/success rate with Money-back Guarantee ? ?  2 days of Instructor-led classroom training ? ?  Examination on the 2 nd  day ? ?  APMG & CSME accredited Training Content  ? ?  3 Months online access to our e-learning content ? ?  2 full length simulation tests ? ?  Earn 24 PDUs for PMP CCR ? ? ? ? ? ? ? ? ? Enroll Today! ?We Make it EZ for You! Kind Regards, Kris Mohan, Training Manager ? Contact Us Toll Free:1- 866- 438-0220    Email:  kris.mohan@ezcertifications.com ? Website:  www.ezcertifications.com"
}