{
    "addr": "1910 Magnolia Ave. Los Angeles, CA 90007", 
    "title": "Welcoming Environment Institute Spring 2016", 
    "url": "http://www.eventbrite.com/e/welcoming-environment-institute-spring-2016-tickets-17172382057?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-10T08:30:00-08:00", 
    "endtime": "2016-03-10T12:30:00-08:00", 
    "categories": [
        "Conference"
    ], 
    "desc": "The Welcoming Environment Institutes are a compliant use of Tittle I funds, allocated for professional development and parental involvement, and other state and federal funds reserved for school improvement and/or parental?involvement.? Welcoming Environment Institute? This four hour Institute will provide school district and organizational staff with: * A foundational knowledge and understanding of parent engagement research and best practices? * An opportunity to assess and strengthen their school or site's strategies and practices for enhancing and ? ? ? ? ? ? supporting a welcoming? environment. ? Training Includes: -Interactive professional development sessions -Ready-to-use tools for parent? engagement ?planning? ? ? Cancelation Policy Families In Schools (FIS) strives to provide the necessary tools and materials needed for all institute participants to receive the quality services they need. We understand that unplanned issues can come up and you may need to cancel. Due to preparation and reservation policies with external vendors, we ask that you please provide a 72 hour notice if you need to cancel. A full refund will be issued once a written cancelation has been requested within allotted time. In the event that you must cancel with 48 hours or less notice, you will have two options: No Show Policy:? A ?no-show?, is a participant who misses an institute without written cancelation. ?A participant who misses an institute without prior written cancelation will not be issued any refund. All refund and/or vouchers will take 2-3 weeks to issue."
}