{
    "addr": "Los Angeles, CA", 
    "title": "PopUp Masquerade L.A. 2016", 
    "url": "http://www.eventbrite.com/e/popup-masquerade-la-2016-tickets-19069320852?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-02-27T19:00:00-08:00", 
    "endtime": "2016-02-27T23:59:00-08:00", 
    "categories": [
        "Spirits", 
        "Party or Social Gathering"
    ], 
    "desc": "#GetMasquedLA ? A secret indoor location. Sequins, feathers, and bubbly. Hundreds of fellow revelers, dressed in black and white, silver and gold. Welcome to a modern-day Masquerade ball. If you love the Hand Made Events PopUp Dinner, then you won't want to miss this magical evening!? As always, the night begins with finding out the secret location: we reveal the exact destination to ticket holders via email just two hours before the start of the event. If you're a DIY darling, Pinterest perfectionist, or dedicated foodie, this is a chance to get creative in everything from table d?cor to fashion to food and drink! Hand Made Events provides the place, the tables, the chairs, and entertainment. You come with inspired culinar y dishes, wine and bubbly, and lavish table designs (don't forget your table cloth!) in hand. Once the table is set, enjoy feasting with friends. A Masquerade ball is all about creative style. We hope this year marks the most elaborate costumes yet! Traditional ballgowns, tuxedos, and Great Gatsby-esque decadence highly encouraged. And remember, your costume isn't complete without a mask. The evening's entertainment will feature live music and DJ JOHNNY HAWKES, because a ball means everyone should be dancing.? We look forward to seeing you there! The PopUp Masquerade SF is a 21+ Event Please note there are no refunds but tickets are transferable We ask that you please fill out some demographic information on the order form for our sponsors. Their contributions allow us to offer more at our events and keep the ticket prices as low as possible. Hand Made Events will not share your personal info with anyone.  Thank you!"
}