{
    "addr": "1027 West 87th Street Los Angeles, CA 90044", 
    "title": "6th Annual Unfriendly Sons of St. Patrick presented by Center BMW", 
    "url": "http://www.eventbrite.com/e/6th-annual-unfriendly-sons-of-st-patrick-presented-by-center-bmw-tickets-19020942150?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-13T17:00:00-07:00", 
    "endtime": "2016-03-13T21:00:00-07:00", 
    "categories": [
        "Education", 
        "Party or Social Gathering"
    ], 
    "desc": "Join us for an evening of shenanigans at the Presented by Center BMW Sunday, March 13, 2016 5:00 PM: Cocktails & Silent Auction 6:00 PM: Dinner, Entertainment, Live Auction & Appeal Location: St. Michael's School (A.K.A. Our Lady of the AK-47) ? ? Co-Chairs Patrick Nally and Tom Rowan invite you to usher in St. Paddy's Day a wee bit early at this fun \"stag event\" benefitting the school. Head down to the 'hood this March to enjoy some fine whiskey, good food, great music, and bad jokes.   ? The Unfriendly Sons Committee: Michael Bea, Eric Boardman, Lee Danielson, Peter Doumani, Ben Everard, Michael Friedman, Gary Grimm, Steve Hogan, Neil Keegan, Bill Kiefer, William Macdonald, Jim McAndrews, Paul McAndrews, Marcus Morton, Joseph Nally, Dillon O'Brien, Bishop David O'Connell, Blair Pence, Ruben Rojas, Farther Roberto Rueda, Steve Tellez, Steve Trewhitt, Bill Urquhart, Bob Van Dine, Don Vinson, Michael Wayne, and Patrick Wayne. ? Unfriendly Sons History: In 2011, a few lads?from the Friendly Sons of St. Patrick, that distinguished Society of Irishmen and would-be Irishmen, decided to host a fundraiser for St. Michael?s School that was more true to their sense of what being Irish means. The event would dismiss the black tie and sophisticated ambiance of the Friendly Sons. Instead they would gather in an informal atmosphere to eat, tell stories, listen to good music and jokes, and raise a glass or two. The ringleader of these rogues was, and is, Tom Rowan. Tom?is a?member of the Board of Directors of St. Michael's School and co-chairs the Unfriendly Sons with long-time Unfriendly Son, Patrick Nally.   ? FAQ's Are there ID requirements or an age limit to enter the event? Guests must be over 21-years-old to attend this event. What is the dress code? Go casual or dress up. Some men wear polos and khakis while others wear kilts. Wear what you like... Where do I park? Parking is available in the church lot at 1016 W. Manchester, Los Angeles, CA 90044. Do I have to bring my printed ticket to the event? No, we will have your name on the Registration list. What is the refund policy? No refunds will be provided after February 26. Who can I contact if I have questions? Contact Alex at 323-752-6101."
}