{
    "addr": "8939 Sepulveda Blvd. Suite 102 Los Angeles, CA 90045", 
    "title": "Six Sigma Certification Training Course in Los Angeles, CA , United States of America", 
    "url": "http://www.eventbrite.com/e/six-sigma-certification-training-course-in-los-angeles-ca-united-states-of-america-tickets-19704827670?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-29T08:30:00-07:00", 
    "endtime": "2016-04-01T17:30:00-07:00", 
    "categories": [
        "Education", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Our Students Speak :? ? ? ? Lawrence Parkhill, ? Mission pro ? Overall Satisfaction: ?5/5 ? Feedback:? ?Tyrone is the man! ? Would you like to recommend our Training to your colleagues, teams and friends? ? Definitely Yes! ? ? ? ? Overall Satisfaction: 5/5 ? ? Would you like to recommend our Training to your colleagues, teams and friends? ? Definitely Yes! ? EZ certifications would like to present to you our upcoming 4  days Six Sigma Green Belt training  ? in: ? Location: Los Angeles, CA ??Date:? Mar 29-Apr 01 2016 This is an instructor-led classroom training program which will help you in understanding different concepts of Six Sigma Green Belt theories and how to implement these theories at your work to improve the quality and performance of your work. For your convenience, we conduct Six Sigma Green Belt Classroom Training every month!? If you can?t make this one, join us next month! Click here for our calendar of upcoming Training Sessions?because you can avail EARLY BIRD Register for Six Sigma Certification Exam Prep Boot Camp Training and get 90-day access to our PMP E-Learning / Self-paced Online Training.     About Six Sigma: Six Sigma Green Belt,  a popular business management strategy is widely used across industries   towards quality and process improvement. This program empowers the participants the required  tools and techniques to improve the quality of process outputs by identifying and removing the   causes of defects (errors) and minimizing variability in manufacturing and business processes. Benefits of Six Sigma Green Belt Certification: This certification aims to achieve the following objectives: ? Training Benefits provide by  EZ certifications: Enroll Today! ?Because Seats are limited. Looking forward to serve you better,  Kris Mohan, Training Manager? Contact Us Toll Free:1- 866- 438-0220   Email:  kris.mohan@ezcertifications.com ? Website:  www.ezcertifications.com"
}