{
    "addr": "8939 Sepulveda Blvd. Suite 102 Los Angeles, CA 90045", 
    "title": "CAPM Certification Training Course in Los Angeles, CA, United States of America", 
    "url": "http://www.eventbrite.com/e/capm-certification-training-course-in-los-angeles-ca-united-states-of-america-tickets-19705169693?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-29T08:30:00-07:00", 
    "endtime": "2016-04-01T17:30:00-07:00", 
    "categories": [
        "Career", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Our Students speak : ? Cissy Nitz, Project Manager, CISCO ? Overall Satisfaction: ?5 /5 ? Feedback: ?Training was relaxed and easy to participate. Topics were to the point so as not to fall behind schedule. There were very helpful tools used to learn and good advice given. ? Would you like to recommend our Training to your colleagues, teams and friends? ? Definitely Yes.? ? ? ? Enrique Alonso, lead ITS Technician, Transcore ? Overall Satisfaction: ?5 /5 ? Feedback: ?It was a very interesting class. I learn a lot about Project management and Professor Hans made it easier. ? Would you like to recommend our Training to your colleagues, teams and friends? ? Definitely Yes.? ? ? EZ certifications would like to present to you our upcoming  4 day CAPM Boot Camp ?  in: Location :  Los Angeles, CA Date :? Mar 29-Apr 01 2016 This is an Instructor-led Classroom Training which will help you to prepare for the CAPM examination conducted by PMI, USA. For your convenience, we conduct CAPM Classroom Training every month! If you can?t make this one, join us next month! Click here for our calendar of upcoming CAPM Training Sessions . Register for CAPM Certification Exam Prep Boot Camp Training and get 90-day access to our PMP E-Learning / Self-paced Online Training.     About CAPM: Certified Associate in Project Management (CAPM)?, is a certification provided by PMI, canad for the people who are new to the project management domain or having lesser years of experience in projects.  Whether you are new to project management, or already serving as a subject matter expert on project teams, the CAPM can get your career on the right path or take it to the next level. Training Benefits provide by  EZ certifications: Enroll Today! ? ? Looking forward to serve you better,  Kris Mohan  Marketing Manager, Direct : 1-866-438-0220 krish.mohan@ezcertifications.com  Website:  www.ezcertifications.com"
}