{
    "addr": "404 South Figueroa Street Los Angeles, CA 90071", 
    "title": "2016 Advancing Justice Conference: Empowering Asian American and Pacific Islander Communities 2016 & Beyond", 
    "url": "http://www.eventbrite.com/e/2016-advancing-justice-conference-empowering-asian-american-and-pacific-islander-communities-2016-tickets-19260965065?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-30T08:30:00-07:00", 
    "endtime": "2016-03-31T18:00:00-07:00", 
    "categories": [
        "Other", 
        "Conference"
    ], 
    "desc": "The Advancing Justice Conference brings together Asian Americans and Pacific Islanders from across the U.S. to address issues facing these fast-growing communities. It serves as a unique forum where stakeholders can learn from other community experts, discuss common challenges and opportunities, share best practices, and find ways to work collaboratively. Conference attendees participate in two days of programming, including panel discussions, caucus sessions, skill and capacity building trainings, and networking receptions. For information about Travel Stipends and Volunteering, please visit:? http://conference.advancingjustice.org/ For more information about programming at the conference, please visit:?https://advancingjustice2016conference.sched.org/ Where can I contact the organizer with any questions? For questions about the 2016 Advancing Justice Conference, please contact: conference@advancingjustice.org Is my registration/ticket transferrable? Please?contact?conference@advancingjustice.org with individual situations. Can I update my registration information? Please?contact?conference@advancingjustice.org to try to accommodate your change. What is the refund policy? We will not issue refunds for Conference registration after Tuesday February 16, 2016.  After this date, we are able to transfer your ticket to another person up until Tuesday, March 22, 2016. The name on the registration/ticket doesn't match the attendee. Is that okay? ? Each attendee must have a registration form that matches their name. If the attendee is unable to attend the conference, they are able to transfer their ticket, but must contact?conference@advancingjustice.org before? Tuesday, March 22, 2016."
}