{
    "addr": "1125 N McCadden Pl Los Angeles, CA 90038", 
    "title": "Art of Woman - Life Drawing for Women Only", 
    "url": "http://www.eventbrite.com/e/art-of-woman-life-drawing-for-women-only-tickets-19718984012?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-03T19:00:00-08:00", 
    "endtime": "2016-03-24T21:30:00-07:00", 
    "categories": [
        "Drawing \\u0026 Painting", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Do you see beauty in the curvy lines and smooth shadows of the female form? Here is an opportunity to develop your artistic abilities AND capture the beauty of the female body in this special Women?s only edition of Learning Curve?s extremely popular figure drawing class. This 4-part course, led by accomplished artist and one of Learning Curve?s most exciting new instructors, Mary Worthington, is perfect for any woman interested in developing their artistic talents. This fun and accelerated class offers the safe and welcome setting for female artists of all experience levels. First-timers will get all the basic skills necessary for developing your untapped talents. Experienced artists can further hone their skills by working with live female models and getting instructor guidance and feedback to help them continue to polish their abilities will find this course the perfect blend of education and development.? Students must provide their own drawing papers, drawing pads or sketch books, pencils, felt-tip pens, markers, crayons, pastels, charcoal, et cetera.) Advanced students may also work in paint or other types of artistic media (students using paints or similarly permanent or staining media must provide their own drop cloths and must leave their work areas clean.)? Low cost supplies may also be used including soft lead pencils and inexpensive pads of paper  (14? X 17? minimum). Instructor will assist students in preparing a list of preferred supplies for use in future class sessions. Instructor:  Mary Worthington Course Meeting Schedule: Thurs., Mar. 3, 10, 17 & 24 Course Meeting Times: 7 - 9:30 p.m."
}