{
    "addr": "1201 Vine St. Los Angeles, CA 90038", 
    "title": "The Dream Builders Project Presents the 3rd Annual \"A Brighter Future for Children\" Charity Gala", 
    "url": "http://www.eventbrite.com/e/the-dream-builders-project-presents-the-3rd-annual-a-brighter-future-for-children-charity-gala-tickets-18873297541?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-03T18:30:00-08:00", 
    "endtime": "2016-03-03T23:30:00-08:00", 
    "categories": [
        "Healthcare", 
        "Dinner or Gala"
    ], 
    "desc": "The Dream Builders Project , a Los Angeles based non profit organization, is excited to host the third annual \"A Brighter Future for Children\" Charity Gala from 6 :30pm to 11:30pm on Thursday, March 3rd , 2016 at the Taglyan Cultural Complex in Los Angeles, located at?1201 Vine St. Los Angeles, CA 90038. \"A Brighter Future for Children\" Charity Gala will feature: A Celebrity Poker Tournament A celebrity studded extended step-and-repeat red carpet? Open bar? Hors d?oeuvres and a full catered dinner Silent auction Live art exhibits & live music Surprise celebrity performance And much, much more! For information on sponsorship packages or participating in the event,  e-mail us at BrighterFuture@thedbproject.com! ? This evening of charity will directly benefit the Audrey Hepburn CARES Center at Children?s Hospital Los Angeles, which provides medical expertise to reliably identify and treat hundreds of children who fall victim to abuse and neglect each year. This year?s celebrity endorsed and hosted event promises to be bigger and better than ever before, and will provide awareness and financial aid to an incredibly worthy organization. Past celebrity hosts include? David Arquette ( Never Been Kissed),? Terrell Owens ( NFL six-time pro bowler) ,? ? Kristen Renton ( Sons of Anarchy), ? Sharna Burgess ( Dancing with the Stars),? Dorothy Wang ( Rich Kids of Beverly Hills). We look forward to sharing this night of charity with you!"
}