{
    "addr": "9801 Airport Blvd  Los Angeles, CA 90045", 
    "title": "Adult CCRN Review Presented by Laura Gasparis Vonfrolio, RN, PhD and Lee Taylor Vaughan MSN, RN", 
    "url": "http://www.eventbrite.com/e/adult-ccrn-review-presented-by-laura-gasparis-vonfrolio-rn-phd-and-lee-taylor-vaughan-msn-rn-tickets-19032654181?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-16T08:00:00-07:00", 
    "endtime": "2016-03-17T15:30:00-07:00", 
    "categories": [
        "Medical", 
        "Conference"
    ], 
    "desc": "Want to PASS the CCRN Exam? Need a great critical care review? Want to enhance your critical care knowledge base? Then? register for this two day seminar. This program will give you the boost of confidence you need! An intensive review of the Core Curriculum and the most important areas of the new AACN? Certification Examination Blueprint. CCRN REVIEW TOPICS COVERED: DAY ONE 8:00 AM ? 4:00 PM: Speaker: Laura Gasparis Vonfrolio, RN, PhD ? DAY TWO 8:00 AM ? 3:30 PM: Speaker: Lee Taylor Vaughan MSN, RN ? With Laura Gasparis Vonfrolio RN, PHD Dr. Vonfrolio RN, PhD has held CCRN & CEN Certifications for 13 years and has been a critical care nurse for over 35 years in positions of staff nurse, staff development instructor, and tenured professor of nursing. Dr. Vonfrolio has authored numerous articles on critical care and 11 books, such as Critical Care Examination Review Book 4th edition. You will laugh as you learn! ? Lee Taylor Vaughan MSN, RN, ACNP, CCRN-CSC, CEN Mr. Lee Taylor Vaughan; a native of Yorkshire England began his career in healthcare in 1995 as an ER technician before completing programs for EMT and paramedic. He obtained his BS and MS in nursing from Rutgers University and now is earning his Doctorate in Law from Kaplan University. Lee?s career has been strongly focused on Critical Care and Emergency and as an Acute Care Nurse Practitioner with a specialty in cardiothoracic surgery. He has been a successful business owner since 1997, providing continuing education and certification to nurses, physicians and a variety of medical professionals. https://www.ccrnreview.com/"
}