{
    "addr": "Los Angeles, CA", 
    "title": "Los Angeles Urban Beer Hunt -  3/19/2016", 
    "url": "http://www.eventbrite.com/e/los-angeles-urban-beer-hunt-3192016-tickets-19569606219?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Sports \\u0026 Fitness", 
        "Race or Endurance Event"
    ], 
    "desc": "LOS ANGELES URBAN BEER HUNT ? $1,000.00 CASH & BEER PRIZES ? The Urban Beer Hunt will kick off from the streets of downtown Los Angeles at 12 Noon on Saturday March 19, 2016. ?It's Part Scavenger Hunt, Part Race, 100% Crazy! Teams will set out on foot in a race covering some 3 - 5 miles. ?Each team will be texted out clues to puzzles to solve that will lead them on one crazy urban adventure race. ?Along the way, teams will encounter a few special \"beer checkpoints\" that they will need to complete before they can continue on the race. ?The entire hunt is conducted via text message. ?Teams receive clues, tasks and challenges via text. ?Once a team has completed all the crazy tasks and passed through the wildy fun Beer Checkpoints, they are then allowed to follow the clues sent out that when correctly solved, uncover the mystery location of the Urban Beer Hunt Trophy - aka- the official finish line. ?First team to complete the entire hunt and race to the finish, wins $500 in cash! ?Prizes for 2nd -10th place teams and for the best team costume as determined by audiance applause at the awards party. ? The Urban Beer Hunt is Part Scavenger Hunt - Part Race - 100% Crazy! Throw in a little beer and now we're talking fun. Each team will need to activate one cell phone per team by following the directions provided during the online registration process. During the beer hunt, teams receive a series of clues, tasks and challenges via text message. No meet up location required. ?Teams will need to review the  Event map  on the event website to determine a strategic place to start from. It's all part of the crazy fun. Each task and/or location requires a team photo. ?Teams must first complete all of the required tasks and checkpoints before they can race off to hunt down the Urban Beer Hunt Trophy. ?Staff ?will be onsite at the finish line to view team photos only until we have our top ten placing teams. I t's a race to the finish line with $1,000 in Cash and Beer up for grabs. Promising to be a crazy, wacked out adventure.  ? Grab some friends and put together some crazy costume and g et your team signed up before it's too late! ? The Urban Beer Hunt is expected to sell out quickly. ? Sorry no solo players, you must arrive with a team of at least two players. ? We recommend limiting team sizes to ten per team as larger team sizes are difficult to get everyone in the required team photos. ? First Place Team ????????? $ 500 CASH Second Place Team????? $ 100 CASH Third Place Team????????? $?? 50 CASH 4th -10 Place Teams ??? FREE BEER Best Team Costume???? $? 50 CASH Best Facebook Photo ? $? 50 CASH ? Overview:   Start/Finish: This event kicks of by text message. Refer to the  Event map ? ? ?on our website to determine a strategic location to start from. Be ready to start receiving texts at 12 ?noon. Sign In/Meet Up: None- ?The event kicks off with clues being sent via text message. ?Find a good place by reviewing the? Event map ? ?and having your team in place just before noon. ? Distance: About 5 miles or so (run or walk... just have fun!) ?Players can only travel by foot or city bus/train. ?No other transportation allowed. No Bikes, Skates, Jet Packs, just the city bus or city train. Duration: Figure about 2-3 hours, some much faster, some a bit slower. After Party/Awards: 3:30 PM?-? Food and drink specials will be available for purchase. ? What to bring: Each Team needs to pre-register one cell phone during registration to receive text messages. Instructions for activating a team cell phone are provided in your welcome email and after you purchase entry. ?Only one player per team needs to activate a phone. Each player needs to bring $5 in one dollar bills. Exact change needed please. ?Required to complete specific tasks.? A Digital Camera:? For team photos that are required at each stop. Cell phone camera works good. Internet Connected Device: ?You will need a device with internet access to google answers, or at the very least, have phone-a-friends standing by to google answers for you.? GPS or City street map: Your internet connected device works well for this. Teams are encouraged to dressing in costume: not required, but why not? Prize for best team costume too! ? Basic Rules: All teammates must be clearly shown in all photos at each stop. Teams need to review the  Event map ? ? on the event website to determine a good location to start from. It's anyone's guess where exactly to start, that's all designed to be part of the craziness. ? At noon on the day of the event, be ready to receive a lot of text messages.?? Review the ? Event map ? ?f or a suggested starting area it's all part of the crazy fun. Travel only on foot or public bus/train/tram. No bikes, bike shares, cars, skates, uber, taxi or other means of travel allowed.  To win: Teams must complete all the tasks correctly and locate the Urban Beer Hunt Trophy -aka- the finish line. ?Before locating the Trophy/crossing the finish, teams must first have completed all the required tasks, challenges and beer checkpoints. ?Staff will be onsite to verify your team photos show that everyone stuck together and that all tasks were successfully completed prior to claiming the trophy. Typically the first team does not win, they end up missing something or getting one of the tasks or photos wrong. It's always wise to double check the details in the tasks before leaving a task location. Nobody likes a cheater. If you see a team cheating, such as using a vehicle or bike, please snap a pic and provide it to the event manager BEFORE the event awards. The team will be immediately disqualified. ? Visit us online at  www.urbanbeerhunt.com ?  Click To View:? Event map"
}