{
    "addr": "Venue to be confirmed Los Angeles, CA", 
    "title": "ph360 Mastery Series Part 2 - ph360 Health Coaching Course (Los Angeles)", 
    "url": "http://www.eventbrite.com/e/ph360-mastery-series-part-2-ph360-health-coaching-course-los-angeles-tickets-18763396825?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-04-03T09:00:00-07:00", 
    "endtime": "2016-04-04T15:30:00-07:00", 
    "categories": [
        "Health \\u0026 Wellness", 
        "Class, Training, or Workshop"
    ], 
    "desc": "THE ph360 MASTERY SERIES ? ? Join fellow health seekers on a quest to live life unbound as you unlock the mystery of your genetic code and the freedom to be your best version of you. ? During the Mastery Series, you will experience interactive, practical sessions to embody the science of personalized health into every fiber of your being. You will learn health practices you can share with your family, friends or clients. ?Be prepared for fun and new skills as you take your epigenetic awareness to a whole new level.  ? There are two ways to play... ? The Mastery Series Part 1:  Personal Foundation Experience  is our introductory, experiential 2 day course to allow you to: ? Understand how Chinese Medicine, Ayurveda, epigenetics, neuroscience and endocrinology can combine into a complete system to balance your health and the people you care about. Learn why specific foods, time of day, daily activities and specific exercises can optimize your resources to provide your body with the most energy possible. Learn about the layer of ph360 Biotypes: a whole new way to relate to your world and those around you Recognize the power of epigenetics as a necessity of optimal living every day Get tips and tricks to Bio-hack your current systems to align your body, mind and spirit. Network with like minded people who will motivate, inspire and support you to take your health to the next level. Discover new ways of eating, loving, sharing your gifts and being fully grounded in YOU! ? The Mastery Series Part 2: ph360  Health Coaching Course  takes the Personal Foundation Experience and builds upon the knowledge to help transform the health of others while making an impact on the world.  ? This 2 days is scheduled after the Personal Foundation Experience in cities around the world. Join us for the full 4 days and you will: ? Learn and apply the essential practices toward becoming a ph360 Coach Deepen your knowledge and expertise in the ph360 Biotypes and Epigenetics Know how to coach family and friends, start a new coaching practice or integrate ph360 seamlessly into your current practice. Personally tailor a unique health program to the specific needs of each individual. Produce income through ph360 coaching or being a ph360 Partner or ph360 affiliate Provide accurate and sustainable results for your family, friends and clients. The Mastery Series is interactive and hands on. Come learn who you are, so that every area of your life gets a tune up and is working in perfect order. Bring your laptop, iPad or device, a soft measuring tape and be ready to have a good time getting well. Step back into your daily life with confidence that you can utilise ph360 in every day to enjoy sustainable optimal health! All applicants for ph360 Coach Certification must attend a LIVE event in person."
}