{
    "addr": "9901 South La Cienega Boulevard Los Angeles, CA 90045", 
    "title": "5D NIRVANA EVENT", 
    "url": "http://www.eventbrite.com/e/5d-nirvana-event-tickets-19007150900?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-04-07T11:00:00-07:00", 
    "endtime": "2016-04-10T23:00:00-07:00", 
    "categories": [
        "Personal health", 
        "Meeting or Networking Event"
    ], 
    "desc": "New Humanity Movement presents: ?????  ?5D NIRVANA EVENT?  ????????????????????????????????????????????????????????????????????  Speakers Bio:  http://newhumanitymovement.com/speakers.html Hotel Venue:  http://newhumanitymovement.com/id14.html WHEN:?APRIL 7TH, 8TH, 9TH & 10TH, 2016? FROM 9:00 AM TO 11:00 PM Daily VENUE: Holiday Inn Los Angeles-Intl Airport, 9901 South La Cienega Blvd., Los Angeles, CA ?  90045, USA. Cross Street Century BLVD and La Cienega only 5 minute drive from LAX airport. 5TH DIMENSIONAL EVENT THE 5D VENUE: Holiday Inn Los Angeles-Intl Airport, 9901 South La Cienega Blvd., Los Angeles, CA 90045  What Event is about:  4?days of celebration and life transformation of likeminded crowd of attendees with over 33 keynote speakers giving over 100 hours of amazing Lectures, Panels, Workshops & Exhibits in wide variety of subjects such as: Consciousness, Science, Cutting edge Technologies, Latest Health discoveries, Energy Healing, Longevity,? Free Energy, Alchemy, Spirituality, Eugenics, Disclosure, Time Travel, Secret Space, Paranormal, Metaphysics, DNA Activation,?Secrets of Pyramids, Human origins, Crop circles, Path of Enlightenment, Conscious Leadership, Conscious Commerce, Business Networking, Self-Development, Empowerment, Personal Growth, Soul cleansing, Karma cleaning, Self-Confidence, Vitality, Joy, Life Satisfaction, Evolution, Thriving, Awakening, Mastery, Meditation, Building a better future with Star Seeds, Indigo adults, Alphas, Telepath guides, Lightworkers, Star Commanders, Star visitors, Spiritual Masters and the New Humanity Movement. ??  ***MASTERS OF CEREMONIES:  ANNELISE BALFOUR,?ERIC DADMEHR & HOLLY COOK Program starts at 11:00 AM on Thursday April 7TH, 2016 (9:00 AM?other days) and ends at Sunday 11:00 PM April 10th, 2016?(Registration begins at 9 AM daily) ? Our New Humanity Movement  is about Gathering and Networking of likeminded people in order to bring new ideas, new ways of thinking and new ways of organizing our affairs to come into alignment with the accelerating transformation we see all around with creating a new future for humanity. We must ?Walk the Talk?. Our words and actions must be integrated in our lives. It reminds us of Thomas Jefferson?s concept of Moral Muscles ? that we build and strengthen our character through the daily exercise of words, actions and decisions. Integrity first means not only physical courage, but moral courage as well, so that we sometimes stand up by speaking up.  http://newhumanitymovement.com/movement.html ?***All ticket sales are final NO REFUND ***Must be 18+ to attend the event, NO kids, NO pets, NO outside food/ drinks are allowed. Event is filmed and videos are for sale at the event by 3 RD  party company. ***No other recording is allowed (only media with permission). Hotel has a nice restaurant with 15% discount on food and beverages for our attendees and there are few close by restaurants within few minutes of walking. All workshops are free with a day pass. Exhibit hall: Over 30 exhibitors  Exhibits are free for public to attend must be 18+ (9 AM to 6 PM)  Estimated?4 days attendees: 2000 people Hotel all day and overnight parking $8 (less than full day parking first hour $3 plus every hour $3)(must validate the ticket at the front desk for New Humanity Movement group discount rate) facebook:  https://www.facebook.com/NewHumanityGroup Fly to Los angeles: http://www.lufthansa.com http://www.virgin-atlantic.com Flights in USA: http://www.aa.com http://www.cheapflights.com Book your Hotel sleeping room: http://newhumanitymovement.com/id14.html Sponsor this event: http://newhumanitymovement.com/sponsor.html For more info contact us : info@ 5devents.com Event Director: David Farman All media please contact David Farman email:  david@5devents.com ????  ??  Phone: 1-310-908-6682 ? FAQs Are there ID requirements or an age limit to enter the event? YES US STATE PICTURED ID OR OVERSEAS PASSPORT What are my transport/parking options getting to the event? HOTEL NEW HUMANITY GROUP DISCOUNTED PARKING ALL DAY AND NIGHT IS ONLY $8 WITH FRONT DESK VALIDATION. What can/can't I bring to the event? KIDS, PROFESSIONAL RECORDING CAMERAS, PETS, OUTSIDE FOOD/ DRINKS,?DRUGS, GUNS Where can I contact the organizer with any questions? info@5devents.com Is my registration/ticket transferrable? Your answer goes here ?YES must be with written early?notice Do I have to bring my printed ticket to the event? Yes What is the refund policy? All ticket sales are final NO REFUND."
}