{
    "addr": "6250 Hollywood Blvd Los Angeles, CA 90028", 
    "title": "LA Games Conference 2016", 
    "url": "http://www.eventbrite.com/e/la-games-conference-2016-tickets-19299736030?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-04-19T09:00:00-07:00", 
    "endtime": "2016-04-19T18:00:00-07:00", 
    "categories": [
        "Gaming", 
        "Conference"
    ], 
    "desc": "On? April 19 , 2016, join the most influential decision-makers in the digital media industry at Digital Media Wire's ? Annual? LA Games Conference ?to network, do deals, and share ideas about the future of games and connected entertainment! Held in the iconic W Hollywood Hotel, LA Games Conference (LAGC) is a favorite among game, media and investment leaders for the high energy, focused environment for networking, meetings and deal-making. Featuring two tracks with fireside chats, roundtables, panels and presentations on digital game investment, creation, distribution, marketing and monetization, the event brings together many of the elite in the industry for top sessions and power networking. 2015 LA Games Conference Agenda: 2015 Keynote Speakers: Keynote Interview with Ted Schilowitz, VR Creator and Futurist, 20th Century Fox and CinemaVangelist, Barco Perhaps best known in Hollywood as the \"Leader of the Rebellion\" at Red Digital Cinema, ?Ted Schilowitz ?has been on the forefront of the digital revolution for years. The veteran cinema strategist and movie technology evangelist now wears two hats as resident \"Futurist\" at ?20th Century Fox ?and \"CinemaVangelist\" at ?Barco ?and is a driving force behind such projects as Fox's release of \"The Maze Runner\" in Barco Escape, an ultra?wide, multi?screen movie format that uses multiple projectors and screens to create an immersive, panoramic viewing experience. While there are only five Barco theaters in the U.S. today, clips of Maze Runner are available to worldwide audiences who can't make it to a Barco theater through Oculus and Samsung on the latest Samsung Gear VR headset. A believer in the power of virtual reality to create new and engaging entertainment experiences, Schilowitz believes this is just the beginning of the VR revolution. \"If you come to me looking for an expert, you?ve come to the wrong place,\" Schilowitz said a recent? interview ?with? The Wrap .?\"I'm an explorer. I like new things and I like breaking the rules.\" Please join us for this exclusive on?stage interview with Schilowitz at LA Games Conference on May 6. We've been told that he might even invite our audience to try out some of the early Cinema Gaming testing at a nearby theater in LA in the days following the event! Keyote Interview with Rob Pardo, Former Chief Creative Officer, Blizzard Entertainment and Lead Designer, WoW Named by? Time Magazine ? as one of the 100 most influential people in the world,? Rob Pardo ?is one of the world's most accomplished game designers and strategists. From 1997 to 2014, he held positions at? Blizzard Entertainment ?as the Chief Creative Officer, Executive Vice President of Game Design, and the lead designer of? World of Warcraft . Pardo's work had a huge impact on? Blizzard 's and? Activision 's revenues. According to a 2012 analyst estimate,? World of Warcraft ? contributed about 25% of Activision's revenues every year and about 50% of its profits (over $1 billion in annual revenue since 2008). A cultural phenomenon, with over 10 million subscribers as of November 2014, ? World of Warcraft ?is currently the world's most?subscribed MMORPG, and holds the? Guinness World Record ? for the most popular MMORPG by subscribers. With its active community, the game has given rise to toys and other licensed products, mentions on TV shows, and a feature film which is planned to be released by Universal Studios in 2016. After 17 years at Blizzard Entertainment, Chief Creative Officer Rob Pardo resigned in July. In a November? interview ?with? Fortune , Pardo commented on opportunities in mobile and digital games today stating: \"We are really entering a new golden age of game development. The barriers between a game designer and the player have dropped to practically zero. Much like the early days of game development, you are once again able to create a game with a very small team and distribute it directly to players. This allows for a much greater diversity of game ideas and content.\" Please join us for this exclusive on?stage interview with Pardo at LA Games Conference on May 6. 2015 Confirmed LA Games Speakers Included: Mark Allenbach, Vice President, Frank N. Magid Associates? Jonathan Anastas, VP, Global Brand Marketing, Head of Digital & Social Marketing, Activision Raquel Basso, Head of Mobile UA Strategy, EA? Gordon Bellamy, Visiting Scholar, USC? Shanti Bergel, SVP of Business & Corporate Development, GREE? Bjorn Book-Larsson, CEO, Reloaded Games? Susan Borst, Director of Industry Initiatives, IAB? Dan Brody, VP Business Development, Tencent? Scott Broock, VP of Content, Jaunt? Nathan Burba, Co-Founder & CEO, Survios? Josh Burns, Mobile & Game Industry Consultant, Independent? David Brevik, CEO, Gazillion Entertainment? Michael Cai, SVP of Research, Games & Digital, Interpret, LLC? Liam Callahan, Director, Games Industry Analyst, The NPD Group, Inc.? Steve Carlin, Game Executive, Formerly at Ubisoft? David S. Cohen, Senior Editor, Features, Variety? Susan Cummings, Executive Producer & Founder, Tiny Rebel Games, LLC? Paul Cutsinger, Chief Evangelist, Amazon Appstore, Amazon? Niccolo de Masi, CEO, Glu Mobile Paresh Dave, Technology Reporter, LA Times Rob Dyer, SVP Global Developer Relations, Tapjoy? Blair Ethington, SVP of Marketing & Brands, Crowdstar? Clinton Foy, Managing Director & General Partner, CrossCut Ventures? Eric Goldberg, Managing Director, Crossover Technologies? Rich Greenhill, General Manager, Casual Games, DEFY Media? Hank Howie, COO, Disruptor Beam? John Hwang, VP of Product, ZQGame? Chris Jacquemin, Head of Digital, WME Entertainment? Jameel Khalfan, Head of Business Development & IP, Pocket Gems? Koh Kim, Business Development, Google Play Games, Google? Bill Kispert, EVP WW Digital Platforms, Universal Partnerships & Licensing, Universal Pictures Andy Kleinman, Founder & CEO, MobLabs? Stanley Kwon, VP, Strategy & Operations, Games, CBS Interactive? Christina Lee, Associate Director, Nexon America? Peter Levin, President Interactive Ventures & Games, Lionsgate? Joao Machado, Mobile Director, OMD? Alejandro Manchado, U.S. Games Partnerships Lead, Google? Damon Marshall, Vice President, Business Development, Supersonic? Jean Mathews, Founder, iMAGINATE? Pete Mauro, Producer, Global Innovation and App Development, Microsoft? Dominique McAree, Director West Coast, Brand Solutions, Electronic Arts? Keith McCurdy, CEO & Co-Founder, Golden Gate Games? Luis Medina, VP, Programming, Maker Studios? Dan Murray, President, Skybound Interactive? Kym Nelson, SVP Sales, Twitch? Michael Pachter, Managing Director, Equity Research, Wedbush Securities? Rob Pardo, Game Designer, Former CCO of Blizzard Entertainment? Matthew Patrick, Creator, The Game Theorists/New Media Strategist, Theorist Inc.? Todd Peterson, Founder & CEO, AlphaDraft? Phil Ranta, COO, Collective Digital Studio? Nanea Reeves, President & COO, TextPlus, Inc.? Donald Reilley, EVP, Global Ad Sales and Operations, Major League Gaming? Ted Schilowitz, VR Creator and Futurist, 20th Century Fox/CinemaVangelist, Barco? Jamison Selby, Vice President of Games, b spot? Mikko Setala, Chairman, Setala Capital and Pro-Source/EVP, Rovio Entertainment? Randy Shaffer, West & Central Region Sales Director, Xbox Advertising, Microsoft? Ian Sharpe, CEO, Azubu? Ned Sherman, CEO, Digital Media Wire? David Siemer, Managing Director, Siemer and Associates, LLC? Jesse Sisgold, COO, Skydance Productions? Andrew Stalbow, CEO, Seriously? Joost van Dreunen, Co-Founder & CEO, SuperData Research? Jonathan Walsh, CEO, Fuse Powered? Benjamin Webley, VP, Ad Monetization & Business Operations, Zynga? John Welch, President & CEO, Making Fun, Inc.? Dmitri Williams, CEO and Co-Founder, Ninja Metrics? Jason Xu, CEO, Battlefy? Josh Yguado, President & COO, SGN? Michael Zhang, Founder & CEO, Firefly Games Inc. Sponsorships and Exhibition Tables For any questions regarding sponsorships or exhibition tables, please e-mail Tinzar at? tinzar@digitalmediawire.com . 2015 Sponsors and Media Partners ?Speaker submissions for 2016 are now open :? http://www.dmwmedia.com/submit-speaker -- REFUND POLICY Refunds are subject to a $100 processing fee, which will be subtracted from your refund total.? We must receive your written request for a refund by? March 1, 2015 .? Cancellations received after March? 1, 2015 ?are non-refundable. You may transfer your registration to another person by? March 30, 2015 .? Please provide written authorization to? info@digitalmediawire.com . Confirmed and paid attendees who do not attend or who cancel after the deadline are liable for the entire fee."
}