{
    "addr": "Los Angeles, CA", 
    "title": "The Leadership Challenge® Facilitator Training - Los Angeles", 
    "url": "http://www.eventbrite.com/e/the-leadership-challenge-facilitator-training-los-angeles-tickets-19711835631?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-04-14T08:00:00-07:00", 
    "endtime": "2016-04-15T15:30:00-07:00", 
    "categories": [
        "Class, Training, or Workshop"
    ], 
    "desc": "What you will experience The Leadership Challenge?  is an evidence-based leadership development model that is backed by over 28 years of rigorous research by Jim Kouzes and Barry Posner. Since 1982, Kouzes and Posner have continued to conduct hundreds of interviews and case studies to understand the times when people perform at their personal bests. Intensive research and analysis have revealed that five fundamental practices were present during extraordinary leadership achievements. Today, these behaviors are known as The Five Practices of Exemplary Leadership?. This approach is now the world?s most practical model for leadership development.? ? Model the Way Leaders establish principles concerning the way people should be treated and the way goals should be pursued. They create standards of excellence and then set an example for others to follow. They unravel bureaucracy when it impedes action; they put up signposts when people are unsure of where to go or how to get there; and they create opportunities for victory. Inspire a Shared Vision Leaders passionately believe that they can make a difference. They envision the future, creating an ideal and unique image of what the organization can become. Through their magnetism and quiet persuasion, leaders enlist others in their dreams. They breathe life into their visions and get people to see exciting possibilities for the future. Challenge the Process Leaders search for opportunities to change the status quo. They look for innovative ways to improve the organization. In doing so, they experiment and take risks. And because leaders know that risk taking involves mistakes and failures, they accept the inevitable disappointments as learning opportunities. Enable Others to Act Leaders foster collaboration and build spirited teams. They actively involve others. Leaders understand that mutual respect is what sustains extraordinary efforts; they strive to create an atmosphere of trust and human dignity. They strengthen others, making each person feel capable and powerful. Encourage the Heart Accomplishing extraordinary things in organizations is hard work. To keep hope and determination alive, leaders recognize contributions that individuals make. In every winning team, the members need to share in the rewards of their efforts, so leaders celebrate accomplishments. They make people feel like heroes. Cancellations made more than 30 days before of the event will be subject to a 25% cancellation fee.? Cancellations made 30 to 10 days before of the event will be subject to a 50% cancellation fee. Cancellations within 10 days of the event will not be refunded.? Registration fees do not include overnight accommodations and transportation. For more information, please email  TLC@IntegrisPA.com ."
}