{
    "addr": "900 East 1st Street.  #106. Los Angeles, CA 90012", 
    "title": "BIM Launch! Los Angeles | Intensive Training Courses on Vectorworks 2016 Software", 
    "url": "http://www.eventbrite.com/e/bim-launch-los-angeles-intensive-training-courses-on-vectorworks-2016-software-tickets-19699440557?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-05-02T09:00:00-07:00", 
    "endtime": "2016-05-05T18:00:00-07:00", 
    "categories": [
        "Design", 
        "Class, Training, or Workshop"
    ], 
    "desc": "9AM-6PM Monday, May 2, 2016   Prepare your workflow for a new frontier in Information Modeling. This hands-on training session starts from the ground up. Build a foundation of 2D and 3D modeling skill that you can apply to a successful mission on your next design project. Learn to draw fast and stay accurate in a modern BIM production environment. IMPORTANT INFORMATION REGARDING THESE COURSES: Please Remember: ?Tangably.com is not affiliated with Vectorworks. \"Vectorworks\", \"Vectorworks 2016\", \"Spotlight\", and \"Landmark\" are registered trademarks of? Nemetschek AG . 9 AM-6PM on? Tuesday, May 3 - Wednesday May 4, 2016?   Now that you understand the basics, get to know the advanced tools you will need to complete a successful design mission with Information Modeling. Learn about Layer and Class organization. Advance your skills from quickly representing an idea graphically to creating parametric information models of your design. Understand how to quickly respond to requests for information throughout the design process and keep all parties informed.   Step forward into the many possibilities of 2D/3D design workflow, and Project Sharing,. Incorporate and information modeling and refine Level of Detail in each phase as you approach your design destination. Prerequisite-  To attend the Countdown to Liftoff course you must have completed the Base Camp course offered by Tangably within the previous year or have completed the comparable ?Core Concepts? course offered by Vectorworks. This two-day intensive course covers a large volume of information and high-level organization concepts. The foundation of knowledge the Base Camp course offers is imperative to successful implementation of concepts presented in the Countdown to Liftoff course. IMPORTANT INFORMATION REGARDING THESE COURSES: Please Remember: ?Tangably.com is not affiliated with Vectorworks. \"Vectorworks\", \"Vectorworks 2016\", \"Spotlight\", and \"Landmark\" are registered trademarks of? Nemetschek AG . 9 AM-6PM on Thursday ?May 5, 2015   Event Industry specific tools to streamline your production workflow. Explore the workflow of creating a small corporate event with the Spotlight workspace. Topics Include: ? Prerequisites to attend this course: IMPORTANT INFORMATION REGARDING THESE COURSES: Please Remember: ?Tangably.com is not affiliated with Vectorworks. \"Vectorworks\", \"Vectorworks 2016\", \"Spotlight\", and \"Landmark\" are registered trademarks of? Nemetschek AG . Jacob Dale is a Vectorworks Expert & Trainer at Tangably. He began using Vectorworks software in 2001 as a Theatrical & Event Designer at Texas State University, where he earned a Bachelor of Fine Arts Degree. Jacob has 15 years of collective experience in architecture, interiors, construction administration, real estate development, & event production culminating in a Masters of Architecture Degree from the University of Texas. His work has included projects for: SiriusXM Satellite Radio, CNN, Time Warner, Manhattan Neighborhood Network, The Brooklyn Tabernacle, Lawline Studios, The San Antonio Zoo, Bob Dylan, R.E.M., and The Wallflowers. Jacob has continually advanced his use of Vectorworks software since 2001, as the title has grown in capability. He has completed all formal training offered by Vectorworks. Jacob has also been professionally trained in other drafting and modeling titles including; Revit, Rhino, Grasshopper, Sketchup, and AutoCAD. Most recently, Jacob has represented the New York City Vectorworks User Group and has been a repeat guest presenter at the Northern California Vectorworks User Group. In addition, Jacob Dale provides customized, on-site team training for firms that use Vectorworks software. Tangably was established in 2015 to help creative studios, large and small, maximize their use of design software to create better performance and profit. Our clients include designers and technicians in: Architecture, Construction, Event Production, and Product Design. The contemporary workflow for these professionals exists mainly in a digital sphere while in pursuit of creating products and services to exist in the physical world. Our slogan ?Sharpen your tools.? expresses our desire to increase our clients depth of skill and aptitude with design software, so they may do great work with less resistance. President Abe Lincoln is often quoted as saying, ?Give me six hours to chop down a tree and I will spend the first four sharpening the axe.? We invite you to join us at the next convenient workshop offering to Sharpen your tools. Please Remember: ?Tangably.com is not affiliated with Vectorworks. \"Vectorworks\", \"Vectorworks 2016\", \"Spotlight\", and \"Landmark\" are registered trademarks of? Nemetschek AG ."
}