{
    "addr": "1700 Ocean Avenue Los Angeles, CA", 
    "title": "DIGIMARCON WEST 2016 - Digital Marketing Conference", 
    "url": "http://www.eventbrite.com/e/digimarcon-west-2016-digital-marketing-conference-registration-18545837098?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-06-15T09:00:00-07:00", 
    "endtime": "2016-06-16T17:30:00-07:00", 
    "categories": [
        "Sales \\u0026 Marketing", 
        "Conference"
    ], 
    "desc": "DIGIMARCON WEST 2016 Digital Marketing Conference will be held from June 15th to 16th, 2016 at the luxurious Loews Santa Monica Beach Hotel, Santa Monica, CA. DIGIMARCON WEST 2016 Conference showcases the most audacious and thought provoking speakers in the digital marketing industry, providing attendees with emerging strategies, the latest innovative technologies, best practices, and insights from successful digital marketing campaigns. Whether it?s building customer loyalty, increasing sales, improving lead generation, or driving greater consumer engagement, the DIGIMARCON WEST 2016 program has been specifically designed to help attendees develop their audience. Attendees will learn how to build traffic, create brand awareness, improve customer service and develop better use of digital tools internally to drive more productive business outcomes. Immerse yourself in topics such as  Content Strategy, Web Experience Management, Usability/Design, Mobile Marketing, Customer Engagement, Social Media, Targeting & Optimization, Branded Search, Marketing Automation, Analytics & Data  and much, much more! DIGIMARCON WEST 2016 offers all of the elements you need to achieve digital marketing success! Awesome keynotes, expert panels, plus solutions providers and their tools for digital marketing ? all in a dynamic, community-based setting. Conventional thought will be challenged, new ways of thinking will emerge, and you will leave with your head and notebook full of action items and ideas to lead your agency / team / account to even greater success. With plenty of networking opportunities, it is the perfect place to build a professional network, find business partners, generate new ideas, and learn. Registration is limited to ensure attendees get the full benefit of this exclusive Conference. Come to DIGIMARCON WEST 2016 and discover how to thrive as a marketer in a world where everything is digital. Take advantage of our super saver registration rates and secure your seat early. Enjoy laid-back luxury and contemporary comfort at Loews Santa Monica Beach Hotel. Southern California provides the sunny beachfront setting and sensational ocean views of the Pacific Ocean and the iconic Santa Monica Beach Pier. Loews Santa Monica Beach Hotel is a premier conference center venue where DIGIMARCON WEST 2016 will be held. All Master Classes and General Sessions for DIGIMARCON WEST 2016 will be held in the Arcadia Ballroom on the Fifth Floor. Here is a general overview of the conference schedule and offerings. See full agenda link below for a more detailed schedule of the day including different tracks, times and speakers. (note: all times are Pacific Daylight Time) Come for two high-impact days of DIGIMARCON WEST 2016, from June 15th to 16th, 2016. Meet the ?who?s who? in the Digital Marketing Community, gain new insights and share ideas with fellow web business pros. Whether you?re just getting started or you?re a digital marketing expert, DIGIMARCON WEST 2016 will give you the latest strategies and information to increase your own knowledge and grow your business through digital marketing. Check out some of the killer line-up of presentations and speakers below. They?ll get you excited and leave you wishing it was June already! Please Note: 2016 ?Keynote Speakers have not been announced. Below are Speakers from 2015. DIGIMARCON WEST 2016 is offering three limited-attendance Master Classes on Wednesday, June 15th at different times allowing attendees to attend them all. Master Classes are 2 hours duration with Networking time before and after and are only available to conference attendees. All Master Classes are included in the VIP and All Access Pass. For Main Conference Pass holders Master Class fees are 195 (USD) each. Master Classes provide the practices, applications, and hands-on exposure you need to become (and remain!) a top performer in your field. Whether you are a consultant, site designer, website owner, or in-house marketing professional, this is an opportunity to experience firsthand the latest developments in digital marketing. Regardless of your experience level, you will leave these intensive master classes with skills to improve your online business results.? Please Note: 2016 ?Master Classes have not been announced. Below are Master Class Facilitators ?from 2015. Master Class Facilitator: Steve Robinson, Advisory Board Member, Institute of IBusiness Master Class Facilitator: Luke Summerfield, Partner Services, Program Manager, HubSpot Master Class Facilitator: Mark Schaefer, Executive Director, Schaefer Marketing Solutions VIP Pass includes: All Access Pass includes: Main Conference Pass The DIGIMARCON WEST 2016 Pass does NOT include: You can add these options during the registration process. All DIGIMARCON WEST 2016 passes provide valuable educational and networking experiences. See what you can attend in the table below. All rates in United States Dollars (USD). Don?t Miss the Digital Marketing Event of the Year!  DIGIMARCON WEST 2016 Conference will sell out, so register early!"
}