{
    "addr": "800 OLympic Blvd. Los Angeles, CA 90015", 
    "title": "Group Vacation To L.A. during \"BET EXPERIENCE/BET AWARDS VACATION PACKAGES\"", 
    "url": "http://www.eventbrite.com/e/group-vacation-to-la-during-bet-experiencebet-awards-vacation-packages-tickets-18481196757?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-06-22T15:00:00-07:00", 
    "endtime": "2016-06-27T12:00:00-07:00", 
    "categories": [
        "Travel", 
        "Concert or Performance"
    ], 
    "desc": "JSJ Prolific Travels Presents To You: A Group Travel Experience To: ? Los Angeles, California during the BET Experience/Awards Show? Hotel Vacation Packages June 22 - 27, 2016 ? AT THE \"OMNI HOTELS & RESORTS\" BET EXPERIENCE Hotel PACKAGE INCLUDES: 6 Days/5 Night at The Omni Hotel & Resorts Celebrity Basketball Game Grammy Museum One Night Concert at the Staples Center/Club Nokia One Night Club Fun Party Pass Giveaway party Bag Travel Professional On-site ? BET EXPERIENCE Hotel PACKAGE PRICE-PER PERSON Single Occupancy - $1665.00 Double Occupancy - $921.00 Triple Occupancy - $685.00 Quad Occupancy - $585.00 All Taxes Fee ? BET FAN FEAST Hotel PACKAGE INCLUDES 6 Days/5 Night at The Omni Hotel & Resorts One Night Concert at the Staples Center/Club Nokia Grammy Museum Giveaway party Bag Travel Professional On-site ? BET FAN FEAST Hotel PACKAGE PRICE-PER PERSON Single Occupancy - $1637.00 Double Occupancy - $ 905..00 Triple Occupancy - $ 660.00 Quad Occupancy - $ 565.00 All Taxes Fee ? BET LIVE? Hotel PACKAGE INCLUDES 6 Days/5 Nights at The Omni Hotel & Resorts One Night Club Fun Pass Travel Professional On-site ? BET LIVE Hotel PACKAGE PRICE-PER PERSON Single Occupancy - $1560.00 Double Occupancy - $825.00 Triple Occupancy - $580.00 Quad Occupancy - $485.00 All Taxes Fee ? BET Omni Hotel & Resort Room Only PER-PERSON 6 Days/ 5 Nights at The Omni Hotel & Resorts Travel Specialist on-site All Taxes Fee TOTAL PRICE? -? $1530.00 ? ?BRING A FRIEND? - Everyone can use some extra cash, vacation spending Gift Card of $150 Guarantee Incentive, door prize drawing to everyone who brings a friend. Every friend you bring your name will be enter into a drawing. Prizes will be given day of Vacation. \"BOOKING Hotel Packages Contact\" JSJ PROLIFIC TRAVELS Order Hotel Packages Here jsjprolific@gmail.com ? BET VIP PACKAGES (Optional) Deposits are now being accepted for BET Experience 2016 In addition to VIP Status amenities throughout the BET Experience weekend, three levels of BETX VIP Packages offer guests the? only ?opportunity to purchase tickets to the highly anticipated BET Awards, broadcast live from Microsoft Theater. In anticipation of another stellar lineup announcement for the, 2016 BET Experience weekend, guests interested in VIP Status for 2016 can place a deposit to secure their spots early and guarantee priority? http://www.bet.com/bet-experience/2015/tickets/vip-ticket-package-deposit.html?cid=vipgold ?Seating at all Staples Center Shows and the BET Awards.? Non-Refundable deposits are available for the following BET Experience VIP Packages.? VIP Status details and pricing will be released in the months, but to reference elements of the 2015 Package.? Please visit? http://www.bet.com/bet-experience/2015/tickets/vip.html ? BET VIP PACKAGE (Optional) GOLD PACKAGE DEPOSIT $100.00 VIP PLATINUM? DEPOSIT $200.00 VIP DIAMOND DEPOSIT $500.00 ? Contact Information for BET VIP PASS For the Award Show \"ONLY\"...This is Only if you wish to buy a VIP PASS FOR THE AWARD SHOW \"OPTIONAL\" MENTION FOR SHANEA MATTHEWS GROUP WHEN CONTACTING Aaron Kaniecki AEG - MANGER OF SALES P. 213-742-7230 F. 213-742-7280 akaniecki@aegworldwide.com ? JSJ Prolific Travels is not affiliated with the BET Awards, BET LIVE, BET Experience or Staples Center.? We are a travel agency that specializes in group events, we want you to experience LOS ANGELES for a Fun, Music, Shopping, and CELEBRITY experience, AS WELL AS THE BET Experience/ Award event DURING THESE DATES you will be visiting sunny California . ?\"Our purpose is to get you there\". For your group, team, organization or just your individual self... ? Deposits and Payment Plan Option (PER PERSON) For PACKAGE S Deposit:? $ 150.00 due per person at the time of booking Monthly Payment of $100.00 or more per person due on OR? before 09/20/15 Monthly Payment of $100.00 or more per person due on or before 10/20/15 Monthly Payment of $100.00 or more per person due on or before? 11/20/15 Monthly Payment of $100.00 or more per person due on or before 12/20/15 Monthly Payment of $100.00 or more per person due on or before 01/20/16 Monthly Payment of $100.00 or more per person due on or before 02/20/16 Monthly Payment of $100.00 or more per person due on or before 03/20/16 Monthly Payment of $100.00 or more per person due on or before 04/20/16 Monthly Payment of $100.00 or more per person due on or before 05/20/16 Final Payment due on or before 05/20/16 **You can start making payments at any point these are just opitional dates***? ? All payments are non-refundable and non-transferrable. Rates are not guaranteed until deposit is made. Please register in your government-issued photo ID name. If you select? Double ,? Triple , or? Quad ?Occupancy as your package, each member of your group has to pay their deposit within? 5 days ?of booking.? If not your package price will be based on the number of people paid at that time.? (No Exceptions) Airfare is not included in any of the packages. However, you can book at? http://jsjprolifictravels.mtravel.com/ ? for flights to Los Angeles, CA (LAX Airport Code). Also, for groups of 10 or more traveling on the same itinerary. we are able to secure air travel with a minimal deposit.? Please email us about more information on Group Air,? jsjprolific@gmail.com. ?Also any additional activities you are planning to explore, we are here to help you in planning everything you need during your stay in L.A. Event is capacity-controlled and may sell out quickly. It?s important that you stay within the payment deadlines.? Not paying on time could result in a late fee and/or your reservation being cancelled and forfeiture of all funds paid towards the reservation. All late payments will incur a $25 late fee per person after the due date.?? (No Exceptions) Accommodations and events are subject to change at the vendor discretion at any time. The Hotel will require you to present a valid photo ID, credit or debit card at check-in.? The card is required for any mandatory fee as well as any additional hotel incidental charges. We do not sell concert tickets only or tickets to the BET Awards.? These tickets can be purchased through the vendor? http://www.bet.com/bet-experience.html Please Note:? All payments are assessed a service fee from Montrose Travel, Eventbrite & PayPal, these charges does not decrease your trip balance. Please read JSJ Prolific Travels Terms and Policies here: http://jsjprolifictravels.mtravel.com/privacy-policy ? Other Perks and places to sightsee L.A. Live Fan Feast Genius Talk Celebrity Basketball L.A. Fashion District Hollywood & Highland Rodeo Drive ? Have questions about 2016 BET EXPERIENCE?? Contact JSJ PROLIFIC TRAVELS.? We are here to service your vacation needs, so you can relax, we will take care of you.. Psalm 128:2 you will eat the fruit of your labor; blessings and prrosperity will be yours. ? FYI: Helpful Budget Tips Cost per per ?/ ? ?Cost per month ? ?/ Cost per week $1660................$184............................$46 $916..................$102...........................$25.50 $680...................$76............................$19 $580...................$65............................$16.25 $1632.................$182..........................$45.50 $900...................$100..........................$25 $655....................$73...........................$18.25 $560....................$62...........................$15.50"
}