{
    "addr": "10050 Constellation Boulevard Los Angeles, CA 90067", 
    "title": "Photographing the Cosmos: A Discussion on Astrophotography", 
    "url": "http://www.eventbrite.com/e/photographing-the-cosmos-a-discussion-on-astrophotography-tickets-18895112791?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-12T17:00:00-08:00", 
    "endtime": "2015-12-12T19:00:00-08:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Join us as we turn our attention to the sky and beyond with a moderated panel discussion on astrophotography's past, present and future. Featured panelists include Director of Crew Operators at SpaceX and former NASA astronaut? Garrett Reisman , NASA?s Imagery Acquisition Supervisor? Mark Sowa ?and Caltech?s Infrared Processing and Analysis Center astronomer and visualization scientist? Robert Hurt . The panel discussion will be moderated by? Los Angeles Times? science writer? Amina Khan . Featured Panelists Photographer? Mark Sowa ?is the supervisor of NASA?s Imagery Acquisition Group at the Lyndon B. Johnson Space Center. He?has photographed 45 crew portraits, countless individual astronaut portraits, documented engineering and astronaut training aboard NASA's reduced?gravity aircraft, and dived over 1,300 times while photographing suited extravehicular training underwater in NASA's Water Environment Training Facility and later in NASA's Neutral Buoyancy Training Facility. He has logged many hours flying aboard NASA's reduced gravity aircraft. Robert Hurt ?received his Ph.D in astrophysics from UCLA in 1993 pursuing research interests in star formation in the Milky Way and other galaxies. After several post-doctoral and staff scientist positions, in 2002 he became the visualization scientist on NASA?s Spitzer Space Telescope, the infrared light analog to the Hubble. Here he combines his interests in astronomy, photography, digital graphics and education to tackle the visual elements of science communication and outreach. He has created the public data-based imagery of a number of NASA missions including Spitzer, WISE, GALEX and NuSTAR. He has also led the astronomy visualization community?s efforts to develop and implement metadata standards for public imagery. Dr. Garrett Reisman ?was selected by NASA as a mission specialist astronaut in 1998. His first mission was aboard the Space Shuttle Endeavour, which dropped him off for a 95 day mission aboard the International Space Station, and after which he returned to Earth aboard the Space Shuttle Discovery. His second mission was aboard the Space Shuttle Atlantis, which returned Reisman to the Space Station. During these missions, Reisman performed three spacewalks, operated the Space Station Robot Arm and was a flight engineer aboard the Space Shuttle. Moderator Amina Khan? is a science writer for the  Los Angeles Times ?covering a broad range of topics, from Mars rovers to linguistics to bio-inspired engineering. Pre-sale ticketing ends on December 11 at 11:30pm at Skylight Studios. Tickets also for sale at the door pending availability. All ticket sales are final. No refunds, exchanges or returns are permitted."
}