{
    "addr": "L.A. Live Way Los Angeles, CA 90015", 
    "title": "2016 BET EXPERIENCE", 
    "url": "http://www.eventbrite.com/e/2016-bet-experience-tickets-18983999654?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-06-24T12:00:00-07:00", 
    "endtime": "2016-06-27T12:00:00-07:00", 
    "categories": [
        "Travel", 
        "Concert or Performance"
    ], 
    "desc": "BET EXPERIENCE / BET AWARDS JUNE 24-26, 2016 LOS ANGELES, CA The BET Awards celebrates African Americans and other minorities in music, acting, sports, and other fields of entertainment over the past year. The annual award show features performances by artists, and some of the awards of more popular interest are presented in a televised ceremony. The BET Awards also takes over L.A. LIVE for an electrifying three days and nights of music and entertainment in L.A.? In addition to concerts, comedy shows and home of the BET Awards, the BET Experience 3-day weekend will feature BET Fan Fest, Celebrity Basketball, seminars, various social events and celebrity appearances. BET Experience will climax with the BET Awards broadcasting live from Nokia Theatre L.A. Live, June 26, 2016. ? ? BET EXPERIENCE PACKAGE INCLUDES 4 Days/3 Nights at The L.A. Hotel Downtown One Night Concert at the Staples Center One Night Party Pass Meet & Greet Mixer Gift Bag Travel Professional On-site All Taxes & Fees  ? BET EXPERIENCE PACKAGE PRICE ? PER PERSON Single Occupancy - $1,125.00 Double Occupancy - $775.00 Triple Occupancy - $665.00 Quad Occupancy - $595.00 ? BET LIVE PACKAGE INCLUDES ? 4 Days/3 Nights at The L.A. Hotel Downtown One Night Concert at the Staples Center Meet & Greet Mixer Gift Bag Travel Professional On-site ? All Taxes & Fees ? BET LIVE PACKAGE PRICE ? PER PERSON Single Occupancy - $1,050.00 Double Occupancy - $675.00 Triple Occupancy - $545.00 ? Quad Occupancy - $495.00 B.E.T. HOTEL ROOM ONLY PACKAGE INCLUDES 4 Days/3 Nights at The L.A. Hotel Downtown Gift Bag Travel Professional On-site All Taxes & Fees ? BET ROOM ONLY PRICE ? PER PERSON ? Single Occupancy - $800.00 Double Occupancy - $425.00 Triple Occupancy - $310.00 Quad Occupancy - $250.00 ? BET EXPERIENCE VIP TICKET PACKAGE ? DEPOSIT PER PERSON (Place your deposit for the BET Experience VIP Packages. Get priority access for the best seats at Staples Center and Guarantee your spot before the VIP packages sell out.) VIP Gold - $100 VIP Platinum - $200 VIP Diamond - $500 Please Note: Star Class Travel does not have the total price for the 2016 BET Experience VIP Packages.  Details will be available soon along with multiple payment plan options. DEPOSIT AND PAYMENT PLAN OPTION (PER PERSON) ? ?  Deposit $100.00 due per person at the time of booking ? ?  Monthly payment of $100 or more per person due on or before 11/20/2015 ? ?  Monthly payment of $100 or more per person due on or before 1/20/2016 ? ?  Monthly payment $100 or more per person due on or before 3/20/2016 ? ?  Final Payment due on or before 5/20/2016 (No Exceptions) ? ? ? STAR CLASS TRAVEL POLICIES & GENERAL INFORMATION ? ?  All payments are non-refundable and non-transferrable. ? ?  Please register in your Full Legal Name as it appears on your government issued identification. ? ?  Rates are not guaranteed until a deposit is received. ? ?  The initial deposit per guest(s) will hold your room at the quoted rate. ? ?  Room rates are based on the total occupancy. ? ?  If Double, Triple or Quad Occupancy is selected as your package, each guests must pay their initial deposit within 5 days of the first initial room deposit made. ? ?  Please adhere to the Monthly Payment Schedule. ? ?  Monthly payments must be made to secure your reservation. ? ?  It?s important that you stay within the monthly payment deadlines. Star Class Travel does no send out monthly notifications before due dates. You are responsible for making monthly payment on time. ? ?  All guest(s) on the reservation must be up-to-date with payments. ? ?  Payments received after due dates will incur a $25 late fee per person. ? ?  Any late fees applied to your reservation do not go towards or decrease your reservation balance. ? ?  Please notify Star Class Travel of a missed payment or cancellation in writing. If no contact is made within 10 days of a missed payment Star Class Travel will assume you have cancelled your reservation. ? ?  If cancellation occurs and the occupancy of the room falls below the initial occupancy, payments must be paid to satisfy the adjusted room rate.? Any new guest added to reservation will have to make all scheduled payments up-to-date. ? ?  The Hotel will require you to present a valid photo ID, credit or debit card at check-in. The card is required for any mandatory fee as well as any additional hotel incidental charges such as parking, phone calls or minibar charges which are not included in the room rate. ? ?  No name changes after 05/01/2016. ? ?  Room assignment is at the Hotel discretion ? ?  Accommodations and events are subject to change at the Hotel or Vendor discretion at any time. ? ?  We not sell tickets only to the BET Awards Show or Staple Center. Tickets can be purchased through the vendor at  http://www.bet.com/bet-experience.html . ? ?  2016 BET Experience VIP Packages deposits are non-refundable.? Your deposit will be applied as the initial payment for your package(s).? Details will be available soon along with multiple payment plan options. Deposit holders will have priority access for seats at STAPLES Center shows. Check out what was included in the 2015 VIP Packages here:  http://www.bet.com/bet-experience/2015/tickets/vip.html .? This link is for reference only. 2016 amenities will differ. ? ?  Event is capacity-controlled and may sell out quickly. ? ?  Airfare is not included.? ? ?  Airfare is not included in any of the packages. Each guest is responsible for their own flight to Los Angeles, CA (LAX Airport Code). However, for groups of 10 or more traveling on the same itinerary, we are able to secure air travel with a minimal deposit. Please email us about more information on Group Air. ? ?  Meals are not included. ? ?  Travel Insurance is not included but we strongly recommend you protect your investment. Each guest is responsible for purchasing their own Travel Insurance. ? ?  Please Note: All payments are assessed a service fee from Eventbrite & PayPal, these charges does not decrease your reservation balance. ? ?  Please read Star Class Travel Terms and Policies here:? http://www.starclasstravel.com/#!/c3r5 ? Star Class Travel is not affiliated with the BET Awards, BET Live, BET Experience or Staples Center. We are a travel agency that specializes in getting you to LA for the Experience."
}