{
    "addr": "1262 Westwood Blvd. Los Angeles, CA , CA 90024", 
    "title": "An Evening with Dita Von Teese and Friends", 
    "url": "http://www.eventbrite.com/e/an-evening-with-dita-von-teese-and-friends-tickets-19640032867?aff=ebrowse", 
    "location": "Los Angeles, CA , CA", 
    "starttime": "2015-12-09T20:00:00-08:00", 
    "endtime": "2015-12-09T21:30:00-08:00", 
    "categories": [
        "Fashion", 
        "Seminar or Talk"
    ], 
    "desc": "Wednesday, December 9, 2015 8:00pm (Reception, 6:30-7:30pm) An Evening with?Dita Von Teese?and Friends Your Beauty Mark: The Ultimate Guide to Eccentric Glamour Crest Theatre, Westwood 1262 Westwood Blvd, Los Angeles, CA 90024 PURCHASE TICKETS?  $55 Reserved Section Seat + Book*  $20 General?Section Seat  $80?Two guests, 1 book, Reserved Section Seats   $95?Pre-Reception(6:30-7:30pm)*+ Reserved Section seating + Book   * Books will be picked up at the event when you check in, and signed immediately after the talk   Books will be available for purchase at the event ($45 plus tax) From burlesque show to fashion runway, magazine cover to Internet video, style icon and \"burlesque superheroine\" ( Vanity Fair )  Dita Von Teese  has undergone more strokes of red lipstick, bursts of hair spray, boxes of blue-black hair dye, and pats of powder in a month than a drag queen could dream of in a lifetime. Whether she's dazzling audiences while swirling in a towering martini glass in Swarovski-crystal-covered pasties and stilettos or sparking camera flashes on the red carpet, one reality is constant: for this self-styled star, beauty is an art.  (From the book jacket) In celebration of the launch of  Your Beauty Mark: The Ultimate Guide to Eccentric Glamour , ?An Evening with Dita & Friends? features the style and burlesque icon herself, spotlighting this manual on all things beauty via the Von Teese lens?from how-to steps, to history to intimate tales?and doing so side by side with the singularly glamorous eccentrics who Dita Von Teese considers confidants and creative influences.? Our evening with Dita Von Teese opens with a conversation with?Rose Apodaca, her? Your Beauty Mark  collaborator Rose Apodaca. ?In a vintage talk show format (think two Phil Donahues in red lipstick and high heels), Dita and Rose will welcome their fabulous pals into the conversation, with each reading a brief excerpt from the book, making for a spirited, entertaining evening of eccentric beauty and glamour!? Angelique Noire : This model and mother of two rejected early professional judgments that an African-American woman couldn?t work a cat eye and other neo-vintage trappings by becoming a social media superstar to women of all colors under the handle @theblackpinup. B. Akerlund : With clients such as Beyonce, Madonna, Lady Gaga, Britney Spears and many other pop stars, this Swedish-born superstylist and costume designer has herself become a fashion icon for her extravagant style and ?fashion activism? via a networking site promoting a brave new world of young fashion talent, whoyouare.com. Catherine D?Lish : A marquee star of the neo-burlesque era due to her original acts and exquisite costumes who has also transformed the art of striptease?s modern chapter as a creative director, choreographer, and unparalleled costume designer for Dita Von Teese, Catherine is parlaying her imaginative talents into a signature ready-to-wear lounge collection called Boudoir by D?Lish. Danilo Dixon : From the B52?s wigs to Lady Gaga?s hair-bow to Elsa?s braid in Disney?s  Frozen , when it comes to hairstyling, Danilo is a living legend of fashion, film, and fantasy. When he?s not part of Team Gwen Stefani, he?s hopping the globe to tend to runway shows, transform editorials, or serve as global ambassador for Pantene. Douglas Little : Clients such as Bergdorf Goodman, Van Cleef & Arpels, and Dell Computers call on this master of visual storytelling to realize their corporate identity into high-drama window displays, products, advertising, and other media. Douglas is equally as adept in applying this sense of narrative into the sensual realm of scent, creating distinct, custom perfumes for the revolutionary candle brand D.L. & Co. and through teaching the craft to aspiring noses worldwide. Gregory Arlt : Whether as a key part of Team Gwen Stefani or consulting anyone of the hundreds of women he meets on his worldwide tours as director of makeup artistry for MAC Cosmetics, Gregory has gained a massive following as the straight-shooting Beauty Exorcist and is working on a definitive beauty book according to his gospel. Jodi Lyn O?Keefe : This film and TV actress?s roster of recurring roles?from a six-year-run as a teen in the beloved daytime soap  Another World  to her work on  Nash Bridges, Prison Break,  and  The Big Bang Theory  and this year?s simultaneous starring parts in VH1?s breakout  Hit the Floor  and CW?s  The Vampire Diaries ?has gained her an avid cult following. She is also a fine jewelry designer and licensed bounty hunter. Kelly Osbourne : TV personality, singer, actress and reality series pioneer for the Emmy Award-winning  The Osbournes,  in 2014 Kelly added the title of fashion designer to an already accomplished career, with a signature ready-to-wear line called Stories?By Kelly Osbourne, with inclusive sizes from 0 to 24. The former long-time host and red carpet correspondent of E!?s hit  Fashion Police,  Kelly joined the judging panel for the first season of Lifetime?s  Project Runway Junior  and will appear on the new season of  Australia?s Got Talent  on the Nine Network in 2016. Ticket sales are final. No Refunds."
}