{
    "addr": "The client is responsible for airfare and hotel for the instructor on 1on1 programs.. For group bootcamps, the instructor pays their own airfare and hotel.. Los Angeles, CA", 
    "title": "Video e-Coaching (Virtual Bootcamp)", 
    "url": "http://www.eventbrite.com/e/video-e-coaching-virtual-bootcamp-tickets-93372279?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Class, Training, or Workshop"
    ], 
    "desc": "With the wonders of technology, reliable teleconferencing can be an infinite source of information. Sure, we post on forums and write our little hearts out, but there are always people out there that need that extra attention and developing training. As we know from working with guys in our  12 Weeks of Fury program , long-term training and weekly check-ups are a MUST for those not as motivated with the (almost detrimental and definitely weird) fervor that us pros have developed. However, there are people out there that either don?t have access to us because of location, or can?t make the time to match their schedules to that of a professional PUA for 4-hours a night. This last point is  COMPLETELY  understandable, so what we?ve done is compiled a concentrated version of the ABCs training and offer it condensed and portable for the PUA On The Go! ? What you get:  Six, hour-long personalized Skype calls (with a completely complimentary Initial Evaluation) and unlimited access to the forums and forum support for your homework assignments! ? Check out the descriptions of each weekly call, as well as the proprietary homework below! Initial Evaluation:? As with all of our programs, we want to make sure you?re on the right track and that our syllabus is in line with what you want to achieve. In this initial discussion, the coach will take one hour to discuss your background, experience in the game, and goals for the future. You and he will discuss how you see yourself fulfilling these goals and he?ll lend his expertise to the matter by breaking down the individual walls you?re facing and re-establishing a clear-cut goal program. There will also be a brief discussion about writing proper field reports. This will also be the time to find out everything you?d like to know about the coach, including his history, his experience, and why he thinks that he is a good match for you. In this conversation, you two will agree on a schedule to which your videoconferences should adhere. As with all of our personal training programs, 24 hour notice is necessary for reschedule and only one reschedule per session is allowed.? Homework: Though this is just an initial evaluation, homework will start right away. Before the next conference, you should list all of the sticking points, limiting beliefs, and roadblocks that you?ve faced in the past so that the coach can go through them individually with you and address them one by one. In addition, create a list with quick summaries of each girlfriend and sexual encounter you?ve had and how the relationships came to be (if less than 5). This will help the coach identify trends in your dating skill and put them back on track. Post these in the eCoaching section of the ABCs of Attraction forums to be reviewed by your coach. Week 1.?Sticking Points & Limiting Beliefs. In this first training session, the coach will discuss inner game, community trends (including the ?crabs in a barrel? syndrome) and the path that must be taken to success. So often, pickup companies riddle you with lines and routines without the proper background. At the ABCs of Attraction, we compare this to building a house without forming the foundation, as it is destined to fail. You and your coach will discuss the basis for successful sarging, personal growth, and success with women. You will also develop an in-depth pre-game routine to get you psyched up before sarging, eliminating the common threat of ?low energy? and ?off nights?.? Homework: You will develop a weekly schedule in order to achieve your goals and design a calendar for sarge nights between conferences. Post this in the eCoaching section to be reviewed by your coach between sessions. Week 2.?A & B: During this coaching conference, the first two steps of the ABCs? Holistic structure will be explained. A (Attitude, Approach & Attract) will include passive value (what a woman thinks of you BEFORE you talk to her), openers (Indirect and Direct and the realities of each), approaching (actually doing it), and proper body language (including ?the cowpoke). The discussion of B (Be in the moment, Banter & Buying Temperature) will include buying temperature (it?s purpose), BT spikes (a HUGE list), DHV Stories (both the elements of then and how to develop them on your own), and the coach will wrap up with an explanation of the purposes of the A and B phases.? Homework: This week, the homework will be to approach 10 sets, writing detailed field-reports for 5 of them and posting them in the eCoaching section of the boards to be reviewed by your coach. Week 3.?C & D: This conference will continue on the path of the ABCs of Attraction?s holistic game through the C and D stages. C (Comfort, Compliance & Connect) will discuss building connections in emotional and physical comfort through the creation of rapport and displaying your personality. General compliance tests (both passed and failed) will be discussed, as well as positive qualifiers, general kino, comfort leading questions and the nine effective connection tactics. D will include the art of displaying direct interest (including the six causes of sexual arousal), turning the conversation sexual with sexual topics, sexual leading questions and both sexual compliance tests and sexual kino.? In this week, you?ll also discuss the three types of number closes with specific examples and develop your own. Homework: Approach 10 sets and attempt to number close all of them, writing 5 field reports about the specifics of the number close. Post this report in the eCoaching section of the boards to be reviewed by your coach. Week 4.?Day 2s & Dates. This week, your coach will discuss with you the purpose of taking a woman out on a date. You and he will discuss various types of dates, both designing and implementing them, as well as traps to avoid on a date. The psychology of the date is discussed in detail, in order to generate a full understanding of it. You and he will also discuss basic concepts such as who pays for the date and design a girl based on your area that you can take a girl out on, right away!? Homework: Go on two dates. Design these dates according to the format that you and your coach have discussed, and write two separate field reports about what you planned for the date and what actually happened. As always, you will post this report in the eCoaching section of the boards to be reviewed by your coach.? Week 5.?Sexual Escalation & Sex: As your skills are developed, you will likely come closer to success. This week, you and your coach will discuss how to properly escalate sexually including various tactics and techniques presented by the ABCs in our standard bootcamps. You will discuss the logistics of bringing a girl home (including the ?Working Backwards? exercise), the three Anti-LMR tactics, and the peripheries of sexual escalation.? This week will be about focusing on the verbal, the physical, and the mental aspects of closing and how it can affect both your and her life. Homework: Complete the ?Working Backwards? exercise on your own. Also, write 3 field reports about your ongoing sarging and closing efforts. Post these in the eCoaching section of the boards to be reviewed by your coach. Week 6?Relationship Management & The Future. Having been through all of the necessary steps to initiate and develop potential relationships, you and your coach will focus on discussing the future of these, as well as your own personal future. This week will include discussions about furthering your relationships through the use of phone and text, including maintaining a regular presence with multiple women and long-distance relationships. This roundout of the program will also include the ?Fun or Fake?? discussion. As you know, life with successful Pickup is amazing, but successful Pickup without life is hollow and base. You and your coach will discuss your future, developing further goals and skills, and discussing your life outside of pickup. This will include hosting parties and social gatherings. Homework: This final homework will integrate your Pickup skills and your social life by designing, throwing and reporting back on a party, outing, or other social gathering. Invite the girls you have met during your journey and integrate them into your social circle. Write a detailed report and post it in the eCoaching section of the boards to reviewed by your coach. After the program has been completed, feel free to keep posting on the boards to receive critiques and support from coaches, instructors and the league of brethren that you?ll become apart of for as long as you?d like! As with all our other programs, enrolling will give you access to the alumni discount for all other programs, as well as free meet and greets and a group of friends willing to work, learn, and grow together!"
}