{
    "addr": "555 W. Foothill Blvd. Claremont (Los Angeles Area), California 91711", 
    "title": "Future Proofing Your Strategic Plan, January 2016", 
    "url": "http://www.eventbrite.com/e/future-proofing-your-strategic-plan-january-2016-registration-17787216042?aff=ebrowse", 
    "location": "Claremont (Los Angeles Area), California", 
    "starttime": "2016-01-20T10:00:00-08:00", 
    "endtime": "2016-01-22T12:00:00-08:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "The design of the Institute for  Future Proofing Your Strategic Plan, 2016  recognizes that strategic plans developed under a 20th century paradigm and context do not adequately prepare institutions for the realities of the emerging global digital learning ecosystem. There is mounting evidence that the condition of higher education grows more ominous.  (Higher Education: Apocalypse Now?)  One thing has become crystal clear -- no more business or planning as usual. The Institute focuses upon the process of  Future Proofing a Strategic Plan , detailing 10 vital planning initiatives required to prepare for the future to acheive fiscal and enrollment sustainability. Academic leaders must plan to meet the challenges and opportunities of higher education as it is carried into the future by the paradigm shift to a global digital learning ecosystem. Without a Strategic Plan and  Master Academic Plan  that are aligned with future realities, institutions are powerless to forging near, mid, and long term strategies for enrollment and fiscal health of colleges, schools and programs. The Institute is designed for institutional and academic leaders, including board members, presidents, provosts, vice presidents, deans, department chairs, faculty leaders, academic governance officers, interested faculty, accreditation team members, institutional planners, and institutional effectiveness professionals. The current paradigm shift requires unprecedented synergy and collaboration between academic and enrollment management. A philosophy that is both learner and learning centered must be focused through a lens that is intensely curriculum-centered. The Institute curriculum delivers practical strategic solutions for short, medium and long range impact. Institute pedagogy uses a blended seminar style guided by a digital interactive syllabus with readings, self-study and participant dialog. Participants? home institution will be the subject of their case study. Participants will continue to have the opportunity for interaction with institute colleagues long after attending the program as they contribute to the emerging Academic SEM community of practice.   Michael Dolence  is President of Michael G. Dolence and Associates, a global research consulting firm specializing in innovation in education, academic planning, curriculum development and enrollment management. He authored the first Primer on Strategic Enrollment Management and is the originator of the concept of Academic Strategic Enrollment Management. His career includes extensive research and analysis of financial aid efficacy, utilization, and policy impacts for both federal and state aid. He has conducted more than 140 post mortem analysis of colleges and universities that have failed and either closed or were merged with another institution. MGDA has developed a comprehensive curriculum planning and prototyping software system used to design academic prototypes for new universities worldwide. The system also supports program of study design and development as well as academic optimization scenario analysis."
}