{
    "addr": "Enter via N Orange Dr.. 7000 Hollywood Blvd. . Los Angeles, California 90028", 
    "title": "Eliason Merit Award 2015", 
    "url": "http://www.eventbrite.com/e/eliason-merit-award-2015-tickets-18234022452?aff=ebrowse", 
    "location": "Los Angeles, California", 
    "starttime": "2015-12-05T19:00:00-08:00", 
    "endtime": "2015-12-06T02:00:00-08:00", 
    "categories": [
        "Film, Media \\u0026 Entertainment", 
        "Party or Social Gathering"
    ], 
    "desc": "About the Eliason Merit Award SACC-LA proudly presents the Eliason Merit Award to individuals who have contributed significantly toward strengthening relations between the United States and Sweden. The Eliason Merit Award is a prestigious annual red-carpet event, hosted by The Swedish-American Chamber of Commerce in Los Angeles.? ? 2015 Eliason Merit Award Winner This year we are very happy to announce that the famous singer and songwriter Tove Nilson, best known as  Tove   Lo , will be the 2015 Eliason Merit Award winner! She recieves the prestigous award for her ability to successfully raise Sweden's profile within the music and entertainment industry and significantly contributing to strengthening Swedish-American relations. ? ? ? With 1 billion streams worldwide and mega hits like \"Talking Body\" x2 platinum awarded and \"Habits\" x3 platinum awarded, #3 on the Billboard Hot 100 and over 4 million copies sold, she has quickly become a rising star and one of Sweden's most exported artists. In addition to her solo work Tove Lo has also caught the attention of the likes of Taylor Swift, Lorde, Ellie Goulding, and Katy Perry and has co-written a number of songs for singers, including Hillary Duff's \"Sparks\" and Ellie Goulding's \"Love Me Like You Do\" (2015). For more on Tove Lo visit and click  here . Please see the official  Eliason Merit Award 2015 website  for further details.? The Hollywood Roosevelt Hotel The Hollywood Roosevelt Hotel is located at 7000 Hollywood Boulevard. In its early years, the Hollywood Roosevelt played host to countless icons: Marilyn Monroe, Charlie Chaplin, Clark Gable and Carole Lombard among others. The hotel's history and fame has lent itself to a legendary reputation, which has inspired movie-makers and film directors to set their movies within the hotel's storybook backdrop. EMA Award Ceremony?7:00 pm - 9:00 pm Exclusive award ceremony including an Open bar, Hors D'oeuvres and after party access with live performances!? Silent auction consisting of exclusive items and memorabilia. For more information click  here . EMA After Party?9:00 pm - Midnight* Amazing Live performances by Erik Hassle and Elliphant! Beats by DJ Carli and Tysper!? Cash bar EMA After Party Tickets at the door: $55 * The Roosevelt bar will stay open until 2:00 am and all EMA guests are welcome to stay and keep the party going to closing time! World Childhood Foundation? Her Majesty Queen Silvia of Sweden founded World Childhood Foundation in 1999 together with 14 family foundations, private individuals and companies that all shared her vision.  All children have the right to grow up and develop socially and intellectually. World Childhood Foundation works to prevent abuse and exploitation of children. Childhood foundation works to prevent abuse and exploitation of children. They support and implement over 100 projects around the world, assisting children who are at risk of or are victims of abuse, children who are in alternative care, street children, and families at risk.? http://www.childhood-usa.org/  I? http://www.childhood.org/ FAQs Are there ID requirements or an age limit to enter the event? Yes, please bring your ID as the age limit is 21 years. Where can I contact the organizer with any questions? Please contact: info@sacc-la.org for further questions. Do I have to bring my printed ticket to the event? No. Please check in with the entrance hostess.? Can tickets be bought at the door? After party tickets can be bought at the door for $55.  Award Ceremony tickets can only be pre-purchased via SACC-LA. What are the parking options? Valet is offered by The Roosevelt Hotel provided that parking spaces are available. Parking structures are located opposite of The Roosevelt Hotel on N Orange Dr. What is the refund policy? Not refundable."
}