{
    "addr": "1000 North Alameda Street Los Angeles, CA 90012", 
    "title": "MakeChange Awards", 
    "url": "http://www.eventbrite.com/e/makechange-awards-tickets-19288813360?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-08T11:30:00-08:00", 
    "endtime": "2015-12-08T14:00:00-08:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Meeting or Networking Event"
    ], 
    "desc": "Make LA The Best Place To #WORK! KEYNOTE SPEAKER Dr. Chito Cajayon is the Vice Chancellor of the Los Angeles Community College District's Economic & Workforce Development. ?He brings close to 20 years of workforce and economic development experience to the district, which he applies on a daily basis to develop local, regional, and statewide initiatives.??He works closely with college, university, and corporate leaders in order to make ideas come into fruition. Just in the past 6 years, he has orchestrated strategies that have resulted in over $35 million in grants and contracts. He holds a doctoral degree from the University of Southern California, a masters degree from Cal-State University-Dominguez Hills,?and teaches at Loyola Marymount University. Speaker Presenter: Sustainable Business Council? AGENDA 11:30AM - 12:00PM Registration & Networking 12:00PM - 12:30PM Welcome & Speaker 12:30PM - 1:45PM Awards Recognition 1:45PM - 2:00PM Closing? ABOUT THE EVENT The Inaugural 2015 MakeChange Awards in Los Angeles recognizes companies and organizations creating the most impact for a better Los Angeles. ? The awards will recognize both non-profit and for-profit sectors based in Los Angeles that create the most positive impact. ?The nominated enterprises have been evaluated based on the following criteria: 1) Sustainable Growth & Financial Performance, 2) Innovation & Creativity, 3) Impacts & Improvements, 4) Customer & Community Engagement, 5) Leadership Management, 6) Ethical Business Management, and 7) Workplace Well-Being. Categories for the awards include the following: - Conscious Leadership Of The Year - [HAPPY] Place To Work For Of The Year - Impact Of The Year - Innovation Of The Year - People's Choice Of The Year** - Social Enterprise Of The Year **Voting is now closed? CONGRATULATIONS ON OUR NOMINEES! Note: Group registration is made available upon request CONTACT For any inquries, please email: Mika Kim at MakeChangeAwards@gmail.com. THANKS TO OUR EVENT SPONSORS!"
}