{
    "addr": "Los Angeles, CA", 
    "title": "Mane University with Jen Atkin & Adir Abergel", 
    "url": "http://www.eventbrite.com/e/mane-university-with-jen-atkin-adir-abergel-tickets-19073565548?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-13T11:00:00-08:00", 
    "endtime": "2015-12-13T16:00:00-08:00", 
    "categories": [
        "Beauty", 
        "Seminar or Talk"
    ], 
    "desc": "MANE ADDICTS presents MANE UNIVERSITY featuring celebrity hair stylists JEN ATKIN and ADIR ABERGEL ? Sunday, December 13 th , 2015 Los Angeles, CA ? In this class, you?ll learn how to perfect Jen?s signature ?lived-in waves? and the way to properly use many irons to complete a look. Adir will teach you the secret to his trademark styling and texturizing techniques, and how to create memorable red carpet moments. You'll learn how to use extensions and falls to get \"selfie\" worthy hair including advice for making hair look fuller in photos and the correct way to place and cut extensions. ? Together, these Mane Masters will answer your burning career advice questions, while sharing expert tricks of the trade, must-have product picks, and the secrets to their success! Jen Atkin @jenatikinhair Known for her unique ability to meld old school beauty with up to the minute trends, Jen Atkin has styled hair for some of the most glamorous and trendsetting stars- Jennifer Lopez, Gwen Stefani, Emma Stone, Sofia Vergara, Jessica Alba, Kim Kardashian, Cindy Crawford, Katy Perry, and Christina Hendricks (to name a few).? Dividing her time between LA, NY, and Dubai, Jen works in beauty, print, film, music video, runway, red carpet, celebrity, and advertising where her hair artistry is frequently covered by publications such as Vogue, Elle, InStyle, Esquire, Nylon, Allure, and W Mag. Working with Guido Palau, Danilo, and Renato Campora, Jen began styling hair for some of the hottest designers and models including Louis Vuitton, Alexander Wang, Chloe, Alexander McQueen, Lanvin, Marchesa, and Christian Dior. ? Adir Abergel @hairbyadir World-renowned celebrity hair stylist and red carpet image-maker, Adir Abergel has been at the helm of the industry for nearly two decades. The Hollywood hair icon is the man behind the manes of Anne Hathaway, Jennifer Lawrence, Gwyneth Paltrow, Reese Witherspoon, Rooney Mara, Jennifer Garner, and Kristen Stewart, to name a few.? Known for his unique ability to create undone, effortless texture, Adir transforms celebrities into the most unique and raw portrayals of themselves. His work is regularly featured on the pages of Vogue, W, Harpers Bazaar, and his expertise is quoted in publications worldwide. In addition to his editorial work, Adir has made numerous appearances as a guest expert on Access Hollywood, Entertainment Tonight and E! ? ? FAQs Are there ID requirements or an age limit to enter the event? Please bring a photo ID for admission. There are no age restrictions. What are my transport/parking options getting to the event? Parking will be available at and near the event venue. Parking is available on a first come first served basis and not guaranteed. What can/can't I bring to the event? Phones and non-professional cameras without flash are permitted, however audio or video recording is NOT ALLOWED during the seminar.? ? Are there assigned seats? All tickets are general admission -- seating is based on first come first served basis. Where can I contact the organizer with questions?? university@maneaddicts.com? Is my registration/ticket transferrable?? Tickets are non-transferable and non-refundable.? Can I update my registration information?? Yes.? Do I have to bring my printed ticket to the event?? Please bring a photo ID and event ticket. You can download the Eventbrite app? HERE ?to bring a mobile copy of your ticket. Do I need any supplies for the event? No supplies wll be needed, this is a look & learn class.? What is the refund policy?? All tickets are final sale, no refunds. ? ? All tickets are non-refundable and non-transferrable. By purchasing a ticket you agree that you have read, understand and agree to abide by all of these guidelines."
}