{
    "addr": "5574 Melrose Avenue Los Angeles, CA 90038", 
    "title": "A Fun Sophisticated Evening @ Pour Vous!", 
    "url": "http://www.eventbrite.com/e/a-fun-sophisticated-evening-pour-vous-tickets-19173901656?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-11-27T20:00:00-08:00", 
    "endtime": "2015-11-28T02:00:00-08:00", 
    "categories": [
        "Wine", 
        "Party or Social Gathering"
    ], 
    "desc": "LOS ANGELES SINGLE PROFESSIONALS & FRIENDS  PRESENTS ? A fun-filled Mixer at Pour Vous! DJ, AERIALISTS & BURLESQUE! You talk about French, you think about style. ?The Pour Vous bar in LA is no different. With its Parisan theme and concept, the lounge is divided into sections such as Parfum, Potion and Sante. ? Enjoy a taste of France here at the Pour Vous as you sit miles away from the most romantic city in the world ? Located across the street from Paramount Studios, Pour Vous is an intimate getaway for upscale professionals and trendy socialites looking for some flavor of Paris in Hollywood. ? Entering through the nondescript fa?ade is like stepping onto the movie set for Moulin Rouge, right down to the vintage display case full of apothecary bric-a-brac that lines the narrow front hallway. Once past the thick blue velvet curtains, thirsty guests head straight for the bar to sample one of two dozen specialty cocktails, while romantic couples make their way to the lower lounge where a fireplace crackles below a stained-glass rotunda. An upper level just behind the resident (and usually model-esque) DJ offers small groups a chance to chill around marble tables, each dressed with a single rose. Despite being quite small, an outdoor patio in back may be the pi?ce de r?sistance, where trendy Hollywoodies grab a smoke in a full-on converted train trolley as they gab over small plates of chocolate and French cheese. Though the venue is far from a club, the DJ?s dance-friendly mixes often engender pockets of grooving, and on the off-chance the cocktails and champagne don?t entice, a converted antique espresso machine behind the bar serves as the beer tap. For a night of sophistication and style, Pour Vous is a tr?s bon spot to take pleasure in the finer things in (night)life. Pour Vous is the perfect place to come out and relax and have a drink, while mingling and getting to know new people! ?Its okay to come by yourself?you won?t be by yourself for very long! ? ? DRESS CODE: Gentlemen - Please wear collared, button down dress shirts. Collared button down dress shirts must be tucked in. Jeans or slacks are fine. ?Sports coats are highly encouraged. ?Hoodies, T-Shirts, beanies, baseball caps, sneakers, athletic wear, shorts or flip-flops WILL NOT be allowed inside the club at any time. ? NO loose or baggy fitting clothing. ?T-Shirts worn under jackets will be allowed. Ladies - Cocktail dresses and heels are encouraged. ?Dark pants and an upscale blouse is accepted. ?T-Shirts, hooded or crew-neck sweaters, sandals, and flip flops WILL NOT be allowed. IF YOU HAVE ANY QUESTIONS ABOUT THE VENUE OR THIS EVENT, PLEASE RESPOND THROUGH THE FOLLWOING SITE: Food and drink is at your own expense. ? ?? Friday, November 27, 2015 ?from? 8PM ??? 2AM IF YOU HAVE ANY QUESTIONS ABOUT THE VENUE OR THIS EVENT, PLEASE CALL CROSS TOWN PROFESSIONALS AT:? 323-744-1758 Parking: ? Street Parking, some lots nearby."
}