{
    "addr": "10899 Wilshire Boulevard Los Angeles, CA 90024", 
    "title": "Carol with Todd Haynes", 
    "url": "http://www.eventbrite.com/e/carol-with-todd-haynes-tickets-19126344411?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-12T19:30:00-08:00", 
    "endtime": "2016-01-12T22:30:00-08:00", 
    "categories": [
        "Film", 
        "Screening"
    ], 
    "desc": "When Carol Aird walks into the life of young Therese Belivet, it's to buy Christmas gifts at the Department store where she is a demure shopgirl. ?But there is no mistaking that first encounter for anything other than a true coup-de-foudre. ?Epically gorgeous and irresistably suave, Cate Blanchett as Carol joins the ranks of great actors such as Bette Davis, Cary Grant, Joan Crawford and Sidney Poitier who defined for certain eras, in particular roles what it meant to be a true movie star. Rooney Mara keeps perfect pace as the love-struck Therese and we experience their passion and pain as viscerally as we might have in first reading Patricia Highsmith's ground-breaking novel  The Price of Salt , upon which Todd Haynes' brilliant film (and Phyllis Nagy's script) was based. A Q&A with? Todd Haynes ?follows the screening. TICKETS $15 General Admission? $10 Hammer Members?with?valid discount code? Tickets can be picked up starting at 6:30 p.m. the night of the screening. Any unclaimed tickets will be released at 7:15 p.m.?A standby line for a limited number of tickets will be available the night of the program. Refunds cannot be provided. ABOUT THE CONTENDERS The Hammer Museum presents? The Contenders , The Museum of Modern Art?s renowned exhibition of films. Each year, MoMA?s Department of Film combs through major studio releases and the top film festivals around the world, selecting influential, innovative films made in the last 12 months that they believe will stand the test of time. Whether bound for awards glory or cult classic status, each of these films is a contender for lasting historical significance, and any true cinephile will want to catch them on the big screen."
}