{
    "addr": "2701 North Sepulveda Boulevard Los Angeles, CA 90049", 
    "title": "10th Anniversary Benefit Gala", 
    "url": "http://www.eventbrite.com/e/10th-anniversary-benefit-gala-tickets-19372682214?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-06T16:30:00-08:00", 
    "endtime": "2015-12-06T21:00:00-08:00", 
    "categories": [
        "Music", 
        "Concert or Performance"
    ], 
    "desc": "Education Through Music-Los Angeles cordially invites you to our? 10 th ?Anniversary Benefit Gal a ?Join us as we honor those whose contributions through music have changed our lives. Our annual benefit gala not only celebrates our 2015 Shining Star Honorees, but provides Education Through Music-LA the opportunity to reach our goal of serving  nearly 10,000 children? in low-income area LA schools this 2015-16 year. Supervisor Michael Antonovich  (Fifth District, LA County Board of Supervisors) Common? (Actor, Artist) Congressmember Karen Bass  (37th Congressional District) Congressman Xavier Becerra  (34th Congressional District) Christophe Beck  (Composer, Frozen, Edge of Tomorrow)? Congresswoman Judy Chu  (27th Congressional District) John Debney  (Composer,  Bruce Almighty, Iron Man 2, Elf ) Kate Flannery  (Actress, The Office) Mayor Eric Garcetti ? (Los Angeles) Michael Giacchino  (Academy Award-Winning Composer,? Disney-Pixar's UP, Jurassic World ) Michael Gorfaine  (Gorfaine/Schwartz Agency) Ed Helms  (Actor,  The Office, The Hangover ) Imagine Dragons Ellie Kemper  (Actor,  Bridesmaids,  Unbreakable Kimmy Schmidt,? The Office ) Laura Engel & Richard Kraft  / Kraft-Engel Management Christopher Lennertz? (Composer,? Revolution, Supernatural) Rickey Minor  (Musical Director,  American Idol ) Rory Pullens? (Executive Director,? Los Angeles Unified School District) Congressman Adam Schiff  (28th Congressional District) Richard M. Sherma n  (Composer/Lyricist,  Disney's Mary Poppins, The Jungle Book ) Attire: Business Formal / Cocktail Dress Limitied Tickets; purchase tickets early as event will be sold out. Guest List will be held at the door - there will be no paper tickets. For sponsorship opportunities  click here  or call 818-433-7600. To purchase a? tribute ad click here . To avoid ticket registration fees, checks may be sent to:  ETM-LA, Inc. 2501 W. Burbank Blvd. Ste. 301, Burbank, CA 91505 With the exception of $80 per ticket, all ticket purchases are tax-deductible. ?ETM-LA, Inc. Tax ID: 87-0776958"
}