{
    "addr": "Annenberg West Lobby . 3502 Watt Way  . Los Angeles, CA 90007", 
    "title": "LavaLab Fall 2015 Demo Night", 
    "url": "http://www.eventbrite.com/e/lavalab-fall-2015-demo-night-tickets-19606557742?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-03T19:30:00-08:00", 
    "endtime": "2015-12-03T22:00:00-08:00", 
    "categories": [
        "Mobile", 
        "Convention"
    ], 
    "desc": "For an entire semester, our six undergraduate startups at LavaLab, USC's product design incubator, have been building amazing products, and now it's finally time for them to show off. We've exclusively invited a curated crowd of our mentors, investors, and exceptional students to attend and mingle. We hope you are able to join us for an evening of incredible demos and incredible people. Doors open at 7:30, and the event starts at 8:00. Teams ?LavaLock is an affordable, bluetooth-connected bike lock that you've been waiting for. Never fumble with keys or a code again. LavaLock secures automatically as you leave your bike, and unlocks when you return. Pinpoint is a platform that enables you to share memorable experiences with friends through the use of photo pins on a map. You upload photos to your own personal map, and they are pinned to the location they were taken. You can share your map with friends so they can see what you've been up to and utilize your photos as recommendations for things to do nearby. ? Point B aims to create a self sufficient platform to digitize a user?s bucket list and share it over their network of friends,?colleagues, and family. Through the app users can virtually host various outings and as a result- possibly make new friends or discover new places.? ? Auburn is a college-based marketing platform that enables companies to intelligently distribute their products and analyze market response, efficiently broadening their customer base. Tether is reinventing the way you interact with your skateboard. ?We're creating a ?convenient and unobtrusive device used to quickly and safely secure your skateboard, wherever you are. Guinea Pig is a mobile application to connect people who want to get paid to participate in research with researchers who are willing to pay them. ? ? This event is proudly sponsored by Cross Campus and General Assembly."
}