{
    "addr": "The Reserve. 13031 W. Jefferson Blvd, Suite 200. Los Angeles, CA  90094", 
    "title": "TechFire Presents a Fireside Chat with VC David Siemer of Wavemaker Partners", 
    "url": "http://www.eventbrite.com/e/techfire-presents-a-fireside-chat-with-vc-david-siemer-of-wavemaker-partners-tickets-19723279861?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-11T14:30:00-08:00", 
    "endtime": "2015-12-11T16:30:00-08:00", 
    "categories": [
        "High Tech", 
        "Meeting or Networking Event"
    ], 
    "desc": "presents ? a fireside chat with David Siemer Co-Founder & Managing Partner, Wavemaker Partners Join us Dec. 11 for a fireside chat with a partner from one of L.A.'s top venture capital firms! ? ? David Siemer is the Co-Founder & Managing Partner of one of L.A.'s leading  venture capital ?firms, Wavemaker Partners, ?an early-stage, cross-border VC firm with dual headquarters in Los Angeles and Singapore. Since 2003, Wavemaker (formerly known as Siemer Ventures) has invested in more than 150 Internet, Mobile and Enterprise technology startups. Wavemaker Partners is a member of the DFJ Global Network, the world?s leading venture capital collective with 15 firms spread across 4 continents.? He also is the? Founder & Managing Director of Siemer & Associates, specializing in complex cross-border M&A deals and private equity placements throughout the United States, Europe and Asia. Friday, Dec. 11, 2015 ?Fireside Chat followed by a Reception 2 pm: doors open early for registration (please plan to arrive by/before 2:30). 2:30 pm - 3:30 pm: Fireside Chat 3:30 pm - 4:30 pm: Reception Moderated by  Rob Kornegay ?( Wilson Sonsini Goodrich & Rosati ) ? Space is extremely limited.? ? ? PRESENTING SPONSOR: PLATINUM SPONSOR: ? ADDITIONAL SPONSORSHIPS AVAILABLE:  email david@techfire.co  for details . ? ? Full Biography: David Siemer co-founded Wavemaker Partners (formerly Siemer Ventures) to assist early growth technology companies to achieve their full potential. Ranked o ne of the most active VC firms in Southern California by CB Insights, Wavemaker supports close makes an average of 20-30 new investments each year in digital media startups.? He also ?founded Siemer & Associates, LLC in 2007 to fulfill his vision of a true boutique merchant bank that works with technology, software and digital media companies throughout their complete life cycle. He was previously with Montgomery & Co. where he served as a key member of the Digital Media Investment Banking Group. In this capacity he led sales to major media companies such as News Corp, Google, Sony, Yahoo!, Hearst, Viacom, WPP and Disney, and he managed equity private placements from multiple venture capital firms and hedge funds. Mr. Siemer began his career in 1995 at Desco Capital Partners, a Chicago based Internet and software venture fund. Here he managed investments into companies such as: Total Control Products (sold to GE), Conquest Communications (Sold to AT&T), StorageApps (Sold to HP) and Enact Software (sold to Sage SalesLogix). Mr. Siemer received his M.B.A. in Finance and Economics from the University of Chicago, Graduate School of Business, with high honors. He completed his undergraduate work at Lehigh University with degrees in Management Information Systems and Accounting.? To learn more, visit? Wavemaker Partners ?and? Siemer & Associates . ? ? ? ABOUT US Visit techfire.co to learn more about TechFire . CANCELLATIONS / NO SHOWS As the caterer charges by the RSVP, we kindly request that you cancel in advance if you cannot make it. Thanks so much!"
}