{
    "addr": "Old Town San Diego San Diego, CA 92110", 
    "title": "Copy of Mystery Scavenger Hunt: Old Town SD 12/5/15", 
    "url": "http://www.eventbrite.com/e/copy-of-mystery-scavenger-hunt-old-town-sd-12515-tickets-19341960324?aff=ebrowse", 
    "location": "San Diego, CA", 
    "starttime": "2015-12-05T11:00:00-08:00", 
    "endtime": "2015-12-05T16:00:00-08:00", 
    "desc": "This is an incredibly fun and unique competition where you'll find out if your detective skills are good enough to solve a murder... Each team is given a list of suspects along with a packet of tricky clues, twisted riddles and mind-bending puzzles. Our clues will systematically lead you to explore Old Town San Diego. Using your wits and some creativity, each location will reveal another piece of your investigation, and you'll eliminate suspects until you've discovered... Who Done It? Your team will compete against up to ten other teams scattered throughout Old Town, each leading their own separate investigation. The team that solves for the murderer needing the least help from headquarters wins! Go to our website for additional info and more event dates:? The game lasts about 4 hours and will require traveling about 2 miles on foot. Allow extra time for signing-in at the beginning and socializing at the end. It's a great way to experience Old Town. Get outdoors for the day and enjoy this historic area while exercising your body and mind. RECOMMENDATIONS: -We strongly recommend teams of 4 - 5 people, but teams of 3 and 6 will be accepted. (sign up as a team, we do not make teams out of strangers). 3 ticket minimum purchase to form a team. You can participate as a 2-person team, but you must purchase 3 tickets. Also consider that most 2-person teams are unlikely to be able to complete the full course.? -We recommend that you bring water, snacks, sunscreen and comfortable shoes. -There is no age limit, but the game is likely too mentally challenging for children under 12. And all players under 18 must have a parent or guardian sign a release form."
}