{
    "addr": "Hertford House. Manchester Square. London, London W1U 3BN GB", 
    "title": "The Mistresses of Cliveden: Three Centuries of Power, Scandal and Intrigue", 
    "url": "http://www.eventbrite.co.uk/e/the-mistresses-of-cliveden-three-centuries-of-power-scandal-and-intrigue-tickets-17981195239?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-27T18:30:00+00:00", 
    "endtime": "2015-11-27T20:00:00+00:00", 
    "categories": [
        "Seminar or Talk"
    ], 
    "desc": "Built in the reign of Charles II by the Duke of Buckingham, Cliveden was conceived as an enclave for hunting and hedonism, a luxurious retreat in which the duke could conduct his scandalous affair with the ambitious courtesan, Anna-Maria, Countess of Shrewsbury. During its twilight in the 1960s as much as its dawn in the 1660s, Cliveden was an emblem of elite misbehaviour and intrigue: some three hundred years after Buckingham realised his vision, the house once again served as the stage for a scandal, the Profumo Affair, which would bring down a government and change the course of British history. In the three hundred years between the Countess and Keeler, the house was occupied by a dynasty of remarkable women: Elizabeth Villiers, an intellectual who brokered the rise and fall of governments; Augusta of Saxe-Gotha, a minor German royal who almost became queen of England; Harriet, Duchess of Sutherland, the glittering society hostess turned political campaigner; and Nancy Astor, the consummate controversialist who became the first woman to take a seat in parliament. Under the direction of these women, Cliveden provided a stage for political plots and artistic premieres, hosted grieving monarchs and republican radicals, was idealised as a family home, and maligned as a threat to national security. For this special evening event, Natalie Livingstone will be joined in-conversation with? ?Caroline Sanderson to?tell the story of these women, and of the house in which they lived.. The lecture will be followed by a wine reception and book signing. The book will be available to purchase on the night."
}