{
    "addr": "50 Fitzroy St London, Gt Lon W1T 5BT GB", 
    "title": "RAI Research Seminar: Rachel Harris", 
    "url": "http://www.eventbrite.co.uk/e/rai-research-seminar-rachel-harris-tickets-16219746699", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-02T17:30:00+00:00", 
    "endtime": "2015-12-02T19:30:00+00:00", 
    "categories": [
        "Community \\u0026 Culture", 
        "Seminar or Talk"
    ], 
    "desc": "SEMINAR SERIES AT THE ROYAL ANTHROPOLOGICAL INSTITUTE Dr Rachel Harris, SOAS Wednesday 2 December at 5.30 pm This seminar considers the burgeoning interest in soundscapes within the discipline of ethnomusicology. Drawing on diverse strands from urban geography to sound art and acoustic ecology, Rachel Harris asks what fresh insights a multi-disciplinary focus on sound can bring to ethnomusicology, and what ? if anything ? distinguishes ethnomusicological approaches to soundscapes. Using the collaborative research project ?Sounding Islam in China? as a case study, she discusses the benefits and challenges of international, interdisciplinary research, and the ways in which new technologies may serve as both field site and research tool.  Biography Rachel Harris is Reader in the Music of China and Central Asia at SOAS, University of London. In addition to journal articles and book chapters, she is the author of Singing the Village: memories, music and ritual amongst the Sibe of Xinjiang (2004) and The Making of a Musical Canon in Chinese Central Asia (2008). She is co-editor of Situating the Uyghurs between China and Central Asia (2007), Gender in Chinese Music (2013) and the ethnomusicology text book Pieces of the Musical World (2015). Her research interests include global musical flows, identity politics and Islamic soundscapes, and she currently leads the Leverhulme research project Sounding Islam in China. She is actively engaged with outreach projects relating to Central Asian and Chinese music, including recordings, musical performance and consultancy."
}