{
    "addr": "66 Royal Hospital Rd London SW3 4HS GB", 
    "title": "Skandilicious Swedish Christmas Pop Up Restaurant 17 December", 
    "url": "http://www.eventbrite.co.uk/e/skandilicious-swedish-christmas-pop-up-restaurant-17-december-tickets-19329548199?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Food \\u0026 Drink", 
        "Party or Social Gathering"
    ], 
    "desc": "Join us this November & December and enjoy an authentic all-you-can-eat Christmas Sm?rg?sbord, snaps songs & other Swedish traditions in a unique central London setting.? Skandilicious are proud to be hosting Swedish Christmas 2015 in a wonderful setting ideally located to provide respite from the stress of Christmas. We are excited to announce that this year we will be popping up in Chelsea Physic Garden. In this urban oasis Skandilicious have created a festive?Swedish Christmas dining experience centered around seasonal food and drink, enhanced by a contemporary take on traditional Scandinavian traditions. You?re invited to step in from the cold - and the Christmas hustle and bustle - and join us for a warming drink before enjoying the traditional Julbord (the Christmas version of a classic Sm?rg?sbord). You might be thinking what is a Julbord? Whilst there are a few classic dishes that are guaranteed to make an appearance, each Swedish family will have a slightly different take on it, but essentially it?s a culinary journey that takes you to the heart of Swedish cuisine with three full?tables of freshly prepared and delicious Swedish-style food. The starter table: Consists of primarily cold dishes such as herring, cold cut meats, salads and pates and of course smoked salmon & gravad lax. Look out for 2015's showstopper Herring Surprise which had Marco Pierre-White doing double takes round the?Sm?rg?sbord during the recipe tasting session this summer!?Different types of cheese, breads & spreads?are also found here. The main course table: Yes, this is where you will find the Swedish meatballs. But there is so much more to it than that; ?succulent ribs, cute little ?prince? sausages and the curiously delicious Janssons temptation just to mention a few dishes? Our traditional Julskinka (breaded Christmas Ham decorated with cloves) lives here too. The dessert table: Designed to satisfy even the sweetest tooth, the final table is dedicated purely to sweets, desserts and baked goods such as ginger cake, saffron cake and of course the classic Christmas Rice Porridge which is enjoyed with sugar and cinnamon. Will you be the lucky guest finding the single almond hidden in the porridge; and what does this mean? All will be revealed during the course of the meal. Join us for a drink before sitting down for your Christmas meal, and enjoy a list of unique seasonal Swedish cocktails created by Fredrik Olsson (Skandilicious co-founder and voted London?s best bartender).? *The ticket price includes a warm welcome drink and the all-you-can-eat sm?rg?sbord. You can buy wine, beer, snaps, cocktails and other drinks from the waitresses. Snaps [snaps]?is a Swedish word for a small shot of a strong alcoholic beverage taken during the course of a meal. Drinking snaps is a tradition in Sweden?and the Scandinavian countries, where it is very common to drink snaps at holidays such as Midsummer, Christmas and Easter. Try our carefully curated selection of Snaps and join the Skandilicious sing-a-long-song. We don't like wasting paper so instead of bringing a printout of the booking confirmation the lead booker of your party will be required to present his or hers ID together with the booking reference upon entering the venue.? ? The ticket price includes a warm welcome drink and the all-you-can-eat sm?rg?sbord. The tickets do not include any drinks other than the welcome drink. ? You will be able to order soft drinks, wine, beer, cider, schnapps and cocktails from our waitresses and waiters before, during and after the meal, and all drinks are payable at the end of the meal. ? If you are unable to find enough tickets for the same day, please contact Skandilicious directly ( ) to be advised on availability. We will do everything we can to help you find a suitable date and time for your party. ? Skandilicious will be popping up at Chelsea Physic Garden, 66 Royal Hospital Rd, London SW3 4HS. The nearest tube stations are Sloane Square and South Kensington. There are plenty of buses that stop on the Kings Road which is a short walk from the venue. Sloane Square (Circle & District Line) 0.8 miles South Kensington (Circle, District & Piccadilly Line) 0.9 miles Swedish Christmas will open its doors for dinner at 18:00 most days and at 12:00 for weekend lunches ( ). Due to its location in the wonderful Chelsea Physic Garden last orders will be taken at 22:00. Yes - although please note that the venue has 2 floors so please do contact us beforehand so that we can ensure that we arrange for your table to be on the ground floor. Please contact the Skandilicious team on? ?or on 0207 859 4780?if you have any questions."
}