{
    "addr": "London, Gt Lon SW1P 3PA GB", 
    "title": "A Service of Lessons and Carols", 
    "url": "http://www.eventbrite.co.uk/e/a-service-of-lessons-and-carols-tickets-19057903703", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-24T16:00:00+00:00", 
    "endtime": "2015-12-24T17:00:00+00:00", 
    "categories": [
        "Religion \\u0026 Spirituality"
    ], 
    "desc": "Free tickets for this Service are available? on on Wednesday 18 November at 9.30 and 14.30 ?on a first come first served basis.? You can apply for a maximum of 4 tickets per application. Once you have submitted your details, you will receive a confirmation email. This will have your tickets attached. Please make sure that you enter your email address correctly so that this reaches you. In order for as many people to be able to attend these Services, we ask that you do not apply for both of the Services of Lessons and Carols on the 23 and 24 December.? These are identical in content. Seating is unallocated. The services have been designed so that musical items and readings can be observed in different parts of the Abbey at different times, so that everyone gets a chance to participate and enjoy the service. Doors open?one hour?before the Service. If you have any access requirements, please apply for your tickets online and then contact us with your booking number and requirements. ?There is ramped access to the Abbey and all forms of wheelchair can be accommodated. The Abbey is equipped with a hearing loop system that covers the whole of the main building and we are able to provide large print Orders of Service. The Service is suitable for all ages. Children aged?4 years and over will require tickets so please include them in your application. Ticket holders?must be seated by 3.45pm? You must bring a printed ticket for each member of your party on the day. Without this we cannot guarantee entry. Bag searches will be in operation. Any luggage or large bags cannot be taken into the Abbey"
}