{
    "addr": "2 Butcher Row London E14 8DS GB", 
    "title": "How to read the Bible - For God so Loved the World: The Gospel of John", 
    "url": "http://www.eventbrite.co.uk/e/how-to-read-the-bible-for-god-so-loved-the-world-the-gospel-of-john-tickets-17617110251?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2016-02-20T14:00:00+00:00", 
    "endtime": "2016-02-20T16:30:00+00:00", 
    "categories": [
        "Religion \\u0026 Spirituality", 
        "Seminar or Talk"
    ], 
    "desc": "How to read the Bible It is sometimes said that there are more unread copies of the Bible than any other book in the world. Dauntingly complex and at the centre of so much controversy, it is in fact a whole library of books including history, songs, letters, prophecy and poems, and above all the stories of hundreds of different people searching for God. Continuing our popular series of study afternoons, we will explore what these books and stories would have meant to their first readers and what they might mean to us now. No previous knowledge is necessary, just come with an open mind to read these books as if for the first time. ? ? For God so Loved the World: The Gospel of John David Ford Saturday 20 February 2.00 ? 4.30pm John?s is the last of the Gospels, written after many decades of meditation. Often talked about as the most spiritual and poetic of the Gospels, it is also the most dramatic: almost all of it is vivid narrative about what Jesus does and says. And amongst all the action, John weaves theological commentary which challenges his first readers ? and us ? to engage with his revolutionary message about the nature of God: at the heart of his Gospel is the mind-blowing concept that the universe is centred on love. David Ford is Regius Professor of Divinity at the University of Cambridge. He is writing a commentary on the Gospel of John, has given the 2015 Bampton Lectures at the University of Oxford on Daring Spirit: John?s Gospel Now and is the author of The Drama of Living: Becoming Wise in the Spirit (Canterbury Press 2014). ?15 per study afternoon. The sessions will be at St Paul?s Cathedral and details will be sent withbookings. Bursaries are available for those for whom the charge would make it difficult to attend: please contact us for details."
}