{
    "addr": "London  GB", 
    "title": "\"Dargons Investment Show\" #3, Live TV Show; Watch, Pitch or Network", 
    "url": "http://www.eventbrite.co.uk/e/dargons-investment-show-3-live-tv-show-watch-pitch-or-network-tickets-19320999630", 
    "location": "", 
    "starttime": "2016-01-31T18:30:00+00:00", 
    "endtime": "2016-01-31T21:30:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "Due to popularity & success of the investment event, we are now organising the third version of the Dragons Investment Event. Join us for watching, pitching, investing or for networking with entrepreneurs & investors. We have 4 savvy Dragon investors ready to hear your pitch and invest in your business; if our Dragon investors like your project! Successful startups will receive an investment as a loan or % of equity. The event would be filmed & televised. Limited tickets are allocated to this group. Please buy tickets asap from:  Our 4 Dragon investors: 1-Investing from ?20,000 up to ?3,000,000 Founder and CEO; has 35 years commercial experience largely in the tech space. He has founded 3 start-ups and was until 2011 CEO of an international banking software house. He works with several private investors and business angel networks looking for outstanding investment propositions from ?20,000 - ?10,000,000. 2-Investing from ?50,000 to ?3,000,000. Has invested over ?12,000,000. Founder of the UK's No.1 mentoring and investment group for entrepreneurs. Founded in 2007; after spending 4 successful years working at Goldman Sachs in Private Wealth Management. He has personally invested in 8 different companies and through his company and hasfunded over 1400 businesses in the last 18 months. Always happy to offer free incubators places to people who are looking for start-up capital by way of a loan, and happy to offerfree mentoring. Happy to offer the same to the people pitching and audience members. 3-Investing from ?50,000 Is a business angel & consultant, working mainly in the tech start-up sector. His principle focus is on the commercial development of internet firms. This encompasses business strategy, investment readiness, marketing, sales and usability. Previous clients and investments include firms in casual games, web apps, mobile apps, financial platforms, healthcare and so on! 4-Investing from ?50,000 to ?5,000,000 Judges at Collider, mentor at Wayra, Seedcamp, Emerge Ventures, and have put a fund together (?60,000,000 capacity) backed with some serial entrepreneurs; exits and revenue generating companies of ?100,000,000. 10 Start-ups have the opportunity to pitch their project for 10 minutes in total: 3 minutes pitching and a further 7 minutes for question & answer. If investors are convinced, then they may offer you the investment or an investment package subject to due diligence. You can sign initial agreement or contract in person at the event or progress the talks later. After the main pitching Event (10 pitching) you can use the \"30 seconds elevator pitch\" to pitch your business to Dragon investors & audience investors, for consideration of investment; We expect there to be people in the audience who may also be able to help your business. What businesses need to prepare for pitching? 1. Proof of Concept: proof they have something your targeted customers want. The best way to prove that is existing sales. 2. A valuation that stacks up. For example: someone who says I need ?50k and offering 10% values their company at ?500k but if no sales are made and it is still in its infancy the company is not worth anywhere near ?500k. That puts investors off straight away. For normal example: \"you have made ?50k in sales and a profit of ?20k, given the industry, basing it on a multiple of 6 x earnings so, the business is valued at ?300k (6 x 50k) and you need ?50k and you therefore offering a 17% stake in your business.\" However, the decision on offering equity % and accepting any offer by any investors is a business decision to be considered after taking the necessary guidance from your professional advisers. If in doubt please seek legal advise before proceeding. Event program: 5.00pm Event Opens ? guest arrival, networking and drinks 6.00 Presenter to start Welcome and Intro + Investors introduction to the stage 6:20 Reza (organizer) welcoming introduction 6:.30 Pitch Event ? 7 pitches are given (15 minutes each) 8.30 Round up and (first 1 call for Wildcard Pitchers)- BREAK 8.45 1 Minute Pitch Event for 10 pitchers 9.00 Networking 11.00pm Close 7 businesses pitching each for 5 minutes, then Dragon investors question them max 10 minutes. In 5 minutes you must tell: 1- Name 2-Project concept 3-proof of success 4-% proposal to investors ? Businesses (audience x80) Tickets are on limited allocation to this group. Please buy tickets asap . A projector will be available for your presentation. Entrepreneurs wishing to take part in the pitching process must email their business plan and pitch deck to London Entrepreneurs Network: (admin@LondonEntrepreneursNetwork.com) For any inquiry please email us or call 07591020664 Please be aware the event will be filmed, please only attend if you have consent on being filmed & published. Join us: Facebook: www.facebook.com/groups/londonentrepreneursnetworkmeetup/ Twitter:  YouTube: www.youtube.com/channel/UCm1337oHKvn2A7rYk8vVLtA LinkedIn: www.linkedin.com/groups/London-Entrepreneurs-Network-7473563? trk=my_groups-b-grp-v"
}