{
    "addr": "Jerwood Space. Union Street. London SE1 0LN GB", 
    "title": "‘Presence and the Photograph: some thoughts from history and anthropology’, a lecture by Professor Elizabeth Edwards", 
    "url": "http://www.eventbrite.co.uk/e/presence-and-the-photograph-some-thoughts-from-history-and-anthropology-a-lecture-by-professor-tickets-19222938326?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-26T18:30:00+00:00", 
    "endtime": "2015-11-26T19:45:00+00:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Seminar or Talk"
    ], 
    "desc": "A lecture by   called ?Presence and the Photograph: some thoughts from history and anthropology?.  is Research Professor of Photographic History and Director of the Photographic History Research Centre, De Montfort University, Leicester. A visual and historical anthropologist, she has worked extensively on the relationships between photography, anthropology and history, on the social practices of photography, on the materiality of photographs and on photography and historical imagination. She previously held curatorial and academic posts in Oxford and London. In addition to major monographs, most recently The Camera as Historian: amateur photographers and historical Imagination (2012), she has published over 80 essays in journals and exhibition catalogues over the years. With colleagues in the Netherlands and Norway, she led a major HERA/European-funded project on the role of the photographic legacy of the colonial past in contemporary Europe. She serves on numerous academic committees and peer-review colleges, was Vice-President of the Royal Anthropological Institute 2009-12, held a Fellowship at the Institute of Advanced Study, University of Durham (Spring 2012) and is on the Advisory Board of the National Media Museum. In 2015 was elected a Fellow of the British Academy. For more information about the Jerwood/Photoworks Awards 2015 please visit  . Image courtesy of De Montfort University"
}