{
    "addr": "London, Gt Lon E14 5NR GB", 
    "title": "Kings Cross Steelers, 20th Anniversary Gala Dinner", 
    "url": "http://www.eventbrite.co.uk/e/kings-cross-steelers-20th-anniversary-gala-dinner-tickets-19058620848?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-28T19:00:00+00:00", 
    "endtime": "2015-11-28T23:30:00+00:00", 
    "categories": [
        "Sports \\u0026 Fitness", 
        "Dinner or Gala"
    ], 
    "desc": "After the dinner we will move on to XXL by London bridge to continue the celebrations long into the night. We advise attendees to consider packing a change of clothing to change into before we leave the dinner venue.  Black Tie Requested/Preferred : Welcome Drink, 3 Course Meal, Entertainment The closest stop on the tube will be Canary Wharf. The venue is just a short walk from the station and we'll be using the tube after the event to reach Southwark next to XXL. If you have any questions about the event then please contact the committee on You do not need to bring a ticket to the event as we will have a guest list and seating plan for everyone who has purchased a ticket. So just come along and enjoy the evening. Please enter the names of those you wish to be sat with so the organisers can do their best to accomodate friends on tables. We will be mixing tables and the seating plan up to encourage mixing across the years and teams as we're all part of the same wonderful club! ? Yes the dress code is black tie requested. Which means we ask that you do your best to adhere to a black tie dress code. However we do not wish to exclude anyone who cannot come in black tie, so the rules will be relaxed for a dark suit and tie. Potentially yes. We are only opening sales to club members in the first few weeks to allow members to have the first chance to attend the event. If we do not sell the event out in these first few weeks we will open the tickets out to a more generous sale for friends and partners. If you are an old club member then please contact  to get an alumni ticket. If your partner or friend wishes to become a support of the club they will then be entitled to buy a ticket in the first few weeks. Please contact  if this is the case so a code can be given to your friend/partner."
}