{
    "addr": "42-46 Princelet St London E1 5LP GB", 
    "title": "Frugal Innovation: How to Do More with Less", 
    "url": "http://www.eventbrite.co.uk/e/frugal-innovation-how-to-do-more-with-less-tickets-19602088374?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-25T18:15:00+00:00", 
    "endtime": "2015-11-25T20:15:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Over 4 billion people around the world, most of them in developing countries, live outside the formal economy and face significant unmet needs in core areas such as health, education, energy, food, and financial services. For years this large population was either the target of aid or was left to the mercy of governments. More recently, however, private sectors firms, both large and small, have begun to see the bottom of the pyramid as a market opportunity and have begun to design market-based solutions to meet unmet needs. Meanwhile in the developed world, declining real incomes and government spending, accompanied by greater concerns about the environment, are making consumers both value and values conscious. Further, more and more people in the West are empowered to do with limited resources what only large firms could do in the past. Ubiquitous tools and technologies such as smart phones, cloud computing, 3D printers, crowdfunding, and social media, have given rise to grassroots innovation and entrepreneurship exemplified by the maker movement and the sharing economy. This talk will discuss how the phenomenon of frugal innovation?the creation of faster, better and cheaper solutions that employ minimal resources?which was once the preserve of the developing world is now taking off in the West as well. The talk will argue that frugal innovation holds the key to driving global growth by employing more people creatively and solving some of the big problems of poverty and inequality that stalk the planet. The talk will highlight examples of such innovation by entrepreneurs, emerging market firms and multinationals in North and South alike, and show how London is well placed to take a leadership role in this space."
}