{
    "addr": "Kings Place. 90 York Way. London, London N1 9GU GB", 
    "title": "How to get started on your children’s book with Laura Dockrill and Alex T. Smith", 
    "url": "http://www.eventbrite.co.uk/e/how-to-get-started-on-your-childrens-book-with-laura-dockrill-and-alex-t-smith-tickets-19119411675?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-06T10:00:00+00:00", 
    "endtime": "2015-12-06T16:00:00+00:00", 
    "categories": [
        "Film, Media \\u0026 Entertainment", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Learn tips and techniques from the people behind fabulous children?s books including the CLAUDE series, Darcy Burdock and Tape? Curated and hosted by children?s author? Laura Dockrill , this fabulous day of talks is suitable for writers and writer/illustrators of all levels who want to learn how to create original stories from scratch. You?ll learn how to develop a writing style that people can engage with, as well as how to bring words and images together into compelling narratives. Crucially, you?ll also learn lots of confidence-boosting tips to help you unlock your creativity and get started on your own project. Content Curator profile Laura Dockrill? is a writer, illustrator and performance poet whose work includes the much-loved Darcy Burdock books for children. Named one of the top ten literary talents by The Times, Laura?s energy and enthusiasm shines through in both her writing and teaching style. Find out more about Laura on her? website . Speaker profiles Sarah McIntyre ?is the award-winning creator of books such as Dinosaur Police, There?s a Shark in the Bath, and Vern and Lettuce. She collaborated with David O?Connell on Jampires and with Philip Reeve on illustrated chapter books including Oliver and the Seawigs, Cakes in Space and Pugs of the Frozen North. Visit her website and blog? here .? Alex T. Smith ?is the creator of the CLAUDE fiction series for early readers. Most recently Alex has reimagined Dodie Smith?s ?The Hundred and One Dalmatians? for it?s special 60th Anniversary edition, created new covers for Eva Ibbotson?s reissued spooky back catalogue, and has put the finishing touches to his 11th picture book. Hayley Long ?has always loved words. Before writing her own, she taught English in Brussels, London, Cardiff and Norwich. It was while she was teaching in Cardiff that she wrote Lottie Biggs is not Mad. This was awarded the White Raven label for outstanding children?s literature by the? International Youth Library ?in Munich. Steven?Camden ?s debut young adult novel Tape was published worldwide in January 2014 by HarperCollins to rave reviews and his second novel, ?It?s All About Love,?published in June 2015, was Book of the Month for The Guardian. You can find him on Twitter? here .? Full course and returns information on the Masterclasses website"
}