{
    "addr": "309 Regent St London, Gt Lon W1B 2HW GB", 
    "title": "Westminster Talks: ‘In or Out of Europe? Why the forthcoming vote matters’", 
    "url": "http://www.eventbrite.co.uk/e/westminster-talks-in-or-out-of-europe-why-the-forthcoming-vote-matters-tickets-17861964617?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2016-02-24T18:00:00+00:00", 
    "endtime": "2016-02-24T19:00:00+00:00", 
    "categories": [
        "Community \\u0026 Culture", 
        "Seminar or Talk"
    ], 
    "desc": "The University of Westminster's Lecture Series 'Westminster Talks 2015-201 Westminster Talks is proud to continue the series with a t alk by  Roland Rudd , Chairman, Finsbury and Business for New Europe Roland Rudd is the Founder and chairman of Finsbury, recently named by the Holmes Report as the Best Global Financial Consultancy. Roland is also chairman of Business for New Europe; Founding chairman of Legacy10, which aims to increase legacy gifts to charities; and leads the campaign for corporate partnerships on dementia for the Prime Minister and Secretary of State for Health. He is also Trustee of the Royal Opera House; chairman of the Tate?s Corporate Advisory Group; Trustee for the Speakers for Schools programme; Trustee of the Garden Bridge Trust; Non-Executive Director of the Army Board; Member of the Great Ormond Street Hospital for Rare Disease Research Fundraising Appeal Board; Patron of the NSPCC; Member of the Centre for European Reform?s Advisory Board; and Governor of Wellington College.  Before founding Finsbury, Roland was a financial journalist at the Financial Times, the Sunday Correspondent and the Times. He is a former policy coordinator for Lord Owen. At Oxford University he read philosophy and theology, as well serving as President of the Union. He is now a visiting Fellow at the University?s Centre for Corporate Reputation and an honorary Fellow at Oxford?s Regent?s College. ? In or Out of Europe? Why the forthcoming vote matters For further information on? Roland Rudd  and the other lectures in this series please  visit :  westminster.ac.uk/westminster-talks"
}