{
    "addr": "Wilkins Building. Gower Street. London WC1E 6BT GB", 
    "title": "UCL CLP: The Myth of the Remedial Constructive Trust", 
    "url": "http://www.eventbrite.co.uk/e/ucl-clp-the-myth-of-the-remedial-constructive-trust-tickets-18552622393", 
    "location": "London, United Kingdom", 
    "starttime": "2016-02-04T18:00:00+00:00", 
    "endtime": "2016-02-04T19:00:00+00:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "CURRENT LEGAL PROBLEMS? LECTURE SERIES 2015-16         The Myth of the Remedial Constructive Trust by Dr Charlie Webb, London School of Economics Chair TBC ? on Thursday 4th February 2016, from 6-7pm Venue:  UCL Main Campus,? Gustave Tuck Lecture Theatre? ? Accredited with  1 CPD hour  by the  Solicitors Regulation Authority and the Bar Standards Board ? About this lecture: As the courts continue to flirt with the idea of the remedial constructive trust, this lecture will examine the arguments that have been made for and against its recognition in English law.? The principal argument offered in its favour is that the flexibility it gives to courts allows them to reach better, more just results.? Those who have argued against it have tended to concede this and have focused instead on the uncertainty it would bring and on the legitimacy of courts assuming such a power to reallocate property.? I shall argue that this concession is a mistake. The justice advantage of the remedial constructive trust is seen to lie in the greater discretion that it gives to courts: freed from the constraints of binding rules, courts are better positioned to fashion a remedy to the circumstances of the cases, reaching the result which is, all things considered, best.? But the relationship between rules and discretion is not always one of opposition and, where discretion is to be meaningfully opposed to rule-based decision-making, the upshot is not more justice but less.? If the remedial constructive trust really is discretionary in a way that ordinary institutional constructive trusts are not, we have every reason to reject it. It turns out, however, that this is not the sort of discretion that those jurisdictions which have adopted expressly ?remedial? constructive trusts have embraced; indeed it?s one they have repeatedly rejected.? Such differences as there are between English law and the law of these jurisdictions are found in the substantive rules which govern the operation of constructive trusts.? So the question English law faces is not whether we should recognise some ?new model? of constructive trust, but rather the more familiar inquiry into what rules are best.? In addressing this question, the idea of the ?remedial? constructive trust is only an unnecessary distraction."
}