{
    "addr": "173-177 Euston Road London NW1 2BJ GB", 
    "title": "Peoples Assembly National Conference 2015", 
    "url": "http://www.eventbrite.co.uk/e/peoples-assembly-national-conference-2015-tickets-19222623384?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-05T10:00:00+00:00", 
    "endtime": "2015-12-05T17:00:00+00:00", 
    "categories": [
        "Charity \\u0026 Causes", 
        "Conference"
    ], 
    "desc": "It's clear we face a vicious government. The election result in May shocked the nation as the Conservative Party managed to gain a slim majority in Parliament. They remain committed to further cuts, to selling off our public services and attacking ordinary people's living standards. But, since the election, we've also seen some of the biggest mobilisations against austerity and against this government yet. The People's Assembly has grown rapidly and mobilised hundreds of thousands against austerity. From over a quarter of a million people marching on the 'End Austerity Now' national demonstration in June, to the week of action against the Conservative Party Conference in Manchester, plus co-ordinated days of action, public meetings, rallies and protests the length and breadth of the country. The election of Jeremy Corbyn as leader of the opposition is another indication that people have had enough. It's time for everyone who wants to see a change to come together once more and decide how we create a movement that can stop austerity in it's tracks. Weather you've been central to the organisation, or if you just want to find out how you can get more involved, join us on 5 December.?Book your tickets now! For more info check out our? ?or contact conference@thepeoplesassembly.org.uk Everyone is welcome to attend the conference and take part in the debates and discussions weather you're part of an organisation or not as an 'observer'. If an organisation is formally affiliated to the People's Assembly that organisation is invited to elect 'delegates' who will be eligible to vote on proposals put forward to the conference (in the form of motions) on the next steps for the People's Assembly. Local People's Assembly Group: 10 Delegates National Affiliated Organisation: 10 Delegates Local Affiliated Organisation (including trade union branches): 2 Delegates Organisations are perfectly within their rights to send more than 10 people and we encourage you to do so, these additional observers will be allowed to speak in the debates and discussions throughout the day. Any affiliated organisation is entitled to submit   motion to be voted on at the conference (but doesn't have to!). Motions will be published on our website in advance of the conference. Deadline for submitting motions:  A large amount of motions were dealt with at the last conference which adopted policy and action points. If we have already adopted policy, there's no need to submit a motion on the same issue unless you want to change it. You can read through the agreed motions from the last conference here:  Please note: submitting a motion doesn't guarantee a speaking slot at the conference.  For all accessibility information please see Friends House webpage   If you have any other questions please don't hesitate to contact the office. If you have any queries at all about the conference at all please do not hesitate to contact us in the office on  Timetable will be avaliable in the next couple of weeks. Watch this space.  or email us on"
}