{
    "addr": "Tobacco Dock  London, England E1W 3HZ GB", 
    "title": "Gin Festival London 2016", 
    "url": "http://www.eventbrite.co.uk/e/gin-festival-london-2016-tickets-19470332288?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2016-02-19T18:30:00+00:00", 
    "endtime": "2016-02-21T21:30:00+00:00", 
    "categories": [
        "Food \\u0026 Drink", 
        "Festival or Fair"
    ], 
    "desc": "Presents: After last years massively sold out first ever London Gin Festival, GinFestival.com returns to the capital to our new location, so we can bring even more gins, even more producers, even more food options! As seen on  , The Metro and The Guardian. With the most gins and the most people we are the UK's largest gin event!? Tickets available from: www.ginfestival.co.uk/events We will be showcasing over 100 different gins! On arrival you will be handed your Gin Festival glass (to take home!) and a brochure, full of information on all the gins you can try, a little about each company and the suggested garnish. You will need drinks tokens to buy the gin which will be available at the front desk, these are ?5 per drink and includes tonic and a fresh garnish. Most people tend to buy a card of 4 for ?20 and go from there, but you can buy less if you like. There will be live entertainment, talks from gin industry experts, food available to buy and lot's of chit chat with other gin lovers. If you're new to gin don't worry, our friendly staff will recommend some to get you going or tell you all about our favourites. :-) Tickets are ?12 (+ booking fee) The sessions will run: Friday 19th Feburary 2016: Evening Session: 6.30pm - 11pm Saturday 20th? : Afternoon Session 12.30pm - 5pm ?6.30pm - 11pm THIS EVENT IS A STRICTLY FOR OVER 18 YEARS OLD. (YOU MAY BE ASKED FOR ID). ? Q: The event is sold out, are there any more tickets available? A: All our tickets are sold through Eventbrite, once they are sold out we don?t have any more tickets available. You can join the waiting list on the event page if you are interested in acquiring returned tickets. Q: Am I required to bring ID? A: As this is an 18+ event you may be asked to show ID if you are lucky enough to look under 25. Q: Do the tickets have to be in my name for me to use them? A: No, the name on the tickets doesn?t affect who can use them. Q: I can no longer attend the event, can I get a refund? A: Yes, we can give a full refund for any tickets purchased?until Wednesday 17th February at 5pm;?please email? Q: Where can I contact the event organiser? A: You can contact us by email using? ?or by phone using:?01274 568834 Q: Can I bring my children to the event? A: Our events are strictly 18+ so this means we can?t admit anyone under 18 even if they have a valid ticket. Q: Will there be food at the event? A: Yes, there are food and snacks available at all our events, including vegetarian options. Q: Is re-entry permitted? A: You can come and go as you please, but it is worth taking note that you will have a glass with you that you must take with you! Q: Do I need to print out my tickets for the event? A: Unless you have an account for the Eventbrite mobile App then you will need to print out your tickets sent to you in the confirmation email when you purchased the tickets. Q: Do you send out paper tickets? A: No, all our tickets are sent to you through an Eventbrite confirmation email. Q: I haven?t received my confirmation email, what should I do? A: Please contact us on? ?and we can re-send the confirmation email to you, if you still don?t receive the email it may be in your junk or spam folder. Q: What is included with my ticket? A: Each ticket includes admittance to the event for one person, a badge, a glass and a brochure. Q: Will there be seating? A: Seating will be provided but is not guaranteed for every attendee.? Gin Festival reserves the right to carry out photography and/or video recording at their events for publicity purposes and to reproduce images and footage on our website. ?By entering into this Agreement, you agree that Gin Festival and any party authorised by the Gin Festival may use such images in perpetuity and in any format whatsoever. You further agree that copyright in these materials is owned by Gin Festival."
}