{
  "LosAngeles": [
    {
      
      "place": [
        {
          "name": "Other Outdoor Activities in Los Angeles"
        },
        {
          "rating": ""
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        },
        {
          "categories": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Old Bank District"
        },
        {
          "rating": "3.5"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90013",
            "streetaddress": "400 S Main St"
          }
        },
        {
          "categories" : [ "OutDoor" ]
        },
        {
          "Phonenumber": " 1 213 253 4777"
        },
        {
          "reviews": [
            {
              "review": "We did a walking tour through here and while the buildings are quite impressive, or would have been once, they have been let run down and most have been converted into crappy low cost apartments. Apparently the city is putting money into revamping the district so maybe in 5 years will be nicer."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "A área Old Bank District em Los Angeles, concentra quase uma dezena de belos prédios antigos, que foram ou são sedes de bancos e instituições financeiras. Vale a pena incluir esta visita quando for a downtown... se apreciar conhecer um pouco da história da cidade e da arquitetura de seus prédios."
            },
            {
              "review": "Один из центральных районов даунтауна Лос Анджелеса, в котором встречаются здания постройки начала XX века. Особенно знамениты здание банка фермеров и торговцев (Farmers and Merchants Bank) и здание Continental. Спокойный приятный район для прогулки в центре."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Watts Towers"
        },
        {
          "rating": "4.5"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "streetaddress": "1765 East 107th St"
          }
        },
         {
          "caegories" : [ "OutDoor" ]
        },
        {
          "Phonenumber": " 213 847 4646"
        },
        {
          "recommendedlengthofvisit": " <1 hour"
        },
        {
          "fee": " No"
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "Saw the structure then went to the museum and saw a documentary about its creator. Had to go back to the towers to contemplate some more and see the details I had missed before."
            },
            {
              "review": "Visiting for USC Parents Weekend, we left the campus to tour Watts Towers! What a treat!\nOur tour guide, James, was passionate and informative!\nThe structure itself was fascinating! I have wanted to visit this structure since I was in college and I am so glad that we ventured there.\nThe area was safe, parking was easy, and the video was saw before was great!\nIf you are a lover of folk art, community art, or appreciate history, I highly recommend going!\n\n"
            },
            {
              "review": "I have always loved the Towers. They are pure grass roots art and offer a spiritual feel all that is Los Angeles. SEE THEM."
            },
            {
              "review": "Still an amazing piece of history. Ensure that you are aware of your surroundings as you tour. Watts is a tough area of L.A.."
            },
            {
              "review": "Let me start with, as I usually do, talking about the people who rated this one star. Those who took public transportation... Did not do their research! This is south central. Basically anybody who lives in America knows Compton is basically the worst area along with harlem. Well this is almost right next to Compton. If you did not take a tour or your own car- you have a low chance of having a good experience. There are lots of gangs so be smart. If you take a tour or car you will be fine- once you are there you are safe. This is a tourist attraction so there are guides and police so it's not just you and a couple of thugs. Also- I would rate this 5 but considering how many fun things there are in LA don't bother wasting a whole precious day on this unless you have many open days or do many things in one day. If you are staying in a nice area like hollywood or Beverly Hills, this is very far- the other side of town. So again do your research, be smart, stay safe, this will be fun. Sure the building isn't that amazing compared to that church in barca that other review said this is a bad version of, was made by hundreds of people, this was made by a local out of kindness by himself. It is made of TRASH! It's pretty cool."
            },
            {
              "review": "This outstanding folk art is a MUST SEE for all to visit. His dedication, craftsmanship and talent is an inspiration. It is just a short walk from the blue line transit stop."
            },
            {
              "review": "The Towers are amazing to see. The problem is that they are located in a very HIGH CRIME area of South Los Angeles."
            },
            {
              "review": "You have to go and see the towers at least once in your lifetime! The story behind the towers was very interesting, the tour guide was very knowledgeable and answered everyone's questions professionally. There was a nominal fee to go inside the gated area of the towers, and a small museum of artists from the area. There was even a 15 minute video about the creator of the towers which helped you to understand the man behind the towers. Sadly though, the neighborhood surrounding the towers could really use a large trash can, a strong back, a good broom and rake, to bring the neighborhood back to it's once vibrant beauty."
            },
            {
              "review": "My only free day in the area was unfortunately on a Tuesday, when it's closed. You can still see the towers from outside the fence, but no tours that walk you through the structures.\n\nSimon Rodia's towers are like an antidote to stereotypical LA. It's in a not-so-great neighborhood whose other claim to fame is the riots of 1965 and has been beset by socioeconomic troubles since then. In contrast to the money and glitz just miles away in Hollywood, Rodia's \"Nuestro Pueblo,\" as he called them, was made by one guy over 33 years using scrap rebar, found objects, and a homemade concrete mixture. It's a testament to the imagination, dedication, and creative vision of an ordinary guy achieving extraordinary things against all naysayers, city bureaucracy and regulation, and unhappy neighbors."
            },
            {
              "review": "Some describe the Watts Towers as the largest single piece of folk art in the world. The nearby museum and the guides will fill you in on the story of the man who built them. The towers have to be seen to be understood. Decorated with broken crockery and tile, these structures have a unique beauty and lightness. A must see!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Top Cigar Bars in Los Angeles"
        },
        {
          "rating": ""
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Grand Hope Park"
        },
        {
          "rating": "4.5"
        },
         {
			"categories" : [ "Landmark" ,"OutDoor" ]
		},
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90017",
            "streetaddress": "Between 9th St, Olympic Ave, Grand Ave and South Hope St"
          }
        },
        {
          "Phonenumber": " +1 213 624 0555"
        },
        {
          "reviews": [
            {
              "review": "I lived in a condo building for 2 weeks directly across the road from this park. It is in a great neighborhood with lots of stores and restaurants. I would walk around this park several times a day just to get fresh air. Several times we actually saw commercials being filmed and galas happening at this park..Its sort of a happening place!"
            },
            {
              "review": "This is a great little park in downtown Los Angeles bordered by grand and hope. We discovered it while searching for an apartment building we might be interested, If you are in the neighborhood and need a a place to sit down and enjoy a cup of coffee away from the city for a few minutes this is for you. It has water features, a kids playground and workout equipment. It feels safe and for whatever reason, the homeless have not taken it over. This is not an LA destination, but rather a wonderful amenity of a fast growing neighborhood of new and rehabbed apartments, condominiums and lofts."
            },
            {
              "review": "I've brought my kids here several times just to ooh and ahh at the color changing fountain. I think this experience is best at dusk so the kids really appreciate the color glow before them. Water embraces the floor in front of the fountain for a good 50 feet or so and kids love playing and splashing in it. There is a Starbucks conveniently located here too for the big kids. The park has a nice view of City Hall and the landscape is sort of desert like but peaceful. There isn't a whole lot here but kids will appreciate the effort just to partake in the fun of the fountain. Best part, it's free."
            },
            {
              "review": "It is a nice relaxing park located in Downtown LA. Just a couple of blocks away from Staples Center. We didn't plan for the visit. It was a coincidence discover this park when we visit FIDM-LA Campus. i would said it was a surprise of my trip. Actually we went there twice, one in day, one at night. In the day, you would enjoy the sunshine in the park and have a good breathing within those lush trees and lawn. Also the fountain is another attraction in the park. Especially at night, you will see the color changing underneath the water. You will feel the relaxing and calm while you stay in the park anytime. I Love this place a lot.!!"
            },
            {
              "review": "This is a recent addition to downtown LA, and it is long overdue. In a city notorious for charging for everything (pay toilets?!), this place is an oasis. There are many roaring fountains sloped down a park that stretches from Grand to Main St. There are plenty of chairs, and security keeps the area safe. The trees and grass are well kept, and occasionally there is a music show down here. It's a great place to run through, or just take your coffee and read a paper."
            },
            {
              "review": "Nao acho que deva perder tempo bisitando ,so como eu que gosto de cainhat e estava por perto dei uma passada,euma paca como outras quqlquer nada especial"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "University of California, Los Angeles (UCLA)"
        },
        {
          "rating": "4.5"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "streetaddress": "Sunset Blvd."
          }
        },
         {
			"categories" : [ "Landmark" , "University" , "OutDoor", "School" ]
		},
        {
          "Phonenumber": " 310/206-8147"
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "Visit UCLA for a week to drop my son. A beautiful campus....you could spend hours just gazing at the amazing architecture."
            },
            {
              "review": "A very beautiful campus and very close to expensive houses. The best school in this area and very competitive to get in."
            },
            {
              "review": "Arrived as a foreign delegate for conference. Finding the Courtside Collection is tricky for taxi drivers - it is not signposted inside the parking garage, so the driver didn't know where to drop me off. Neither did the parking attendants. Reception staff are students who aren't always knowledgeable or service trained. Four fab exceptions..Jenelle. Theodore and two Hispanic chaps. I wasn't offered help with a massive suitcase. I had to ask and was questioned why I brought such a huge suitcase. Way to welcome a guest! No one on reception knew where to hail buses from either. Pathetic.. My phone charger broke and no one had spare international/USB adapters on reception/knew where to buy one. One chap let me borrow his. We figured out chargers could be bought metres away at the university shop. Three days later. I don't understand whether the staff know how to look after a conference guest at all. I missed breakfast the first day as it finished v.early on a Sunday. Who seriously eats breakfast 7-9am on a weekend? Having said that, the breakfast was exceptional. For kings and queens. So much choice and v.tasty too :) The tech centre is full of protocol driven nobodies who won't let guests use chairs, even if their work takes longer than a few minutes. I had to beg their manager to use a chair. He let me. The campus is poorly lit and hard to find in the dark. If you get lost, go to Ucla medical centre and they will drive you home. All in all a bad stay, somewhat mitigated by a lovely room with lots of TV channels."
            },
            {
              "review": "I visited with a group of teenagers. We contacted the student outreach office and we got a tour of the campus. While there I noticed many neighbors walking their dogs, jogging through campus. One can visit and watch the different games going on for the less popular sports."
            },
            {
              "review": "UCLA has an absolutely beautiful campus. Walking up the stairs in the main campus area gives a view into all of the things that make this country great. Involved students, faculty and the location can't be beat. Truly a great campus."
            },
            {
              "review": "This school is beautiful. I came here just to take photographs. I took a picture of John Wooden statue and they arena was open for you to stroll inside. They have a trophy room where you can tour inside. Such a historic school."
            },
            {
              "review": "First time in LA and just wanted to see the campus. A huge beautiful campus it's a must see just to say you've been there . You'll get lost in the campus store just lovely."
            },
            {
              "review": "UCLA is a world-renowned centre of learning and culture! The campus is a marvellously eclectic mixture of modern architecture and traditional historic buildings. Augmented by stunning landscaping and striking sculptures throughout the site, a visit to UCLA is truly memorable!!!"
            },
            {
              "review": "UCLA accepts 4% of 100,000 applicants each year. The University is so hard to get into for great reason.. The educations is awesome, the Campus is stunning, the weather is perfect, and we have won the most NCAA sports championships of any US University. A great place to send your children to learn from the finest professors in the US"
            },
            {
              "review": "60,000 people attend UCLA on an impressive campus with all the facilities you could imagine at a world class learning institution. Home to the leading medical facilities in the region as well as world class athletic facilites that have played host to some of the best athletes in the world. In addition UCLA has hosted live concerts from Segovia (Royce Hall), to the Greatful Dead (Pauley Pavillion) and Coldplay (Tennis Arena) over the last few decades. I enjoyed all three. A regional research library at UCLA is also a massive amazing archive for scholars."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Top Yoga & Pilates in Los Angeles"
        },
        {
          "rating": ""
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Hollywood Heritage Museum"
        },
        {
          "rating": "5.0"
        },
         {
			"categories" : [ "Landmark" , "Museums" , "OutDoor" ]
		},
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90068",
            "streetaddress": "2100 N. Highland Ave."
          }
        },
        {
          "Phonenumber": " 213- 874-2276"
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "This small museum that was the actual barn building used for Cecil B DeMille's first studio. His office is preserved in one of the ante rooms. The barn is chocked full of memorabilia and silent short films from the birth of Hollywood. \n\nThe museum is at the foot of the Hollywood Hills near the Hollywood Bowl and Griffith Park surrounded by avocado trees. It's easy to miss since the small building it is set back in one of the Hollywood Bowl parking lots. \n\nThe museum is closed now for renovation. When it reopens don't miss the chance to immerse yourself in Hollywood history."
            },
            {
              "review": "If you've ever wanted to see items from Charlie Chaplin's movie studio, Cecil B DeMille's The Ten Commandments, props, costumes and other artifacts from Hollywood's Golden era, this is the place. The museum building is actually the first home of what would be later called Paramount Studios. The Barn was the home base for Hollywood's first feature length motion picture and it has a rich history all its own,\n\nThis is a must see for any classic film fan. It's so inexpensive to enter and all the proceeds benefit the Museum. Becoming a member is so easy and costs so little. You must see the building that would become the Paramount Studio Gym. Its restoration is an amazing story in itself. Located across the street from the Hollywood Bowl, this attraction is never too crowded and has a charming gift shop with some rare and wonderful items.\n\nDon't miss this treasure."
            },
            {
              "review": "This is a great antidote to the circus that is Hollywood and Highland. It is small, and very interesting, in the original barn (which has moved three times) that the first studio was set up in by Cecil B de Mille. \n\nThe docents and volunteers were very informative and there is a small but good book shop. \n\nPlans are underway to recreate an outdoor sound stage. That will add even more to the experience."
            },
            {
              "review": "A wonderful little museum dedicated to the birth of \"Hollywood.\" I always say that you have to know where you came from to truly appreciate where you are, and if you are a movie fan of any caliber this is a \"must see.\" Cecil B. DeMille's office!! You can feel the energy! This is an all volunteer run museum, and these folks really know their film/Hollywood history! They have limited hours so check the website before venturing out. Well worth the reasonable $7 admission fee."
            },
            {
              "review": "This little museum is a little off the main tourist path but well worth a visit. Limited hours so check the website before you go. Building was Cecil B. DeMille's original office from the time he made his first Hollywood movie until he died soon after finishing \"The Ten Commandments\" 40+ years later. Some of the exhibits are permanent, so come and go. The day we visited was just after a temporary exhibit had left so a little empty.\n\nThe real gem is the docent who was willing to talk for hours explaining the history of movie making in Hollywood. Using a few old photos for visual clues, he made history come alive. It was a joy talking with him and asking a few questions to keep the information coming. A real treat to find someone who loves what they do and is willing to share their knowledge with anyone who asks.\n\nThe $7 admission fee is about right given the limited exhibition space. Parking is free, book store is small, didn't see anything unusual or rare to buy. A fifteen minute walk (up hill) on Highland Ave. from the corner of Hollywood & Highland and the Dolby Theater/Chinese Theater complex. Across the street from the Hollywood Bowl which also has a small museum. Worth the hike."
            },
            {
              "review": "I did not expect much as it is a small barn like structure on the side of the road. It was great and so informative. Where the first full length feature film was created. The docent/guide was very informative."
            },
            {
              "review": "Hollywood History - all in one place. Visit Cecil B. Demille's first office, great exhibits, videos of vintage Hollywood, artifacts from the silent era, knowledgeable staff, great display on Julia Adams presently on display, wonderful videos, free parking, modest entry fee."
            },
            {
              "review": "It's where 'Hollywood' as we know it began. By walking into the Hollywood Heritage Museum, your walking directly into the original office and studio of Cecil B. Demille, one of Hollywood's film pioneers. Wonderful exhibits, oversized photos, vintage ephemera, film props, camera's, projectors all from the silent era. They have videos, and much to see, explore and learn. Also a wonderful book and gift shop. Highly recommended. Just a 10 minute stroll up the street from the more famous Chinese Theater and across the street from the Hollywood Bowl, which also has a great little museum."
            },
            {
              "review": "If you’re interested in the history of Hollywood film-making from its earliest days, this very interesting little museum is a must-see! Don't let the simplistic exterior fool you: this museum manages to pack a lot of great material into a small space. It’s a fairly easy walk from Hollywood Blvd. or the Hollywood & Highland parking garage (but also has its own free parking lot). The structure is the actual barn used by Cecil B. DeMille and co. as the \"studio\" for Hollywood's first feature film, \"The Squaw Man\" (1914). DeMille's office is recreated as it appeared back then, and the remaining permanent exhibits include a variety of rare and fascinating items (particularly noteworthy are the various silent-era movie cameras), even a Rudolph Valentino tribute area. As of this writing (June 2012), an additional wealth of historical memorabilia is on loan from Paramount Studios to commemorate that studio's centennial (DeMille, Jesse Lasky, and Sam Goldwyn later merged their Lasky Film Co. with Paramount). The entry rates are very reasonable, the hours have been extended beyond the previous weekends-only, and the staff is extremely friendly and knowledgeable. There is also a good book/gift shop that contains excellent merchandise. Very much enjoyed the Hollywood Heritage Museum, and will stop by again the next time I’m in town!"
            },
            {
              "review": "The Museum just reopened. This is the building where Cecil B. DeMille made his first movie in Hollywood. The building has been moved from its original location and has been restored. It contains his office with some of his furniture and shoes. There is an exhibit of memorabilia from Universal Studios. Universal was the first studio to have tours open to the public. There is parking in front of the museum but sometimes the parking lot is used for events at the Hollywood Bowl."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Orpheum Theater"
        },
        {
          "rating": "4.5"
        },
        {
          "operation": [
            {
              "days": "Mon - Fri",
              "time": "9:00 am - 5:00 pm"
            }
          ]
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90014",
            "streetaddress": "842 South Broadway"
          }
        },
         {
			"categories" : [ "Landmark" , "Theatre" , "OutDoor", "Movie" ]
		},
        {
          "Phonenumber": " 877-677-4386"
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "Saw Opeth for their 25th anniversary show and it was awesome. Venue was great had beer and snacks for sale. Parking was easy at one of the lots right next door. Would come back if another great band is in town playing here"
            },
            {
              "review": "For being such an old venue, the sound was fantastic. Great location. Easy to find. Great parking available."
            },
            {
              "review": "I have been a Celtic Thunder fan for years now, when I heard they were coming to LA I had to get tickets. As I walked into the theater with my mom and younger cousin we were in awe of the beauty of the theater. The ceilings were beautiful and lighting was terrific. However, the seats were a little to tight for fitting. As the performance was fantastic, couldn't help but to worry about the guys and hoping they wouldn't run into each other on the stage. Very tight fit for them. The staff was not the friendliest but overall it was a great experience to watch them perform."
            },
            {
              "review": "Have watched Celtic Thunder on PBS for a few years, but nothing could have prepared us for the group actually performing live on stage - they were great! The opening drums set the stage and it only gets better after that.\n\nThe instrumentals and backup performers all did their part and really help make the show what it is - it is awesome!\n\nGet your tickets early and spend the money to sit up close and personal.\nGo see it when you can!\nHope this helps.\nEnjoy!"
            },
            {
              "review": "Was lucky to have a seat for the Annie Lennox PBS Recording in January.\nThe theatre had been in blackout since Xmas, but was brought back to life beautifully for this extraordinary concert.\nSeats were comfortable, acoustics were good, not great. The theatre is however beautiful.\n\nQueues for drinks were too long at the interval, but quite honestly when aren't they!"
            },
            {
              "review": "The Orpheum is an amazing old theater from the early days of Los Angeles. You wouldn't expect how ornate and fancy it is inside by the look of it on the outside. \n\nWe lived almost across the street from the Orpheum for a year and it was so great that we were able to see a couple shows there. There's nothing like walking to a show, getting dinner afterwards next door at Umami and getting home in 2 minutes."
            },
            {
              "review": "My first venture into LA was to this historic theater to watch my favorite band perform an evening with Dream Theater, and I was not disappointed at all. While I know not much of the history of this location I honestly spent the time of the opening doors to the beginning of the show exploring the details of the theater. While we sat on the last aisle on the floor seating, the sight to the stage was great and not bad for a short guy like me. The theater's acoustics in my opinion was exceptional, the lighting was soft and mellow for a rock concert. The styling of the theater feels like a flash to the past and I was walking around mesmerized by the decor and style of the theater. I hope to have another chance to visit this theater for another show of some sort in the near future. Thank you"
            },
            {
              "review": "The theater is beautiful, you can’t get a bad seat, and the sound is excellent the only down side is they only take cash! So if you want anything to eat or drink bring cash because they don’t take credit or debit cards"
            },
            {
              "review": "Acoustics are fantastic and the decor will blow your mind. Wish all venues were this cool. Go early and have a drink at the Broadway Bar or Golden Gopher."
            },
            {
              "review": "The Orpheum Theater is a famous old theater and is a beautiful building inside and out, but to get there was scary. \n\nIt was in a crappy part of old downtown Los Angles although everyone said it was the “hipster” part of town (it smelled like piss and greasy tacos, no real restaurants around to eat at, etc.). \n\nKnow the bar is cash only!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "University of Southern California"
        },
        {
          "rating": "4.5"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90089",
            "streetaddress": "3620 South Vermont Avenue"
          }
        },
        {
          "reviews": [
            {
              "review": "Beautiful campus, clean and well organized. Lots to see and is a very friendly campus. Located near the Coliseum, take a tour of the campus and then go to the game to support the Trojans!"
            },
            {
              "review": "If youre a sports fan go to Heritage hall and see the over 100 National Championships the school has won. The new school of film has some outstanding structures. there are numerous statues throughout the campus. The Campus is downtown and is very safe during the day at night no where is safe in LA."
            },
            {
              "review": "Toured on campus visit for my 17yo daughter. Impressed by insulated feel in heart of L.A. You would never realize it was downtown when on campus."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "The University offers some sights to see, but If you are not a student there, there is nothing, but danger in the neighborhoods surrounding campus."
            },
            {
              "review": "USC is an amazing campus, with a great university feel and many beautiful courtyards and buildings. But it's also fascinating to watch the beginning of construction of University Village, a $1.2 billion project that will expand the campus by 25% and give USC what it has been missing- - a contiguous \"village\" with restaurants, stores, and additional housing. It's incredible to me how much nicer the area around USC is compared to 20 years ago, and this project will make that all the more true. Be sure to visit all the museums across Exposition Avenue - they are world class."
            },
            {
              "review": "The Museum of Natural History and the Los Angeles Science and Industry Center are there as well as an IMAX. Its rose garden is world famous. BUT plan the trip out ahead of time, know where you parked and be very alert to your surroundings, especially after dark. USC is a richly endowed private university smack dab in the midst of a very scary ghetto."
            },
            {
              "review": "USC used to be a second rate college with better graduate schools but has risen in ranking. The campus is very nice, not gorgeous, like some, the students are friendly, there are cultural events on campus, but the local area is not great and even dangerous at times."
            },
            {
              "review": "Take your tweens and young teens on a tour of this, Pomona College and the other Claremont Colleges, LMU and a bunch of other S. California colleges to inspire them. Also, visit the free science museum in Exposition Park across the street, and the NOT-free Natural History Museum."
            },
            {
              "review": "Fantastic campus, and really great buildings. Plus the location and the reputation are without say, unparalleled. I wish I could have worked there or did my PhD there."
            },
            {
              "review": "I had the opportunity to visit campus recently and enjoyed the visit very much . Had a short tour and got a bit of a feel of the very positive vibe there. Great to be part of the buzz and visited the media room for coffee and a catch up chat. Wouldn't go back but would recommend anyone who had the opportunity to go visit.\nGreat to see the Trojan statue"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Parkhurst Galleries"
        },
        {
          "rating": ""
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90731",
            "streetaddress": "439 W. 6th St"
          }
        },
        {
          "Phonenumber": " (310) 547-3158"
        },
        {
          "recommendedlengthofvisit": " More than 3 hours"
        },
         {
			"categories" : [ "Landmark" , "Museum/Art Gallery" , "OutDoor" ]
		},
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Ackerman Mansion"
        },
        {
          "rating": "4.5"
        },
        {
			"categories" : [ "Landmark" , "Public Places" , "OutDoor" ]
		},
        
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90027",
            "streetaddress": "2495 Glendower Ave"
          }
        },
        {
          "Phonenumber": " +1 323 666 6326"
        },
        {
          "reviews": [
            {
              "review": "Please be advised fhat the home still stands but the Museum it featured no longer exists. Mr. Forrest J Ackerman, the owner and curator of this fantastic time capsule of 19th century, 20th and early 21st century science fiction, passed in 2008 and the museum, based in his home on Glendower Avenue, has not been located there for many years. He moved to a smaller home in 2002 and during the years 2002 to 2008 his Ackerminimansion, a mile away, was the remnant of the once huge collection, from 2002 to 2008 diminished to a small but impressive representation of sci-fi art, literature, film and TV props and so much more. Mr. Ackerman coined that term (\"sci-fi\"), that is now used around the world. His amazing home, featuring such treasures as the top hat and teeth worn by actor Lon Chaney Senior in London After Midnight, was open to the public at no fee and was there for the enjoyment and education of all who visited. I had to place a date for my visit from a drop down list but the Ackermansion has been closed for many years and the address has a new owner."
            },
            {
              "review": "Please note that the WGuide link on Tripadvisor is very out of date re the Ackermansion - Forry has moved to a small bungalow at 4511 Russell Avenue, and has had to dispose of most of his collection. Having said that, he still has some great original items that any horror fan would love to see (including Lugosi's cape and ring). Also, Forry (while hard of hearing) is great to talk to about horror icons that he knew, and it's nice to be able to say thank you to him for his pioneering Famous Monsters work. We went to see him (after phoning the week before to confirm) in early Sept 2005, and about 10 other fans turned up, plus a film crew."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "California Aqueduct Bikeway"
        },
        {
          "rating": ""
        },
        {
			"categories" : [ "Landmark" , "Attractions/Things to Do" , "OutDoor" ]
		},
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA"
          }
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    } ,
	  {
      "place": [
        {
          "name": "La Brea Avenue"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "streetaddress": "La Brea Avenue"
          }
        },
        {
			"categories" : [ "Landmark" , "Shopping/Retail" , "OutDoor" ]
		},

        {
          "reviews": [
            {
              "review": "A major thoroughfare in Los Angeles that covers a lot of territory and therefore includes some retail and commercial spaces, some neighborhood green spaces and parks, and lots of pretty and interesting sights. Probably best to do with at least one friend, in the sunlight; I'm not sure I would feel safe by myself at night."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "La Brea Avenue that runs through much of Los Angeles, including neighborhoods good, bad and ugly. It is not a neighborhood. Lots of traffic."
            },
            {
              "review": "This is a really interesting place. Located on Wilshire Boulevarde next to the Los Angeles Museum of Art it shows the history of the pits,the bones recovered and how it all actually happened. There are several talks and a tour of the site which is still a work in progress. It has the big tar pit fenced off but easy to view, in a large park environment..nice to take the kids. The bus stops outfront..dont ask for La Brea thats a street quite a walk away..so we discovered. The driver will tell you which stop to get off at. There is a cafe at the Lacma and clean toilets both in the park and the facilities."
            },
            {
              "review": "belle avenue avec les studios de jim henson, créateur de dark crystal et de la boutique de tatouage de kat von D....LA Ink"
            },
            {
              "review": "Para os amantes de cinema é imperdível passeio/ Em dado momento, senti-me identificada com o lugar; A alma de Chaplin mora ali; studio maravilhoso; realmente recomendo!! Elizete"
            },
            {
              "review": "有名なホットドッグ店、ピンクスがあり、そこから北へあがると右手に99セントショップがあります。さらに北へあがると左に大型スーパーターゲットがあります。大きなコスメショップがあるのでお土産はここで調達できます。ピンクスーターゲット間は徒歩15分～20分ほどです。"
            },
            {
              "review": "Una calle interesante, con algunos negocios para visitar, pero en general es muy concurrida y con mucho tráfico."
            },
            {
              "review": "hay varias tienas muy interesante como L.A ink y wonderland para mi son imperdibles, los estudios de los Muppets en frente y al lado un supermercado con muchas opciones para el desayuno y almuerzo los cupcakes gigantes son lindos y muy apetitosos, al igual que las opciones de almuerzo"
            },
            {
              "review": "このラブレアアヴェニュー自体に何か目的があって、というわけではないですが、移動するときに、車で何度も通りました。有名なピンクスは、この通り沿いにありました。"
            },
            {
              "review": "It is a long north/south road in Los Angeles covering a wide range of districts, some of which didn't look so appealing and some which did. La Brea means tar in Spanish and of course the famous La Brea Tar Pits Museum is around here, but not on La Brea Avenue - it is on Wilshire Boulevard (Museum Mile), a bit west of the intersection of La Brea and Wilshire. There is an amazing ice cream shop along here called Mashti Malone's (at 1525 North La Brea Ave). Doesn't look anything from the outside but was the best ice cream we had in the city."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Sepulveda House"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90012",
            "streetaddress": "12 W. Olvera St."
          }
        },
        {
          "Phonenumber": " 213 624 7300"
        },
        {
			"categories" : [ "Landmark" , "Shopping/Retail" , "OutDoor","Museums" ]
		},

        {
          "reviews": [
            {
              "review": "The Admission: FREE. One of the historic sites on Olvera Street. The Museum: Very Very Very small museum. Took about less than 5 minutes to see all the display. If you are shopping or dining on Olvera Street, pop in and check it out. FREE admission and won't take too much of your time."
            },
            {
              "review": "Most of the house is closed at the moment but you can enter the building and there is a FREE EXHIBITION on the ground floor featuring featuring Senora Sepulveda's Kitchen including an interactive board feature for children. Certainly worth a few minutes yo stop by."
            },
            {
              "review": "Was here while visting olivera street very nice and peaceful great place. To take photos too good place to eat and visit surrounding the area"
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "A Sepulveda House é uma antiga residência, que é atração de El Pueblo, juntamente com a Avila Adobe. Possui linda arquitetura e pode ser visitada internamente. O prédio também abriga um centro de visitantes. Vale a pena!"
            },
            {
              "review": "Este inmueble situado en el centro histórico de la ciudad, es una casa de dos niveles y amplios ventanales de estilo victoriano, se ha convertido en museo en el cual se exhibe menaje de la residencia en perfecta ambientación de finales del siglo XIX y principios del XX."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Lake Balboa Park"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "CA 91406",
            "streetaddress": "6300 Balboa Blvd."
          }
        },
        {
          "Phonenumber": " +1 (818) 756-9743"
        },
         {
			"categories" : [ "Landmark"  , "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "I used to live in the Valley year ago and never visited this park. Wow! Today I visited it while my sons where warming up for a baseball game. The lake is beautiful and full if ducks and other birds that enjoy eating the seeds and bread people bring. There are a lot of benches by the lake to sit and enjoy the scenery. A perfect place to go and enjoy a picnic with family and friends. This is only part if the enormous park which has a gold course, cricket, archery, playgrounds, bike trails, and more."
            },
            {
              "review": "there are a number of nice bike trails around the perimeter of the park along with bike rentals within the park. There are a number of places for a weekend picnic.Food is available within the park as well. Lots of birds and ducks on the lake there."
            },
            {
              "review": "Lake Balboa, which is situated in the Sepulveda Dam Recreation Area, is just one part of a huge park in the valley. You can walk on the many trails throughout out the park, fish in the lake, have parties on the benches and tables of several picnic areas, there is a golf course, plus; there is kayaking, small boat rentals available and a 4 or 5 person cycling with an awning to ride around the park, or you can just have a nice picnic for two on the grass and take your dog too! The valley is usually quite hot from July to September but Los Angelenos enjoy the park just the same...small not: on the weekends, it can get a but hectic with all the people and their kids! (;"
            },
            {
              "review": "Great park! Terrific walking trails, gorgeous scenery with large lake and mountains in the background. There are plenty of benches and tables to sit and relax. Our three year old granddaughter enjoyed the well maintained swings, slides , and other playground equipment. Visited this park several times during our three week stay. Golf courses are right down the road."
            },
            {
              "review": "Nice and peaceful it's just too crowded in the weekends. In general it 8s a lovely place to go away from your busy life and have some quiet relaxing time. Great for gatherings"
            },
            {
              "review": "This park is always hopping with it's golf course, BBQ pits. lake and great picnic sites. But I love it for it's chill work-out scene. It has a trail that starts at the golf club and runs around the golf course. There is a machine circuit on the path that is clean, groovy and almost always open. This is a place where you can go to work out and do it with privacy and cool views. I love this place. Tons of parking too."
            },
            {
              "review": "It's so pretty here, and people don't know it exists! It's a lovely park to walk around, loads of ducks on the lake, and families swarm here on the weekends for picnics and BBQ's and family time. Lots of parking, unless it's a Sunday (get there early), a lot of people use the walk around the lake to exercise in the morning before the sun gets too hot."
            },
            {
              "review": "This is a huge park! You can ride your bike, jog, or just walk around. \nThere's a pond with ducks and beautiful trees.\nPeople bring their dogs and walk them on the leash.\nFree parking , a nice place to spend an afternoon.\n\nThey also have covered and uncovered bench areas which usually get taken up on weekends pretty early.\n\nAs a local this is a hidden jem.\nIf you're visiting Los Angeles I would recommend Exposition Park or MacArthur Park or Central Garden at the Getty Center"
            },
            {
              "review": "Stopped here to look at the birds and ducks and was surprised at how nice it was. The lake is much bigger than I expected. It is probably at least one mile to walk around.\n\nLots of ducks and other types of birds there - egrets, herons, cormorants etc. \n\nBeautiful park there as well. \n\nIf you looking for a nice place for a picnic, to walk or just relax and watch the birds or people walk by, this is the place.\n\nBTW, it's now called Anthony C. Beilenson Park."
            },
            {
              "review": "The Family Photoshoot is intended for Christmas Cards to be sent to close Families and friends during this forthcoming Christmas Celebration and to record as well the one month baby boy Silas's development and growth. The Place is well visited with many attraction to see like variety of Birds' Specie in the lake. Coots have a great numbers that one can really enjoy in feeding them. Our two yr. old baby girl Maddie, who is very matured in her age enjoyed tremendously in feeding the coots and ducts that sometimes she has the opportunity to touch them. She always want to go to the park. Visitors always filled the park but close at 5PM. and one will notice visitors are not moving though it is very close to 5PM."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "L.A. Live"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90015",
            "streetaddress": "800 W. Olympic Blvd."
          }
        },
        {
          "Phonenumber": " 213-763-5483"
        },
         {
			"categories" : [ "Bar" , "Restaurant/Cafe" , "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "Its very lively place. Amazing bars and restaurants. Positive energy. Just great to be there. It is downtown and most happening place in LA"
            },
            {
              "review": "LA Live is a great hangout spot. Has multiple eateries. Staples center in same area. Walking distance to everything. Really exciting experience."
            },
            {
              "review": "This is a great spot to hang out, especially if you are staying at one of the connected hotels or have just attended an event at the Staples Center. The multiple LED board provide a cool atmosphere at night and there are plenty of food and/or nightlife options. Also a great place to people watch."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "First timer being in LA and this place is over whelming!! THere is so much to do and the night life is amazing.ALways something going on"
            },
            {
              "review": "It was splendidly nice a lot of hospitality... One of the best vacation I've ever had.. I can't wait to go alone with my mate as a couple."
            },
            {
              "review": "Came here a couple times for a concert at LA Live and to see a 4D showing of Ant Man at the Regal Theater here. It's good place for entertainment almost like an outdoor mall. It requires a bit of walking to get from end to end though."
            },
            {
              "review": "Stayed 3 nights in JW Marriott for a conference. Spent some time walking the environs. Except for the hotel's front entrance hedge, not a green space in sight - and little left of the pathetic, drought-stricken twigs planted along the streets.\n\nThe plaza was hoatching with kids in funky dress attending the Shania Twain and Taylor Swift concerts in the Staples Centre. Restaurants are generally over-rated and over-priced."
            },
            {
              "review": "I really like the vibe here @ LA LIVE!! If you like the big city lights, tons of places to eat, places to drink, and truly enjoy hanging out with your buddies, this is the place to do it in downtown LA!! It's nice to see so many people having fun just being out. Best of all, if you're here on business at the Los Angeles Convention Center, it's only a few blocks away!\n\nUntil then, Cheers! ~ :p"
            },
            {
              "review": "A fantastic Place for enterteinment. Wether you want to go to the cinemas, consert or a nice restaurant this place got it all. But if your use to 24/7 service you will be disappointed. They start to close down around 23."
            },
            {
              "review": "LA Live is great place to hang out. At night time is when it really comes alive with all the LCD screens and lights. The visual effects are excellent. They have about 20 restaurants there to eat from high end dining to burgers. Even though they have 20 restaurants, it does seem limited on variety of food. Most dining places are gigantic. It would of been cool to have a lot more of small to medium restaurants and bars. Then you could go bar-hopping. However, the place is well designed and really nice. The area around in downtown LA is kinda sketchy but trending up."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Top Boat Tours in Los Angeles"
        },
        {
          "rating": ""
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Tischler House"
        },
        {
          "rating": ""
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90049",
            "streetaddress": "175 Greenfield Avenue"
          }
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Venice Beach"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90291"
          }
        },
        {
          "Phonenumber": " 310 399 2775"
        },
        {
          "recommendedlengthofvisit": " 2-3 hours"
        },
        {
			"categories" : [ "Landmark" ,  "OutDoor" ]
		},
        {
          "fee": " No"
        },
        {
          "reviews": [
            {
              "review": "don't wear a hat its very windy there , beautiful beach amazing pear crazy seagulls (watch out they will still yore food they crazy nasty birds...)"
            },
            {
              "review": "To feel the true and unique feel of the city, cycle around the venice beach. Brimming with activities, quiet beach lined with private villas along the water."
            },
            {
              "review": "Venice Beach is different, is insane, is young, is California. Don't expect a standard welathy California beach, here it's the space for rollers, jammers and pop-generation chaps that make you feel you are in a different place. My two cents : sit in a bar, take a sandwich, relax and look around, you will not be disappointed!"
            },
            {
              "review": "The part i liked about it was that it was not over crowded, cool and serene. It was a bright sunny day and the water on thee beach with the white sand looked amazing"
            },
            {
              "review": "There is a huge cast of characters and things to see while visiting Venice beach. Food on the beach is pretty good but who wants to eat. You might miss a random show or other surprise while walking along. Go and visit at least once. You won't regret it."
            },
            {
              "review": "Where else could you get kush (medical marijuana) right next door to an ice cream store? Only at Venice Beach, that's for sure. Such a diverse array of people, shops and street performers. Had to go just because, but won't go back."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "venice is a great place to people watch. if you go on the weekend or a holiday it is very busy. Lots to see, nice restaurants to eat at or just sit on the beach."
            },
            {
              "review": "The weather was nice and sunny when been to this beach. The beach is really beautiful with nice clear blue water and white sand."
            },
            {
              "review": "To me Venice is west LA's version of Hollywood Blvd. Nothing about it is real. It's a show. So if you only have 20 things to do and see in LA then skip this. But if you do want to see your own version of a funny circus show then certainly visit. It's a good laugh. The surrounding Venice with the canals is much more interesting than the boardwalk. If you do visit the walkways around the canals then look up the history of why they are there. It's an interesting story and will make you appreciate it more."
            },
            {
              "review": "All week I'd been dying to get to Venice beach. I had booked myself in for a couple of tattoos at Ocean Front tattoos and was not disappointed! Took a little while to get there due to public transport issues but we made it with plenty of time. \nWhen we got there, the views was absolutely stunning. So much golden sand, clear blue skies and lovely blue sea. We walked up and down the boulevard, stunned by the entertainment going on, all the bike riders, the rollerbladers, the skateboarders - not a single person with frown on their face!\nWe stopped off for lunch at one of the many restaurants and sat outside to take in the view! If anyone was to go to LA I would definitely suggest checking out Venice beach without a doubt!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Top Kayaking & Canoeing in Los Angeles"
        },
        {
          "rating": ""
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Palace Theater"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90014",
            "streetaddress": "615 S Broadway"
          }
        },
        {
			"categories" : [ "Movies" , "Theatre" , "OutDoor" ]
		},
        {
          "Phonenumber": " 213-629-2939"
        },
        {
          "reviews": [
            {
              "review": "9.29.13 - saw a outstanding production by Lemi Pontifasio performed by a 10-member ensemble of Maori women through choral work and chants. Thumbs up to the set designers for the dynamic effects. The ambience in this old theatre works well to accentuate the sombre mood. Our only complain was the seating arrangement being eye-level to the harsh row of lights installed at the edge of the stage. At first I tried to cut the glare by shading my eyes with my hand over my brows. That didn't work for very long because my hand got numb. Our last resort was to put on sunglasses.\nThis small theatre must have been quite elegant in its heyday. Hopefully it is going to be restored and re-purposed to contribute to the re-vitalization of Historic downtown LA."
            },
            {
              "review": "The Palace is a great venue. I recently went there for a concert and it is great.Just don't fall down the stairs when you are walking towards the stage."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Audubon Center at Debs Park"
        },
        {
          "rating": "5.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90031",
            "streetaddress": "4700 North Griffin Ave"
          }
        },
         {
			"categories" : [ "Landmark", "OutDoor" ]
		},
        {
          "Phonenumber": " 323-221-2255"
        },
        {
          "recommendedlengthofvisit": " 1-2 hours"
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "I swear that I come across some of the most interesting low key kids places in the darndest places. This would be one of them. This Audubon center has kids making field trips here as well as parental trips on the weekends. I instantly knew when I realized what was happening here, that the munchkin would love to stop by.\n\nThis Center is a great starting/stopping point if you want to hike through Earnest E Debs Regional Park. It sits on the southwestern edge and has a parking lot with a roundabout. The parking spaces are over dirt with a paved road. They have public restrooms that the hikers can easily access as well as visitors to the center. Best of all, this place is FREE to visit and get a nature lesson for your tots. Or at least an opportunity to interact with something tangible in lieu of electronics or iThings. That alone is priceless!\n\nPro Tip: You can host a kids birthday or other party here for a slightly different outlook on birthdays =)\n\nThey have a short children's nature walk, multiple interactive features made for munchkins, a kids clubhouse, picnic tables, a classroom/small auditorium for lessons or speakers. There is also an information room with an attendant on duty willing to share different aspects of the park, Audubon center, native flora n fauna, animals, or stuff like that. Another fun feature at the entrance and on the edge of the roundabout is a koi pond... but they don't have koi fish in it that I saw, however it had some guppies and a few lily pads.\n\nOverall though this place seemed very kewl for the little ones. While I was in the information room, a little boy and his dad stopped in and handed over a field trip something or other for a prize. Both seemed rather happy IMHO. That is something that I think should be encouraged continually.\n\nPro Tip #2: The parking lot is closed when the Audubon center is =X\n\nDefinitely a fun quick freebee kinda place to stop in and burn an hour or stop by after a hike... it makes for some relaxed nature interaction, even for a grown up... or someone who refuses to grow up like me =)"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Olimila Gourmet Emporium"
        },
        {
          "rating": ""
        },
        {
          "operation": [
            {
              "days": "Sun",
              "time": "9:00 am - 4:00 pm"
            },
            {
              "days": "Mon - Sat",
              "time": "10:00 am - 8:00 pm"
            }
          ]
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "91604",
            "streetaddress": "11923 Ventura Blvd"
          }
        },
        {
          "Phonenumber": " 818-358-8950"
        },
        {
          "recommendedlengthofvisit": " <1 hour"
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        },
         {
			"categories" : [ "Landmark" , "Art Gallery" , "OutDoor" ]
		}
      ]
    },
    {
      "place": [
        {
          "name": "Department of Water and Power Building"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90012",
            "streetaddress": "111 North Hope St"
          }
        },
        {
          "Phonenumber": " Not applicable"
        },
         {
			"categories" : [ "Landmark" , "Public Places" , "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "My longtime friend worked here for many years and I took my wife to see it. I didn't know it was iconic? I don't think it should be. Perhaps it was nice many years ago but not sure why this place is even listed. Don't bother to go out of your way as there is nothing much to see here."
            },
            {
              "review": "When this very attractive mid-century modern building was built, when lit up at night it was like a beacon to the future, and its black-bottomed pools a symbol of plenty. Not any more."
            },
            {
              "review": "Unique building with some historical artifacts inside from the larger water and power construction projects in Los Angeles."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "A pesar de ser un edificio público, los alrededores y la fuente son relajantes, Hay espacio para tomar unas buenas fotos de la plazoleta justo en frente del edificio"
            },
            {
              "review": "Drove a friend to an eye surgery appointment nearby and was hoping to charge up before the long drive back up north. All the area garages required a small fortune (up to $4 per 10 minutes) to park and not all offered electric vehicle charging. I drove around and around until I finally found this place. Very nice and helpful security guard handed me a pass for 4 hours. After that, there's a fee, but that was all I needed. Thanks Dept of Water and Power for supporting clean air!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "East West Players"
        },
        {
          "rating": "5.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90012",
            "streetaddress": "120 Judge John Aiso St"
          }
        },
        {
          "Phonenumber": " (213) 625-7000"
        },
         {
			"categories" : [ "Theatre" , "Shopping/Retail" , "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "I've been following the East West Players since the 80's so this tells you how long the company has been around and they go back even further. The performances in the old Union Church provides intimacy with the audience as every seat in this small theater, including the balcony, offers a good view. Glitzy props are not visible here, just the basics and a good story is all that's needed. \n\nThey offer a some discounts and perks so be sure to do your homework. You will feel some of the inconveniences from a building built in 1923...narrow stairways and cozy bathrooms, but it's worth the price for entertainment in a National Register of Historical Places."
            },
            {
              "review": "I was invited to see this play. Knew nothing about it or the history behind it. It was wonderfull. It never had a dull moment. The pace of the stoty was amazing. The actors where very nice and you can actually talk to them if you wait outside. It really was a great cultural experiance."
            },
            {
              "review": "I attended the production of Three Year Swim Club at the East West Players Theater in Los Angeles. It was delightful. It is 1 1/2 hours long. The acting is superb. The theater is very intimate. I really loved the message that comes so clearly through to the audience about \"Reaching for the Stars\" and never give up. It is based on a true story and the actual people portrayed did do wonderful things and achieved what they set their minds to accomplish. It is certainly a treat to see this production."
            },
            {
              "review": "We attended the One Night Only event at the East West Players home theatre downtown and were delighted. The venue is just the perfect size, and the building itself has its own history. But more than that, this company gives a voice to actors that might not be cast in mainstream venues, and we found that to be both refreshing and a little sad that this happens to be true. This particular show showcased young Asian talent from the area, and the quality of the performances was truly over the top. We noticed in the program that season tickets were highly affordable and this year's line up of shows promises to be excellent. Give East West Players a look!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Vista Hermosa Natural Park"
        },
        {
          "rating": "4.5"
        },
        {
          "operation": [
            {
              "days": "Sun - Sat",
              "time": "8:00 am - 8:00 pm"
            }
          ]
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90026",
            "streetaddress": "100 N. Toluca Street"
          }
        },
          {
			"categories" : [ "Landmark"  , "OutDoor" ]
		},
        {
          "Phonenumber": " +(1)213-250-1100"
        },
        {
          "reviews": [
            {
              "review": "First time Ive seen a view of la skyline this close and perfect for picture taking. Will definitely return to take more photos."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "Маленький уютный парк в каменных джунглях ЛА. Люди приходят сюда из-за того самого холмика со скамеечкой, откуда открывается шикарный вид на небоскребы Downtown LA. Кто любит красивые виды, тем советую посетить. Можно недолго поваляться на газоне. Однако больше там делать нечего."
            },
            {
              "review": "Uno dei punti più interessanti per fotografare lo sky line di Los Angeles .\nAbbastanza vicino ( occorre ricordare che a causa dell'inquinamento , se sei lontano le riprese sono tutte offuscate)\n\nDa vedere"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },    {
      "place": [
        {
          "name": "West Los Angeles Buddhist Temple"
        },
        {
          "rating": "4.0"
        },
        {
          "operation": [
            {
              "days": "Sun - Sat",
              "time": "10:00 am - 4:00 pm"
            }
          ]
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90025",
            "streetaddress": "2000 Perdue Avenue"
          }
        },
         {
			"categories" : [ "Landmark" ,  "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "esta região de Los Angeles tem uma forte influência japonesa. Foi ótimo caminhar pelas ruas e ver a arquitetura e o tempo budista tem um lindo jardim que foi legal visitar."
            },
            {
              "review": "Not only is it a nice, quiet, and serene place to sit and be with yourself...which is very hard in L. unless one goes hiking, but they have a wonderful annual festival every July. The Obon Festival (pics included) just occurred and it was their 66th year in the making! They have food, games for the kids young & old, a /bonsai tree showcase, historical documents about the Japanese-American community, and drumming/dancing..where all can participate."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Drum Barracks Civil War Museum"
        },
        {
          "rating": "5.0"
        },
        {
			"categories" : [ "Landmark" , "Museums" , "OutDoor" ]
		},
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90744",
            "streetaddress": "1052 Banning Boulevard"
          }
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "We found this real neat museum off the beaten track. We had a personnel docent, America Lopez whom was very knowledgeable and personable. We enjoyed her tour very much."
            },
            {
              "review": "A great museum with lots of Civil War history in California! Many visitors are surprised that California played such an important role in the Civil War.\nThe staff is very friendly and helpful. It is important to take one of the guided tours as there are many interesting facts to be learned. Tour takes about 90 minutes.\nHighly recommended for anybody interested in Civil War history."
            },
            {
              "review": "Be sure to call first for times they are open it may vary,\nand plan your trip during the day, and you should have no problems. but this is a little rough at night in this area.\n\nThe Civil War info and items they have are interesting to see,\nand where else can you see it out west.\nLow cost attraction, its worth your stop, if your a fan of \nHistory."
            },
            {
              "review": "Sometimes we forget that a modern city like Los Angeles does have its own unique history and has more to offer than amusement parks and beaches. The Drum Barracks Civil War Museum is an amazing part of Los Angeles history. Who knew that Los Angeles had a connection to the American Civil War? Indeed it did and the history comes live in the Drum Barracks. \n\nCalifornia was relatively new to the US when the Civil War began. It was California gold that helped finance a good portion of the Union's efforts in the Civil War. 3,000 Union soldiers were sent to protect the Los Angeles harbor at San Pedro and here the story begins.\nThe soldiers were housed in several buildings but very little remains but thankfully, what became known as the Drum Barracks survived the years and is wedged in a residential neighborhood.\nThe Museum has been lovingly preserved and is worth visit for anyone fascinated with history. \n\nThe museum is open for guided tours and on a very limited schedule so be sure to check their website for tours. I was lucky to be the only person on my tour and had a most remarkable experience with a young guide who loved history and was willing to take his time to explain the artifacts in each room. Each room has a true connection to the Civil War and one of my favorite items was an actual Gatling Gun.\n\nThe Drum Barracks also has another unique claim to history. It was here that several camels were housed during an ill-fated experiment to use camels in the military. Here is one very special museum that locals and visitors should not miss.\n\nJust down the street is the beautiful Banning House museum that is another must see. A short distance away is San Pedro and the harbor. The museum has a very nice gift shop with items relating to the Civil War. It's also well worth a visit.\n\nDon't miss this incredible piece of history."
            },
            {
              "review": "Myself and husband took our son age 9 and his buddy age 7 who are very into Civil War and our other Wars, this was such a treat for ALL of us!! Out tour guide(must take a tour $5 for adults kids free) was a very very nice you gal named America! She was so knowledgeable and fun!! The tour is about 90 mins long I'd say and can be very warm in the building and rooms. There is a nice little gift shop too and a park across the street! We loved everything about it and it's history(you can look it all up online). They even have the actual signatures of Pres Abraham Lincoln and Ulysses Grant and so many more!! A Gatling gun and an entire room of all weapons(at the end of the tour)! So worth it!!! No photos allowed inside the rooms. The history of the camels there is great!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Wat Thai of Los Angeles"
        },
        {
          "rating": "4.5"
        },
        {
			"categories" : [ "Landmark" , "Church/Religious Organization" , "OutDoor" ]
		},
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "91605",
            "streetaddress": "8225 Coldwater Canyon Avenue"
          }
        },
        {
          "Phonenumber": " 818 780-4200"
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "My wife and I enjoyed visiting this temple and relaxing a bit from our otherwise\nhectic day in LA. The temple looks like some temples in Thailand, it has the statues and other figures to show the Buddhist culture and lifestyle. It looks\nlike a great place to come to for locals and visitors. The location was handy for us to \nfind, as we were in Thai Town, and it was only about 15 minutes away. We were glad that we located this temple and spent some time there."
            },
            {
              "review": "First things to say, I am neither Thai nor a Buddhist. \nThis beautiful example of a reasonably sized Thai temple (wat) is on a busy road in the Fernando Valley. There's the usual large temple up some stairs, or ramps. There are also several smaller temples of various sizes in the grounds. \nThis is an active, working temple. As always everyone is welcome as long as the basic rules (no shoes, don't point toes towards the Buddhas if you kneel/sit). \nIt is just so peaceful in there. You can light a candle if you wish. You can take and light a joss-stick for planting in a sand tub outside the door. You can sit in one of the chairs for as long as you like. \nI will revisit before my weeks in LA are up."
            },
            {
              "review": "This place has a mystical vibe and peaceful energy about it that is very similar toThailand and I recommend everybody to visit the location. They serve food on the weekends that is pretty cheap but a little greasy but very tasty. It is strictly there type of food from noodles, soups curries deserts coconut drinks and more. You can visit and speak to the monks and Thai's there that will talk to you will share there knowledge. The people are so friendly. The temple is huge and you can't miss it if you drive by. Parking at times can be difficult especially during there 2 festivals in April and November usually during the weekends. If your visiting Los Angeles go and cheak it for a hour or two. Thailand and the people are my favorite in the world. Enjoy, Dave"
            },
            {
              "review": "Wat Thai is a Buddhist temple located in the San Fernando Valley. Los Angeles has a huge Thai population, many living in North Hollywood, just south of this temple. The best time to go is on Sundays or during a Thai festival. Last year, I visited the temple during the Thai New Year (Songkran festival) which happens mid-April and it was pretty amazing - live music, lots of people, tons of cheap food stalls.\n\nOn Sundays, there is a modest food court downstairs that sells typical Thai fare like Pad Thai, papaya salad and iced coffees. Most of the dishes are are around $3-7. The proceeds go to the monks and the temple.\n\nParking is available on the streets in the surrounding neighborhoods, as well as at the Temple - entrance is on Cantara Street. If you go during a festival or holiday, expect to park several blocks away and walk (or follow signs for their parking shuttle)."
            },
            {
              "review": "サンフェルナンドバレーに有るタイの寺院です。お正月に行きましたが、お坊さんが多数いらして、新年のお祝いをしていました。"
            },
            {
              "review": "I'm not Thai but have been to Thailand a couple of times and I feel in Thailand when I visit this colorful temple. It is authentic Thai. Visitors should respect the main Buddhist traditions: shoes off, no expressions of affection in the temple - definitely don't touch a Thai person on the head - and don't point your feet towards the Buddha statues if you squat down on the floor. I recently visited at a weekday lunchtime and walked into the dining rooms where the Temple shares unused food given earlier in the day to the monks as merit. I was made welcome to sit down and share some delicious leftover Thai food. I am not sure if this was unique as nobody spoke English and I was not able to ask. I was not asked for money but made a small donation inside the Temple. Those of you who are familiar with the Thai people will know of their extraordinary generosity. I have a feeling I was just a lucky duck on the day. Anyway, don't count on having a similar experience, but do enjoy a peaceful and calm (maybe enlightening) interlude at Wat Thai. What a treat to have such a place in crazy LA."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Theatre West"
        },
        {
          "rating": ""
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90068",
            "streetaddress": "3333 Cahuenga Blvd. West"
          }
        },
        {
			"categories" : [ "Landmark" , "Theatre" , "OutDoor" ]
		},
        {
          "Phonenumber": " 323-851-4839"
        },
        {
          "reviews": []
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Hollywood Farmers Market"
        },
        {
          "rating": "4.5"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "streetaddress": "Ivar Ave"
          }
        },
        {
          "reviews": [
            {
              "review": "A lot of different restaurants to choose from. Nothing too good though. Fried everything. There might be a few gems in there but they must be really hard to find."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "Wide variety of items from prepared foods and fresh produce. Wished we could have visited longer. Also, wished we could take foods back home on the plane. It's in the heart of Hollywood and a nice escape from some of the tourist traps."
            },
            {
              "review": "On our whole trip the California we visited a few different famers markets. This one was by far the best. The best selection, variety of items. We bought some amazing bread and nuts. Need one of these markets close to me for sure!"
            },
            {
              "review": "Primarily fruit and vegetable stands. When I visited there was only a single fishmonger, don't recall any butchers. Single florist. One or two cheese stands. Number of street singers sprinkled throughout. Not a large farmer's market, very walkable. Great way to spend a relaxed Sunday am, do a bit of people watching, grab a bite or two, and some fresh fruits and vegetables."
            },
            {
              "review": "This is the place for reasonable food and shopping. We had a very good meal and did some shopping. Wish we had more time because the shopping was rushed but we'll definitely come back only saw a small piece of it. Even my teenagers liked it.\nOk I did buy all 3 new hats and my daughter sunglasses. So call me a cheater.\nThey still had fun!!!!"
            },
            {
              "review": "This a Great place to meet your friends or come solo to get everything,\none of my best stop's , Was @ \nThe Bernard Ranches booth in front of the Library on Ivar. It was Totally Amazing ! V. Bernard \"the grower\" grows w/ Seaweed (kelp)..This make's everything taste wonderful & all Natural ! \nalso next door is the J & J OnlyDaughters Ranch ! Awesome place as well ! Great avocado's and everything else under the moon ! All Grown W/ much Love & All Natural"
            },
            {
              "review": "Stopped here for a quick bite during our tour. Neat place with plenty of food choices.. Mexican/ seafood/ sushi/ Korean / feel good food in one stop.."
            },
            {
              "review": "This was one of the stops on our tour of LA and we ate lunch here. A Farmer’s Market sounds inexpensive but not here, OMG! They wanted so much for something so simple. I understand the simplicity of it but seriously? 10 dollars for a small sandwich? We had to eat since it was an all day tour so we did it but never again."
            },
            {
              "review": "This farmersmarket is super expensive and doesn't really have a feel to it. Does have tasty food, but given the price, I'd prefere other spots. But still you should see it to have experienced it!"
            },
            {
              "review": "This place is an organized labyrinth of Stall and cabins with an incredible selection of international food.\nCommunal seating areas make it easy to have different foods shared by friends and families.\nThe area is very safe and parking is a breeze.\nJust up the road from it is the Mall shopping area where you can walk from shop to shop but be careful you do not get run over by the Tram!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Pershing Square"
        },
        {
          "rating": "3.5"
        },
        {
          "operation": [
            {
              "days": "Mon - Fri",
              "time": "9:00 am - 5:30 pm"
            }
          ]
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90015",
            "streetaddress": "Boundaries are South Hill St, South Olive St, West Sixth St, and West Fifth St"
          }
        },
        {
          "reviews": [
            {
              "review": "Farmers market stalls and prepared food stalls line the perimeter of this large concrete space in the middle of downtown. A children's playground with soft flooring is available, too. Can't say it's worth a special trip, but if you are around, stopping by is easy and interesting."
            },
            {
              "review": "Live performance, food truck, arts & crafts activity, etc. It is a fun place for the kids!! However, it can be very crowded~ There are many seating area. Definitely a fun family outing idea!!!"
            },
            {
              "review": "In the middle of the city and a nice place to check out homeless people. The only time this place is not so bad is when they hold events here."
            },
            {
              "review": "Something that many people don't know about Pershing Square. It's across the street from the LA Diamond District. Most of the tall buildings have many jewelry stores, commercial and retail. My husband bought my engagement diamond ring there in 1953. Then years later my son also bought his sweetie's engagement ring there. Note: both marriages are still going strong!"
            },
            {
              "review": "If you're in the area I would walk around it, but I wouldn't go out of my way to visit here. It also looks good if your room at the Biltmore is facing down on it."
            },
            {
              "review": "No peace here because of the homeless people. Should be an oasis in the middle of the financial district. I actually got accosted by one homeless person who was very persistent, I struggled to shake him off. Still, it was potentially a nice spot, save for what I already mentioned."
            },
            {
              "review": "We were here for an appointment steps from this park so we came to sit here but I would definitely not make a special trip to come see this. On our Monday morning we did see a lot of homeless."
            },
            {
              "review": "For a district that has hotels and banks and other great (if a little run down) buildings, this square is a bit of a void. I guess it's functional, there is a metro and you can park there, but I don't know why it's not something better"
            },
            {
              "review": "OMG This City is full of homeless people in every metro station, park, sidewalj. Si horrible and the sidewalks stink to piss. Horrible"
            },
            {
              "review": "just got off the bus and needed to relax and found this great spot, colourful right in the heart of downtown and a bit artsy definently a recommended spot to sit and chill read a book and relax"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "The Little Theater"
        },
        {
          "rating": "2.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90025",
            "streetaddress": "122420 Santa Monica Blvd."
          }
        },
        {
			"categories" : [ "Landmark" , "Theatre" , "OutDoor" ]
		},
        {
          "Phonenumber": " 310-622-4482"
        },
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "We thought we were attending a Pinocchio puppet show with our son. Instead, it was a live show played by unprofessional adults. Everything about the performance was very amateurish. You would think in the Los Angeles area there would be many singers, actors, dancers, wannabe directors who could pull off topnotch entertainment. Not so here. For $15 a ticket, \"quality theater\" takes on a poorly-directed, primary school, dummed-down aspect. The actors didn't know their lines well and had no rapport with the children in the audience. The whole show was not well thought out and completely unmemorable right down to the props. The production we saw was delayed to wait for a party to arrive. Fifteen minutes later, the group was a no-show. Several announcements were made for children to go to the restroom during the wait because it was located behind the stage. My husband and I could have played, danced, and sung the parts as well or better than these actors...and he is tone deaf. Seriously, even the children were not impressed."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Bradbury Building"
        },
        {
          "rating": "4.5"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90013",
            "streetaddress": "304 S. Broadway at Third Street"
          }
        },
        {
          "Phonenumber": " 213 626 1893"
        },
        {
			"categories" : [ "Landmark" , "OutDoor","Theatre" ]
		},
        {
          "reviews": [
            {
              "review": "Take a walk down Broadway;and across from the Million-Dollar Theatre, is the amazing Bradbury Building. A turn-of-the-century architectural gem;used as a location for things from The Outer Limits (Man with the Glass Hand)to Blade runner.Don't stop outside;the indoor lobby with its open-air wrought iron elevators and amazing staircases."
            },
            {
              "review": "For those that loved this movie, you need to see this building. It is worth a short detour when walking around downtown and braodway district."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "Part of a walking tour of Los Angels, this building is absolutely worth the stop. Beautiful, great for photos, full of history, it's an active office building but they have lots of info on the ground floor about the history."
            },
            {
              "review": "This little hidden gem is across from the grand central market :D it was a 2 minute walk from there to here and the architecture of this building is unlike anything you will ever see here in los angeles"
            },
            {
              "review": "The newly remodeled Bradbury Building gives you an idea of what LA looked like at the turn of the century. (1893) It is a working office building so you can only see the lobby and go up the first landing. A must see."
            },
            {
              "review": "Do androids dream of electric sheep? Beautiful building steeped in the atmosphere of one of the greatest sci-fi movies of all time."
            },
            {
              "review": "if you love Architecture you should love the atrium interior of this building. Although nothing special from the outside, the moment you enter you are in for a treat in this building. The detailing on the stairways surrounding the central sky lighted atrium are like eye candy. Access is limited to the ground level only so as not to disturb tenants. It's worth a drive or metro ride to downtown if only to see this, but when you are done enjoying this lovely interior, which has a kind of cult like fan base of the film \"Bladerunner\" as part of the film was shot there; take a stroll across the street to the Central Market for lunch. Lots of choices, but you cannot go wrong with Del Campo's organic beef or lamb burgers."
            },
            {
              "review": "If you enjoying seeing; what was, architecture, movie trivia, beautiful craftsmanship, LA's history, unique things ~ then check out the Bradbury Building."
            },
            {
              "review": "Very cool ironwork and old interior. I always heard about it and never saw it while we lived in LA. It's work a walk over if you're in the area. The only area you are allowed in are the first floor and stairs for photos, etc. as it is a working office bldg. Very cool interior. Just takes a few minutes to get the feel of the architecture."
            },
            {
              "review": "With only a couple of hours spare in LA I had to choose wisely as to what to see and do. The Bradbury Building was a no-brainer. As a huge fan of Blade Runner I couldn't visit the city and not visit this iconic location. I wasn't disappointed.\nLess imposing from the outside, it isn't until you step into the atrium that the full, stunning architecture hits you. It's all there, the tiled walls, the staircases, the mechanical lift and the glass roof. As it's still a residential building you can't go about the first floor staircase (or use the lift), but there is still plenty to see from here. And it's free to walk in and look around."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Holyland Exhibition"
        },
        {
          "rating": "4.0"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90039",
            "streetaddress": "2215 Lake View Ave"
          }
        },
        {
          "Phonenumber": " +1 323 664 3162"
        },
        {
			"categories" : [ "Landmark" , "Church/Religious Organization" , "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "The whole point of this exhibit is to prove since Jesus is a desendent of Shem, it must mean that Jesus was white. They have decided that the Lord made everyone from three pots of clay; white, black and red. The white clay being of most value. There were many Egyptian artifacts in the room. One has to assume they were removed from Egypt prior to it being illegal to remove such artifacts. A very rude awaking of someone's interperation of the Bible. I can sum this up by stating I am white and have a strong beleif in the Lord. He would never approve of such racially charged overtones to his Life."
            },
            {
              "review": "just called to check admission time, and the lady was extremly rude.saying that i bettet tell her what time we are coming.i was really interested in going BUT if customer service is gonna be rude, then NO THANKS.i am visiting LA and i want to do things that are fun.ridiculous!"
            },
            {
              "review": "A hidden gem worth finding. My wife,daughter and I took the tour and were impressed and not only saw a great exhibit but learned bible history. If you are looking for a nice two hour tour you will not be disappointed. Off the beaten path but easy to find in Silver lake"
            },
            {
              "review": "I visited this place about 15 years ago and was just blown away because of the amount of artifacts on display. Plenty of photos also. It really is a hidden treasure. Nothing fancy and the spaces are small. Anyone interested in archaeology or history will appreciated this place. The refreshments (tea) at the end is a nice touch. Small gift shop available."
            },
            {
              "review": "This is a don't miss if you are at all religious & in the Los Angeles area! This museum, founded in 1924, is certainly one of Southern California's forgotten gems. The collection here contains a wealth of Middle Eastern artifacts, some of which are more than 2,000 years old. Collected by explorer Antonio F. Futterer during his years abroad, some of the smaller items here include lamps, bottles and coins. The impressive mummy casket dates 600 years before the birth of Christ. Today the museum can be visited only by appointment for a small fee, which covers a tour. Go to their website for more information. I have to say that I understood the Bible a lot better after visiting this museum & touching all of the thinks that Jesus would have. Very inspirational."
            },
            {
              "review": "我們一組17人，度過了一個難忘的星期五夜晚（8-10 PM）。貝蒂和凱倫，兩位無薪的志工，非常幫忙，他們願意在這麼晚的時間來作我們的嚮導。博物館門口路邊有充足的停車位。博物館共有五個展覽廳。主廳陳列一幅巨大的掛圖，顯示聖經中37個事件發生的地點（創世紀，出埃及記，民數記，申命記，約書亞記，列王記下，歷代志下，路加福音，使徒行傳），以及從亞當到耶穌4000年的家譜詳圖。大馬士革廳在二樓，珍藏亞述帝國和巴比倫帝國的家具，藝品和文物。埃及廳和伯利恆廳在地下室有一具木乃伊，及數以百計的中東文物和服飾。考古工作廳包含300多張有關舊約聖地的幻燈片，以及從美索不達米亞，巴勒斯坦和埃及收集的燈，罐，錢幣。販賣部一側展示著更多的聖地藝術品，另一邊出售價格合理的紀念品。 【從亞當到耶穌，家譜圖】和【從伊甸園的亞當到羅馬的保羅，200題聖經問答】，是理想的紀念品。我唯一惋惜的是，我們只有兩小時的參觀時間，太短了。您可以在這個小小的博物館花上3-4個小時，仔細地看。我衷心建議參觀聖地博物館。（以上由我讀高中的兒子提供）。"
            },
            {
              "review": "This a great place to visit if you like archeology and history and have a couple of hours. I've been to this place about 5 times in the last year, but have been visiting for the last 20 years. It is a great place to take family and friends. Every visit is different and you get to see many new different artifacts or thins you missed in prior visits. A previous reviewer indicated that they have bad customer service. I've been the so many times, it has always been pleasant. You can visit this place by appointment only, that is why they ask at what time you want to come in. They take 1 person or 100. You get a docent tour and you can ask questions. My kids always have fun when it comes time to dress up, during the tour. This place has artifacts brought back to USA in the 20s. This is the Phonenumber (323) 664-3162. You can also visit the small store and purchase really cool stuff at great prices."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "Mosaic Tile House"
        },
        {
          "rating": "3.5"
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "streetaddress": "Venice Beach, CA"
          }
        },
        {
          "recommendedlengthofvisit": " 1-2 hours"
        },
        {
			"categories" : [ "Landmark" , "Museums/Art Gallery" , "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "Spent an hour walking the streets looking for this house and asking locals but no-one had heard of it. Very disappointed."
            },
            {
              "review": "If you have a friend that needs some cheering or likes Mosaic/Art, his is the place to go for an hour or 2. The colors the Artist everything is unbelievable. It's truly a ONE of a kind experience! The artists are friendly & fantastic. You can take a tour for very little $ & after get lunch at nearby restaurant."
            },
            {
              "review": "NO REVIEW"
            },
            {
              "review": "Venice Beach is full of art, crazy free spirits, and murals, but our favorite place by far has been the discovery of the Mosaic Tile House, owned and curated by artists Cheri Pann and Gonzalo Duran, full of handmade tiles, mirrors, toys, flattened bottles, wires, and offbeat layers of unusual found objects covering every square inch inside and out of their home! We found them online, and called for a personal tour, which the lovely Ms. Pann conducted, taking my son, my husband and me through the most beautiful art house we'd ever seen! 20 years of hard work and much fun is visible on every surface, and their own personal artist studio in the back is full of large paintings and art pieces that are wonderful as well! Get to know the spirit of Venice Beach by meeting these fabulous people!"
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    },
    {
      "place": [
        {
          "name": "La Brea Tar Pits and Museum"
        },
        {
          "rating": "4.5"
        },
        {
          "operation": [
            {
              "days": "Sun - Sat",
              "time": "9:30 am - 5:00 pm"
            }
          ]
        },
        {
          "address": {
            "addresslocality": "Los Angeles",
            "addressregion": "CA",
            "postalcode": "90036",
            "streetaddress": "5801 Wilshire Blvd"
          }
        },
        {
          "Phonenumber": " +1 213-763-3499"
        },
        {
          "recommendedlengthofvisit": " 1-2 hours"
        },
        {
          "fee": " Yes"
        },
         {
			"categories" : [ "Landmark" , "Museums" , "OutDoor" ]
		},
        {
          "reviews": [
            {
              "review": "NO REVIEW"
            },
            {
              "review": "A visit to the La Brea Tar Pits can bring tears to your eyes when you think of how animals died in the area. The park is a show case of nature's gifts and also destruction."
            },
            {
              "review": "See the museum. It is unique and pretty awesome but don't miss walking through the park. Keep your eyes peeled! There are tar pits coming up all over. You may have to hunt for some or they might be oozing up under your feet through the walkways! The place undulates! That is my favorite part of the whole place."
            },
            {
              "review": "This is a nice place to spend a couple of hours (including watching the 3D movie). It will be best combining with a visit to any of the museums near by to make it worth your time."
            },
            {
              "review": "If you are interested in paleontology (as we are), the La Brea Tar pits provide a fascinating overview of early excavations juxtaposed with more current understanding. Younger children will enjoy the skeletons and panoramas presenting early animals, and there is enough history and science to engage anyone with a bit of interest."
            },
            {
              "review": "We were on a tour which took us past the La Brea Tar Pits so the next day we drove back there and spent nearly day walking around watching the tar bubbling away in the lake the museum was interesting as well."
            },
            {
              "review": "This is a place to see at least once. The museum is not very big and the outdoor pit exhibits and interesting. It doesn't take much time to see everything. If you plan to see one of the movies plan about 2 hours in my opinion."
            },
            {
              "review": "Outside tar pits are free to access and nice park to walk around. On site parking is $10. Page museum was very small and only took about 15-20 minutes to view it all. Thankfully our admission was free with our ASC museum pass. Otherwise, $12 admission would not be worth it."
            },
            {
              "review": "amazing to see all the stuff that has come out of the pits, really interesting and educational. The grounds are lovely too"
            },
            {
              "review": "Professional, organized and enlightening as to the history of the area. Enjoyed the visual show and there were many volunteers offering additional advise when touring the exhibits. Well worth the USD32 total (2 adults entry @$12 each plus Titans of the Ice Age film @$4 each)"
            },
            {
              "review": "Very well designed museum, that would be interesting to both kids and adults.\nWe were a family for four, including two teens and all enjoyed it a lot. Younger kids may enjoy even more. \n\nThe museum has exhibitions of fossils and models inside, and the actual pits outside. One of the highlights is a behind-the-glass fossil lab, where you can see the actual work of cleaning and sorting the fossils being done. Its a really great to get to know the process, in addition to the results.\n\nTips:\n-- Make sure to visit the actual pits outside the museum. \n-- Avoid the lines inside and buy your ticket at the booth outside (on the way from the parking lot)."
            }
          ]
        },
        {
          "nearby": []
        }
      ]
    }

      
 ]
}
