{
    "addr": "101 Avenue of the Americas New York, NY 10013", 
    "title": "1st Pitch Best of the Best - December 7th, 2015", 
    "url": "http://www.eventbrite.com/e/1st-pitch-best-of-the-best-december-7th-2015-tickets-18840628828?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-07T17:30:00-05:00", 
    "endtime": "2015-12-07T20:30:00-05:00", 
    "categories": [
        "Biotech", 
        "Meeting or Networking Event"
    ], 
    "desc": "1 st ?PITCH LIFE SCIENCE ?EAVESDROPPING ON INVESTORS?CLOSED DOOR DISCUSSIONS? MEETING ANNOUNCEMENT ? December 7th, 2015 5:30PM ? 8:30PM ? Hear what happens AFTER a start-up company presents to an investor group! Usually after the company representatives leave the room, the investors have a private discussion to decide whether ?the opportunity merits further investigation and possible investment.? 1 st ?Pitch Life Science offers presenters and audience members the chance to hear what happens in those closed-door discussions, and to learn what really matters to investors. ? 1st Pitch Life Science is organized by MABA (Mid Atlantic Bio Angels (www.bioangels.net), a life science investor group, to encourage and educate aspiring life science entrepreneurs who know they may be too early to seek investment but want the opportunity to practice their pitch and to receive constructive criticism from experienced and knowledgeable professionals. ? Presenting at 1 st ?Pitch Life Science allows early stage life science entrepreneurs to: ? ? Audience members get to hear how entrepreneurs are pursuing new science and new business opportunities and to provide their own feedback regarding the value and effectiveness of those efforts.? The audience ?votes on a ?Best in Show? company which will advance to an annual ?Best of the Best? competition. ? There is no downside ? no investor rejection, no lost opportunities.? Just good advice and potential connections that a company can use to improve its strategy and presentation. Also, note our new \"Looking For\" section on the registration. ?Let us know what your startup is looking for - software engineer, patent attorney, formulator, certain type of CRO, management, etc - and we will provide you with a different-color name badge with this information printed on it so that others can easily tell you are looking for something and help you make meaningful connections for your company! When : ? ? ? ? ? ? ? ? ? ?December 7th, 2015 ??????????????? ??????????????? 5:30pm ? Registration & Networking ??????????????? ??????????????? 6:00 ? 8:00pm ? Program ??????????????????????????????? 8:00 ? 8:30pm ? Networking ? Where : ? ? ? ? ? ? ? ?New York Genome Center ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?101 Avenue of the Americas ? ? ? ? ? ? ? ? ? ? ? ? ? ? ??New York, NY?10013 ? *Limit 150 attendees.? Must pre-register to attend. ? To present or sponsor, please email us at: ?? info@1stpitchlifescience.com ? Visit our website at:? 1stpitchlifescience.com"
}