{
    "addr": " New York University School of Medicine. 550 First Avenue at 30th Street. New York, NY 10016", 
    "title": "Atlantic Coast Retinal Club and MACULA 2016", 
    "url": "http://www.eventbrite.com/e/atlantic-coast-retinal-club-and-macula-2016-tickets-17448119796?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-01-08T07:30:00-05:00", 
    "endtime": "2016-01-09T17:00:00-05:00", 
    "categories": [
        "Medicine", 
        "Conference"
    ], 
    "desc": "Statement of Need Continuing advances in retinal, optic nerve, and choroidal imaging have?generated interest, as well as confusion over which modality is most?appropriate for a given disease state. Spectral domain optical coherence?tomography (OCT) is still relatively new, but its potential to enhance the?assessment of retinal pathology is becoming more apparent. Diagnostic?tools and prognostic markers to evaluate disease stage and progression?in the individual patient are needed. Fundus autofluorescence imaging?allows for visualization of the topographic distribution of lipofuscin?over large retinal areas. Retinal specialists need to be trained in the?newest imaging modalities to ensure accurate diagnoses and subsequent?treatment plans.?Pharmacotherapeutic agents, such as bevacizumab, afilbercept, and?ranibizumab are approved and used widely for the treatment of AMD.?An increasing number of retinal specialists are experimenting with?combination therapies and frequency of treatment to offer their patients?the best possible outcomes.?Retinal diseases are difficult to treat. New surgical techniques, such as?vitreoretinal small incision surgery, have been developed. Since there?is less tissue manipulation and significantly less operating time, the?eyes recover faster with fewer complications and less post-operative?discomfort. It is essential that retinal surgeons be better informed of the?latest surgical techniques that offer the best outcomes for their patients. Target Audience Retinal Specialists, Comprehensive Ophthalmologists, Optometrists,?Residents and Fellows. Course Description Using a combination of didactic lectures and discussions, faculty?members will present advances in diagnosis and treatment of macular?diseases. The Course will discuss alternative concepts for ?dry? and??wet? age-related macular degeneration, including a discussion on?the basic science behind the disease, diabetic retinopathy, idiopathic?perifoveal telangectasia, ocular tumors, as well as other?vitreo-retina macular diseases. Information on new and experimental?pharmacological therapies, as well as new imaging concepts, vitreoretinal?surgical instrumentation and applications will also be presented.?At the completion of this course, participants will have a thorough?understanding of the latest advances in the management of macular?diseases. Participants will also have an increased knowledge of new?imaging and diagnostic techniques available to the ophthalmic community,?as well as the decision making process utilized by the course faculty in?approaching these situations. Educational Objectives At the conclusion of this activity, participants should be able to: ? Better interpret disease states and employ imaging modalities.?Discuss new imaging technology in the field of retina and macular?diseases that allow for greater visualization for more accurate?diagnosis and treatment planning. ? Assess and evaluate the latest developments in?pharmacotherapeutic treatments for AMD and other macular diseases; and prescribe these agents in combination to better manage?the disease process. ? Describe the latest advances in retinal surgery which utilize?small incision and small instrumentation and result in less?patient discomfort and faster recovery time. Accreditation Statement This activity has been planned and implemented in accordance?with the accreditation requirements and policies of the Accreditation?Council for Continuing Medical Education through the joint?providership of the NYU Post-Graduate Medical School and?LuEsther T. Mertz Retinal Research, North Shore-LIJ &?Manhattan Eye, Ear and Throat Hospital. The NYU Post-Graduate?Medical School is accredited by the ACCME to provide continuing  medical education for physicians. Credit Designation Statement The NYU Post-Graduate Medical School designates this live?activity for a maximum of 17.25 AMA PRA Category 1 Credits TM .?Physicians should claim only the credit commensurate with the?extent of their participation in the activity. Disclosure Statement The NYU Post-Graduate Medical School adheres to ACCME?accreditation requirements and policies, including the Standards?for Commercial Support regarding industry support of continuing?medical education. In order to resolve any identified Conflicts?of Interest, disclosure information is provided during the planning?process to ensure resolution of any identified conflicts. Disclosure?of faculty and commercial relationships as well as the discussion?of unlabeled or unapproved use of any drug, device or procedure?by the faculty will be fully noted at the meeting. Cancellation Policy:  All cancellations must be confirmed in writing and received? by Monday, December 22, 2015. An administrative fee of $50 will be retained. There will be no refunds after this date. ? C ancellations requests may be sent to : NSLIJ/ MEETH L.T. Mertz Retinal Research Center  210 East 64th Street  New York, N.Y. 10065  Attention:?Doreen DeVivo   Americans with Disabilities Act:  This conference is in compliance with provisions of the Americans with Disabilities Act (ADA) and is accessible for individuals with special needs. If you would like to attend this conference and require any special needs or accommodations, please contact the NYU Office of CME at  (212) 263 5295 . HOTEL INFORMATION Blocks of rooms have been reserved?at the Hotels noted below?for course participants. When making your reservation, please specify that you are registering for the Macula 2016 course.? The cutoff date for reservations is December 8, 2015. ? Affinia Gardens 215 East 64th Street? Phone: (866) 233-4642 Outside USA: (212) 320-8050  reservations@affinia.com ? Affinia Dumont 150 East 34th Street Phone: (866) 233-4642 Outside USA: (212) 320-8050 reservations@affinia.com ? The Surrey Hotel 20 East 76th Street Phone: (866) 233-4642 Outside USA: (212) 320-8050 reservations@affinia.com ? QUESTIONS ? (212) 605-3777 Mark Titherington mtitherington@retinal-research.org ? Faculty and Schedule ATLANTIC COAST RETINAL CLUB - CME Program Friday, January 8, 2016 7:15 WELCOME Celso Tello, MD, NSLIJ/MEETH  WELCOME Lawrence A. Yannuzzi, MD Precision Medicine and Targeted Therapies?in Heredodegenerative Disorders Moderators: Alan Bird, MD and Stephen Tsang, MD, PhD 7:30 Rando Allikmets, PhD - Molecular Diagnosis  7:40 Scott Brodie, MD - Sjogren?s Reticular Dystrophy  7:50 Graham Holder, MD - RDH5 and Fundus Albipunctatus  8:00 Irene Maumenee, MD - CRUMBS, CRB1 Retinopathies  8:10 Anthony Moore, MD - Bestrophin Channelopathies  8:20 Hendrik Scholl, MD - Stargardt?s Disease  8:30 Eberhart Zrenner, MD - Phosphodiestrerase 6  8:40-9:00 DISCUSSION: Alan Bird, MD and Ron Carr, MD   Atlantic Coast Retinal Club Member Presentations  Moderators: Lee Jampol, MD, Lawrence Singerman, MD, and Gabriel Coscas, MD  9:00 Irene Barbazetto, MD - Mystery Case  9:10 Gaetano Barile, MD - Mystery Case  9:20 Caroline Baumal, MD - Mystery Case  9:30 Alexander Brucker, MD - Mystery Case  9:40 RV Paul Chan, MD - Pediatric Vitreoretinopathy  9:50 Michael Engelbert, MD, PhD - Mystery Case  10:00 Philip Ferrone, MD - Mystery Case  10:10 Howard Fine, MD - Mystery Case  10:20 Jasmine Francis, MD - Mystery Case  10:30 Wayne Fuchs, MD - Mystery Case  10:40 Ivana Kim, MD - Mystery Case  10:50 Brian Marr, MD - Oncology  11:00 Jonathan Prennar, MD - Mystery Case  11:10 Elias Reichel, MD - Have You Ever Seen This?  11:20 Hermann Schubert, MD - Mystery Case  11:40 Theodore Smith, MD - Mystery Case  12:00 John Sorenson, MD - Mystery Case  11:50 John Thompson, MD - Mystery Case  12:10 Ken Wald, MD - Mystery Case  12:10 C. Pat Wilkinson, MD - What To Order?  12:20 Matthew Wheatley, MD - Mystery Case 12:30-1:15 ? ? LUNCH ? MASTERS IN MEDICAL RETINA  1:15 Welcome: Lawrence Yannuzzi, MD  Moderators: Emily Chew, MD and Evangelos Gragoudas, MD  1:20 David Abramson, MD - Mystery Case  1:30 Anita Agarwal, MD - Mystery Case  1:40 Mark Blumenkranz, MD - Mystery Case  1:50 Neil Bressler, MD - Mystery Case  2:00 David Brown, MD - Mystery Case  2:10 Emmett Cunningham, MD, PhD - Mystery Case  Moderators: Alexander Brucker, MD and Lawrence Singerman, MD  2:20 Jay Duker, MD - Mystery Case  2:30 Harry Flynn, MD - Mystery Case  2:40 K. Bailey Freund, MD - Mystery Case  2:50 Allen Ho, MD - Mystery Case  3:00 Lee Jampol, MD - Mystery Case  3:10 Mark Johnson, MD - Mystery Case  3:20-3:50 COFFEE BREAK  Moderators: Emmett Cunningham, MD, PhD and Dean Eliott, MD  3:50 Szilard Kiss, MD - Mystery Case  4:00 Daniel Martin, MD - Mystery Case  4:10 William Mieler, MD - Mystery Case  4:20 Anthony Moore, MD - Mystery Case  4:30 Jose Pulido, MD - Mystery Case  4:40 Carl Regillo, MD - Mystery Case  Moderators: Mark Blumenkranz, MD and Timothy Olsen, MD  4:50 Richard Rosen, MD - Mystery Case  5:00 Philip Rosenfeld, MD - Mystery Case  5:10 David Sarraf, MD - Mystery Case  5:20 Carol Shields, MD - Just a Choroidal Nevus. Right?  5:30 Jerry Shields, MD - Mystery Case  5:40 Richard Spaide, MD - Mystery Case  5:50 Lawrence Yannuzzi, MD - Mystery Case  6:00 Program Ends ? ? MACULA 2016? - CME Program? Saturday, January 9, 2016 ? 7:15 WELCOME Jack Dodick, MD (NYU) WELCOME Lawrence A. Yannuzzi, MD (Director) ? Oncology Moderators:?David Abramson, MD and Evangelos Gragoudas, MD 7:30 David Abramson, MD - Ophthalmic Artery Chemosurgery: 10 Years Later 7:40 Paul Finger, MD - Radiation Oncology 7:50 William Harbour, MD - Class 1 Versus Class 2 Melanoma 8:00 Carol Shields, MD - Sclerochoroidal Calcification. Think about it. 8:10 Jerry Shields, MD - Astrocytomas ? ? Medical Retina Moderators:?Alexander Brucker, MD and Frederick Ferris, MD 8:20 Mark Blumenkranz, MD - Technology At Hand 8:30 Emily Chew, MD - Progression of Geography Atrophy in AREDS 2 8:40 Christine Curcio, PhD Histology and Optical Coherence Tomography of RPE 8:50 Ralph Eagle, MD - Pathology Macula ? Imaging Moderators:?D. Jackson Coleman, MD and Lawrence Singerman, MD 9:00 Yale Fisher, MD - Anterior Segment Ultrasound 9:10 Jay Duker, MD - Advances in OCT Imaging in 2016 9:20 K. Bailey Freund, MD - OCT 9:30 Richard Rosen, MD - OCT of Retinal Vasculature 9:40 Philip Rosenfeld, MD - SS-OCT En Face Imaging of Macular Diseases 9:50 David Sarraf, MD - Quantitative OCTA Analysis of Retinal Circulations ? 10:00 - 10:30 - COFFEE BREAK ? Greater New York Macula Lectureship 10:30-11:00 Richard Spaide, MD - OCT-Angiography: Artifacts ? Age-Related Macular Degeneration Moderators: Mark Blumenkranz, MD and Giselle Soubrane, MD 11:00 Pravin Dugel, MD - Anti-VEGF Resistance in Neovascular AMD: Role of PDGF 11:10 Jeffrey Heier, MD ?-? Advances in Gene Therapy in Management of Retinal Diseases 11:20 Allen Ho, MD ?-? Cellular Transplantation ? ? ? ? ? ? ? ?? 11:30 Joan Miller, MD ?-? New Treatment Concepts ? ? ? ? ? ? 11:40 Daniel Martin, MD - Latest Findings from the CATT Trials 11:50 Jason Slakter, MD - Topical Approaches to Treatment of Exudative AMD 12:00 Timothy Olsen, MD - Clinical Pathological Correlations 12:10-12:30 ? DISCUSSION: Philip Rosenfeld, MD and Jason Slakter, MD ? 12:30-1:30 ? ? LUNCH ? Chorioretinal Diseases Moderators: Emmett Cunningham, MD, PhD and Tomohiro Iida, MD 1:30 Anita Agarwal, MD - Tubercular Serpiginoid? ? 1:40 Emmett Cunningham, MD,PhD - Signs of VKH Disease 1:50 William Mieler, MD - Non Infectious Occlusive Disease 2:00 Jose Pulido, MD - Syndromic Vascular Disease 2:10 Doug Jabs, MD - Uveitis and AMD 2:20 Lawrence Yannuzzi, MD - Pigment Epithelial Detachment ? Diabetes Moderators: ?Michael Cooney, MD and Antonio Chiardella, MD 2:30 Neil Bressler, MD - Anti-VEGF for Proliferative Diabetic Retinopathy ? ? ? ? ? ? ? ?? 2:40 Lee Jampol, MD - Anti-VEGF for Non-Proliferative Diabetic Retinopathy ? ? ? ? ? ? ? 2:50 Marco Zarbin, MD - Safety of Anti-VEGF Diabetic Drugs ? Vein Occlusion Moderators: Pravin Dugel, MD and Jay Klancnik, Jr., MD 3:00 Peter Campochiaro, MD - Pro-permeability factors in macular edema from RVO and DME ? ? ? ? ? ?? 3:10 David Brown, MD - Comparison of Anti-VEGF Drugs 3:20 Carl Regillo, MD - Vitreomacular Adhesion: Does it influence wet AMD? ? Vitreoretinal Diseases Moderators: Stanley Chang, MD and John Sorenson, MD 3:30 Dean Elliott, MD - Cellular Implants 3:40 Michael Engelbert, MD, PhD - Vitreous Anatomy in Health and Disease 3:50 Harry Flynn, MD - Infections from Intravitreal Treatment 4:00 Lucian Del Priore, MD - Subretinal implants: Improving survival 4:10 Mark Johnson, MD - Acute Ocriplasmin Retinopathy 4:20 John Thompson, MD - Classification and Treatment of Lamellar Macula Holes 4:30-5:00 ? DISCUSSION: Harry Flynn, MD and C. Pat Wilkinson, MD 5:00 ? ? ? ? ? ADJOURNMENT:? Yale Fisher, MD"
}