{
    "addr": "431 West 125th Street New York, NY 10027", 
    "title": "Access Manhattan: Services for Stronger Communities", 
    "url": "http://www.eventbrite.com/e/access-manhattan-services-for-stronger-communities-tickets-18908265130?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "City/Town", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Every day from a storefront on 125th Street, the Manhattan Borough President's North Manhattan Office helps residents with their economic, environmental and quality-of-life concerns.  This fall, we are excited to launch   Access Manhattan , a series of workshops and forums that connect the community with the essential city services they need.  Our first workshop will be an info session on the IDNYC identification card. More events on topics ranging from tenant support, senior rent freeze eligibility, licensing for African hair braiders and small business grants will be held over the next few months. Space is limited, so RSVP today! ? UPCOMING EVENTS November 12, 5-8pm: 125th Street Neighborhood Revitalization Info Session West Harlem businesses and community-based organizations located along 125th Street west of Morningside are invited to this dialogue on neighborhood revitalization which will allow participants to discuss common concerns, including commercial tenant needs assessment, development of the West 125th Street corridor, the Columbia Manhattanville expansion, working with Community Boards around public safety and quality-of- life issues, as well as the integration of NYCHA developments, faith organizations, precincts, and other residents into local planning. Cosponsored with the 125th Street Business Improvement District. ? November 18, 6-8pm: Heat & Utility Assistance Workshop This workshop will help utility customers better understand service issues ranging from loss of essential light or heat to excessive arrears to final termination notices. Cosponsored by the Public Utility Law Project of New York, Con Edison, and the NYC Human Resources Administration, the workshop will help you avoid being bullied by energy service companies into high-cost rate schemes you can?t afford. You?ll learn about deferred payment arrangements, discount programs, public assistance programs to avoid service termination, and other basic rights to which you are entitled. You?ll also learn about cost-containment measures. ? December 2, 6-8pm: Resources for Helping Homeless, Mentally Ill & Chemically Addicted Residents Residents, community organizations, and local leaders working with mentally ill, chemically addicted, and homeless individuals are invited to this education session. Cosponsored with Project Renewal, the Bowery Women?s Center, and other mental health, substance abuse, and housing service providers, the session will help caregivers learn about the factors that impact clients and how to better assist them in finding needed housing, shelters, drug and mental health treatment programs, and other supports necessary to living an alcohol- and drug-free life. ? December 9, 6-8pm: Child Support & Child Care Workshop Are you having problems with child-support arrears? This training?cosponsored by the New York City Office of Child Support Enforcement?will help you better understand the processes, updates, and options for families. It will also connect you with other free child-support workshops and with programs to help you find jobs, reduce your child support debt, and lower your child support orders. You?ll be able to have specific questions answered by workshop leaders. ? December 16, 6-8pm: Economic Development/Workforce Training Session If you are interested in preserving Central Harlem?s economic growth and vibrancy in the face of escalating commercial rents, the replacement of mom-and-pop stores with major banks and corporate chains or vacant storefronts, and demographic changes among clientele and the overall workforce, this session will provide an overview of the latest updates on current economic development projects underway in Central Harlem, workforce and job opportunities available to the community, and government resources available to help small businesses and local entrepreneurs.  ? PAST EVENTS October 6, 4-6pm: Municipal ID Info Session The Manhattan Borough President?s Office, in collaboration with the NYC Mayor?s Office of Immigrant Affairs, will convene a special session to inform all New York City residents, 14 years and older, about the IDNYC program. IDNYC is the new, free government-issued, municipal photo ID card, which provides residents access to services and programs offered by the City. Participants will learn how IDNYC can eliminate barriers and benefit every city resident, including the most vulnerable communities ? the homeless, youth, the elderly, undocumented immigrants, the formerly incarcerated and others who may have difficulty obtaining government-issued ID.? ? October 8, 10am-4pm: Tenant Support Clinic The Manhattan Borough President's Office is proud to partner with the NYC Tenant Support Unit to host joint office hours to provide support to tenants who may be experiencing housing related issues such as: harassment, purposeful denial of essential services, overcharges, or possible eviction. A Tenant Support Specialist will be at the Northern Manhattan Office ready to help, so if you are experiencing any housing-related issues, please RSVP to join us anytime from 10 am - 4 pm on October 8. ? October 14, 6-8pm: Food Stamps/SNAP & Food Bank Info Session This info session, in partnership with the NYC Human Resources Administration, Food Bank NYC, and West Side Campaign Against Hunger, will address food security issues facing nearly 1.8 million New Yorkers. Presenters will discuss how to use the computer kiosks in HRA?s Job Centers, what documentation is required for benefits eligibility, and how the Electronic Benefit Card (EBT) works.? Participants will learn how to ?navigate the SNAP application process, with special attention given to those seeking assistance who have been denied benefits in the past. A listing of food pantries, community soup kitchens and healthy food access informational materials will also be provided. ? October 15, 4-6pm: Immigration, Citizenship & Naturalization Workshop The Manhattan Borough President's Office is partnering with the CUNY Express Immigration Center, NYC Family? Justice? Center? Manhattan , Sauti Yetu Center for African Women and Families, and African Services Committee? to aid, empower and educate individuals with concerns or issues related to their Citizenship and Naturalization application s. Attendees will learn about the requirements and documentation needed for? citizenship and naturalization? applications to be processed? by the USCIS . The workshop will also address the victimization of immigrants seeking citizenship who are often preyed upon by criminals who steal from them by employing a variety of schemes. ? October 21, 6-8pm: Rent Freeze Clinic for Seniors & Disabled Persons During this workshop cosponsored by the NYC Department of Finance (DOF), you?ll be able to complete and submit your Senior Citizen Rent Increase Exemption (SCRIE) and Disability Rent Increase Exemption (DRIE) applications, both initial and renewal. NYC recently raised the household income cap for SCRIE and DRIE programs to $50,000 (including certain deductions), meaning that many more seniors and people with disabilities are now eligible to have their rent frozen. The program has also undergone a name change and is now referred to as the NYC Rent Freeze Program. ? October 27, 6-8pm: African Hair Braiders Licensing Workshop This workshop will help African hair braiders understand the processes and requirements for securing natural hair-braiding licenses. Cosponsored by the New York Department of State?s Division of Licensing Services, the workshop will cover how to avoid common pitfalls and challenges that applicants encounter, how to navigate city and state agency websites, how to resolve issues when facing penalties, and how to deal with fraud. Translation services will be available, as will support for resolving other business-related issues. ? October 28, 3-5pm: Social Security & Social Security Disability Workshop If you?re planning to file for Supplemental Security Income and Social Security Disability, this workshop will give you valuable information, support, and guidance from the agencies responsible for administering these benefits. Cosponsored by the Social Security Administration and the Legal Support Unit, the workshop will tell you where to apply and mail information for processing. You?ll also be able to have specific questions answered by workshop leaders. ? November 4, 3-5pm: Medicare & Medicaid Workshop Having problems with your Medicaid/Medicare health insurance certification and application? This workshop?cosponsored by the Social Security Administration, NYC Human Resources Administration, and Centers for Medicare and Medicaid Services (CMS)?will provide vital information on certification deadlines, insurance terminations, and related topics. You?ll be able to have specific questions answered by workshop leaders."
}