{
    "addr": "237 W 42nd St New York, NY 10036", 
    "title": "The Music of FRANKIE VALLI & THE FOUR SEASONS with THE JERSEY FOUR", 
    "url": "http://www.eventbrite.com/e/the-music-of-frankie-valli-the-four-seasons-with-the-jersey-four-tickets-19082695857?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-23T20:00:00-05:00", 
    "endtime": "2015-11-23T22:00:00-05:00", 
    "desc": "The Cast of The Jersey Four will take you on a journey from the very beginning of The Four Seasons Number #1 Hits - Frankie Valli`s solo career -to present day Four Seasons shows. SHERRY, BIG GIRLS DON`T CRY, RAG DOLL, WALK LIKE A MAN, and WHO LOVES YOU are just some of the many hits you will enjoy from their great collection of songs from those four guys from Jersey. The smash hit musical \"The Jersey Boys\" which opened on Broadway, November 6, 2005 is based on one of the most successful 1960`s rock and roll groups of our time. The Cast of The Jersey Four is an explosive tribute to Frankie and The Four Seasons, which recaptures the original hits from the musical as well as many other Top 10 songs that are not featured in the Tony Award winning hit. This includes SWEARIN` TO GOD, GREASE and many others! Along with all the recognizable tunes, The Cast Of The Jersey Four incorporates trivia, stories about The Four Seasons, humor, audience participation and encourages you to sing-a-long with their fabulous cast. Inducted into The Rock and Roll Hall of Fame in 1990, Frankie Valli and The Four Seasons continue to entertain both young and old with their unique style of singing and song writing. The Cast of The Jersey Four (who are all accomplished singers and musicians from Jersey) stay true to The Four Seasons music. The Cast of The Jersey Four`s interpretation of these classics along with their unique vocals, fabulous stage show, The Jersey Bounce Horns, authentic costume and musical equipment (Fender-Stratocaster, Gibson-Firebird & Thunderbird) guitars, Fender Amplifiers, Ludwig & Gretsch drums recreate that famous sound of The Four Seasons. So if you are a fan and enjoy the sounds of these Rock and Roll Hall of Famers, who are still performing World Wide today, you should make it a must to go and see Frankie Valli and The Four Seasons, along with a sure thing \"THE JERSEY FOUR\"!"
}