{
    "addr": "40 Washington Square South New York, NY 10012", 
    "title": "Lessons from Afar – Innovative Energy Efficiency Policies from Across the Atlantic", 
    "url": "http://www.eventbrite.com/e/lessons-from-afar-innovative-energy-efficiency-policies-from-across-the-atlantic-tickets-19336453854?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-14T09:30:00-05:00", 
    "endtime": "2015-12-14T11:00:00-05:00", 
    "categories": [
        "Environment \\u0026 Sustainability", 
        "Seminar or Talk"
    ], 
    "desc": "On December 14th, the Guarini Center on Environmental, Energy and Land Use Law at NYU School of Law,  Sabin Center for Climate Change Law at Columbia Law School  and  Urban Green Council,  will hold a discussion on, ?Lessons from Afar ? Innovative Energy Efficiency Policies from Across the Atlantic.? Themes for discussion include European building label schemes, energy audit regimes and public-private partnerships to catalyze building retrofits and promote energy efficiency entrepreneurs. 1.5 CLE credits are available in the areas of Professional Practice category for both newly admitted and experienced attorneys.   Please see CLE reading,  here . Speakers include: Ivan Delgado ,  Partner at P?rez-Llorca's New York office   Nico Kienzl , Director, Atelier Ten   Cecil Scheib , Chief Program Officer, Urban Green Council (moderator)   Miranda Schreurs , Director, Environmental Policy Research Centre and Professor at (FFU) Freie Universit?t Berlin   Marcos Vaquer Caballer?a , Chair Professor of Administrative Law at Carlos III de Madrid University and Secretary General of the University Monday, December 14, 2015, 9:30am ? 11:00am   NYU School of Law  Greenberg Lounge, Vanderbilt Hall  40 Washington Square South  New York, NY 10012 This event has been made possible through the generous support of: the American Friends of Bucerius, the Consulate General of the Federal Republic of Germany, Transatlantic Climate Bridge, and P?rez-Llorca and the Universidad Carlos III de Madrid."
}