{
    "addr": "1134 1st Avenue  New York, NY 10065", 
    "title": "Alan Action.com and SugarDaddyForme.com Present Casino Royale Mixer Benefitting Toys For Tots at La Nuit NYC Wednesday December 16th 2015", 
    "url": "http://www.eventbrite.com/e/alan-actioncom-and-sugardaddyformecom-present-casino-royale-mixer-benefitting-toys-for-tots-at-la-tickets-19335576229?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-16T19:30:00-05:00", 
    "endtime": "2015-12-17T01:00:00-05:00", 
    "categories": [
        "Poverty", 
        "Meeting or Networking Event"
    ], 
    "desc": "AlanAction.com does it again!? An amazing Holiday Party Benefitting the amazing organization for children, TOYS FOR TOTS.? Hudreds of empowered and estabished men and women will be in attendance Networking, Dancing and raising money and donations of toys for the United States Marine Corp's Toys For Tots program that distributes Toys for needy chidren during the holiday season.? This party will have it all.? Great Food , ambiance, a Casino Like atmosphere with Black Jack Tables, where winnings can be redeemedfor prizes, and the great Newtorking entourage that Alan Action is know for.? Scroll down for videos of the Alan Action Series of Events, and lets build awareness and great donations for the great Toys For Tots Program as the Marine Corp will be in Uniform and at the party in force!? This is the party to be generous and its all in the heart of NYC at La Nuit.? The last party had over 500 in attendance! ???  ?? ?WORLD FAMOUS ERIC MENA AT OUR LAST PARTY, FROM THE HOT TV SHOW, LOVE AND HIP HOP.??? TICKET Pricing:? Book Early for Early Purchase Discount LOOK ONLINE OR YOUR EMAIL FOR TICKETS OR CALL 1-888-611-8267 EXTENSION 3 FOR THE CURRENT PROMO CODE. ? THIS IS AN EXCLUSIVE EVENT AND LIMITED TO THE FIRST?700?EMPOWERED??AND DISTINGUISHED CLIENTS, SO BOOK YOUR TICKETS NOW, AS?WAITING FOR THE Last Miniute AT ?THE VENUE MAY BE TOO LATE AND IT COULD BE SOLD OUT!?  ? Distinguished Male Ticket? NEW PRICE ?(Regular + At the?door )?  $50.00 ? Empowered Female Ticket (Regular + At the?Door Price) $30.00 ? We'd like to thank those who helped us make the last?42?? Alan Action Sugar Daddy ?Parties a big success. ?Our next Sugar Daddy For me?party ?promises to be an even bigger gathering, and more classy and sophisticated than the last ones with an ocean skyline of NYC!? Location :?La Nuit, New York's Newest Casbah Night Ultra Lounge on the East Side.? Date / Time:?December 16th 2015 ? (Wednesday)?from?7:00 ?pm-1 A.M.?FOOD STATIONS SERVED FROM 8:30 TO 9:30 SHARP  All Tickets Are non refundable and non changeable or exchangeable once purchased through the system. and any VIP or complimentray tickets are subject to an Eventbrite $10.00 Administrative Fee at the door."
}