{
    "addr": "1040 Grand Concourse Bronx, NY 10456", 
    "title": "Mosaic Literary Conference 2015", 
    "url": "http://www.eventbrite.com/e/mosaic-literary-conference-2015-registration-18972692835?aff=ebrowse", 
    "location": "Bronx, NY", 
    "starttime": "2015-11-21T11:00:00-05:00", 
    "endtime": "2015-11-21T17:00:00-05:00", 
    "desc": "Black Poets Speak Out began as a response to a conversation initiated by Amanda Johnston. Jericho Brown, Mahogany Browne, Jonterri Gadson and Sherina Rodriguez-Sharpe responded to the call with ideas, suggestions and various plans of action. What resulted was a hashtag video campaign house on a tumblr site featuring hundreds of videos from Black poets reading in response to the grand jury?s decision on November 24 not to indict Darren Wilson, the police officer who murdered Mike Brown.?View sample readings online at? Ellen Hagan?and? Over the past year, BPSO has rallied poets and allies to stand up and speak out from the page, stage, podium, and street. We?ve collected many of the poems shared in protest and created lesson plans to help guide classroom discussions on poetry of witness and resistance. This presentation is for educators looking to inject new ideas and activities focused on craft and social justice engagement into their workshops. ,? , and? In the wake of a grand jury failing to indict Darren Wilson in the murder of Mike Brown, Black Poets Speak Out was launched as a way to rally poets and allies to respond against police violence. In a short time, hundreds of poetry videos were posted and shared internationally across social media outlets and live readings, forums, and action events were produced. BPSO organizers, Amanda Johnston and Mahogany L. Browne, and regional coordinators, J.P. Howard and Katy Richey, will discuss how the online campaign was developed and progressed to a community action based movement. A poetic protest open to community poets and allies to stand up and speak out against police violence. All are welcome to read a poem by a black poet that speaks to issues around police violence and/or justice & equality. The Mosaic Literary Conference is presented by the? ?is a 501c3 tax-exempt nonprofit arts organization that seeks to restore the importance of reading books as an essential tool for creating intelligent, productive, and engaged young people. Presenting Sponsor: Caribbean Cultural. Media sponsors include AALBC.com (The African American Literature Book Club), NY Writers Coalition, Total Equity Now - Harlem. La Casa Azul Bookstore is the official bookseller of the Mosaic Literary Conference."
}