{
    "addr": "101 6th Avenue New York, NY 10013", 
    "title": "Evening Talks: Levi Garraway", 
    "url": "http://www.eventbrite.com/e/evening-talks-levi-garraway-tickets-18114573176?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-03T18:30:00-05:00", 
    "endtime": "2015-12-03T20:30:00-05:00", 
    "categories": [
        "Mobile", 
        "Seminar or Talk"
    ], 
    "desc": "Title: New Directions in Cancer Precision Medicine? Dr. Levi Garraway is an Associate Professor of Medicine in the Department of Medical Oncology at the Dana-Farber Cancer Institute, Harvard Medical School, and a Senior Associate Member of the Broad Institute. He is the inaugural Director of the Joint Center for Cancer Precision Medicine at the Dana-Farber, Brigham and Women?s Hospital, and the Broad Institute, and co-Director of the Cancer Genetics Program at the Dana-Farber/Harvard Cancer Center. Dr. Garraway has made seminal research contributions in cancer genomics, drug resistance, and precision (or ?personalized?) cancer medicine. He published the first whole genome sequencing studies of prostate cancer, and has led major cancer genomics initiatives in both melanoma and prostate cancer. This work has identified multiple new cancer genes and several fundamental mechanisms by which cancer may arise.? He was also the first to describe ways in which an important subtype of melanoma becomes resistant to several new targeted therapies. His several major contributions in this area have informed a conceptual framework for understanding resistance mechanisms relevant to many tumor types, and identified novel therapeutic avenues for future cancer clinical trials. Dr. Garraway is perhaps best known for his contributions to precision cancer medicine. He described the first high-throughput adaptation of genomic technology to profile human tumors for hundreds of cancer gene mutations that could guide therapeutic choices. This research has guided precision medicine initiatives at many cancer centers worldwide. It also inspired the launch of Foundation Medicine, Inc., a genomics-based cancer diagnostics company co-founded by Dr. Garraway. In September of 2013, Foundation Medicine completed an initial public offering that raised $122 million. In 2009, Dr. Garraway was inducted into the American Society for Clinical Investigation (an international physician-scientist honor society), and he is currently President-Elect of that organization. Dr. Garraway has been the recipient of several awards and honors, including the Partners in Excellence Award, the prestigious New Innovator Award from the National Institutes of Health, and the Block Award for Outstanding Cancer Research from the Ohio State University. In 2013, Dr. Garraway received the Paul Marks Prize, awarded every other year to three top cancer scientists age 45 or younger. In 2014, Dr. Garraway was awarded the Jane Cooke Wright Lectureship by the American Association for Cancer Research. This award recognizes an outstanding scientist who has made meritorious contributions to the field of cancer research and who has, through leadership or by example, furthered the advancement of minority investigators in cancer research."
}