{
    "addr": "527 Madison Ave New York, New York  10022", 
    "title": "The Inaugural MBM Honors", 
    "url": "http://www.eventbrite.com/e/the-inaugural-mbm-honors-tickets-19650962558?aff=ebrowse", 
    "location": "New York, New York", 
    "starttime": "2015-12-08T19:00:00-05:00", 
    "endtime": "2015-12-08T21:30:00-05:00", 
    "desc": "Wednesday, December 8, 2015 7:00 p.m. - 10:00 p.m. The HARMAN Store 527 Madison Avenue New York, NY 10022 ?  (  is pleased to host the Inaugural #MBMHonors celebrating a successful 2015 and commemorating industry professionals who have demonstrated professional excellence while giving back to their communities. ? Hosted by the   and sponsored by  , #MBMHonors is a great networking opportunity for young professionals seeking to advance their careers and for industry professionals to celebrate their peers. To aid in 2016 fundraising efforts, raffle tickets are available for purchase for the chance to win a fantastic holiday gift pack courtesy of HARMAN worth $500. ? ? As the Vice President of Music & Talent Programming Strategy, Yomi handles strategic planning across multiple channels, along with overseeing the programming and facilitation of all of the MTV music channels (MTV, MTV2, MTV Hits, MTV Jams, mtvU). He has also been one of the biggest supporters of Minds Behind the Music. ? In his role J.D. works closely with digital partners (e.g. VEVO, Shazam, Pandora, Twitter, Facebook, and many more) to develop strategic campaigns and content for artists such as Calvin Harris, DeJ Loaf, J. Cole, Juicy J., Snoop Dogg, St. Lucia and more. ? As Vice President of the Rhythm & Soul/Urban Membership division of the American Society of Composers, Authors and Publishers (ASCAP), she oversees and manages her department?s daily operations. She applies her knowledge of intellectual property law and the rights of music creators to serve and support those who come under her domain of rhythm and soul. ? Please join us in celebrating these revered entertainment professionals. ? Doors open at 7:00 p.m.  This event is free and open to the public  Light refreshments to be served. Attendees must be 21 and over."
}