{
    "addr": "87 Lafayette Street New York, NY 10013", 
    "title": "DCTV and IFP present a Case Study of Cartel Land", 
    "url": "https://www.eventbrite.com/e/dctv-and-ifp-present-a-case-study-of-cartel-land-registration-19611846561?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-02T19:00:00-05:00", 
    "endtime": "2015-12-02T20:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Film & Media"
    ], 
    "desc": "presented by  DCTV  and  IFP Most recently nominated for five Cinema Eye Honors, Best Documentary by the Gotham Independent Film Awards, and recipient of the International Documentary Association?s ?Courage Under Fire? Award, Matthew Heineman's? Cartel Land ? was also the winner of both Best Director and Best Cinematography in the U.S. Documentary competition at the 2015 Sundance Film Festival. Comfortably sitting in the how-did-they-do-that category of cinema verit?, the film is leaving viewers completely immersed and in awe of the directorial achievement. Hailed by New York Magazine as ?one of the year?s most important documentaries,?? Cartel Land ?looks at the journeys of two modern-day vigilante groups and their shared enemy ? the murderous Mexican drug cartels. \n For this intimate Case Study, we will be joined by Heineman, editor Matthew Hamachek, and cinematographer Matt Porwoll to discuss how this crew gained such an unprecedented amount of access while simultaneously constructing a thoughtful feature documentary about the Mexican drug war. \n \n Panelists: \n Matthew Heineman (Director / Producer / Cinematographer / Editor) ?is an Emmy-nominated filmmaker based in New York. For? Cartel Land , which premiered in the U.S. Documentary Competition at the 2015 Sundance Film Festival, Heineman won the Best Director Award and Special Jury Prize for Cinematography. After directing and producing? Escape Fire: The Fight to Rescue American Healthcare , the feature-length documentary premiered at Sundance 2012, won numerous festival awards, and was theatrically released to critical acclaim by Roadside Attractions / Lionsgate before airing on CNN and earning an Emmy nomination. Heineman previously collaborated for two years with a team at HBO on the groundbreaking, Emmy-nominated HBO series,? The Alzheimer's Project , which aired in May 2009. He also directed and produced? Our Time ?? a feature-length documentary about what it's like to be young in today's America. Heineman has directed several short films and commercials and is currently developing a few different projects. \n Matthew Hamachek (Editor) ?began his career working on the Oscar-nominated documentary? Street Fight ?with Marshall Curry and went on to collaborate with Curry again on ?Racing Dreams  (Best Documentary, Tribeca Film Festival), and ?If a Tree Falls  (Best Documentary Editing, Sundance Film Festival) which was nominated for an Academy Award for Best Documentary. Hamachek went on to win the editing award at the 2013 Sundance Film Festival for? Gideon's Army . Since then he has edited? Mistaken for Strangers ?about the band The National and  Console Wars ?(executive producers Scott Rudin and Seth Rogen) about the battle between Sega and Nintendo in 90s. \n Matt Porwoll (Cinematographer) ?is a documentary cinematographer based in New York.? Cartel Land ?is Porwoll's second collaboration with director Matthew Heineman. Emmy-nominated? Escape Fire: The Fight to Rescue American Healthcare , shot by Wolfgang Held, made its premiere at the 2012 Sundance Film Festival. Matt has also served as additional cinematographer on? Be Here Now: The Andy Whitfield Story ?with Academy Award-nominated director Lilibet Foster, HBO?s Emmy-nominated? By the People: The Election of Barack Obama , directed by Amy Rice and Alicia Sams, and  Gunnin' For That #1 Spot? directed by Adam Yauch of the Beastie Boys. Recently Matt worked with cinematographer Tony Hardmon and director Ellen Goosenberg on HBO?s? Crisis Hotline: Veterans Press 1 , which won Best Documentary Short at the 2015 Academy Awards. \n \n This event is part of? DCTV Presents , DCTV?s signature screening and event series that highlights innovative and provocative work from the independent filmmaking community. \n Details:? http://www.dctvny.org/events/casestudycartelland"
}