{
    "addr": "3022 Broadway New York, NY 10027", 
    "title": "Two Cultures, One Team: Leading a Major Japanese-Owned Bank in the Americas as the First American CEO", 
    "url": "http://www.eventbrite.com/e/two-cultures-one-team-leading-a-major-japanese-owned-bank-in-the-americas-as-the-first-american-ceo-tickets-18315509181?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-01T12:30:00-05:00", 
    "endtime": "2015-12-01T14:00:00-05:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Seminar or Talk"
    ], 
    "desc": "CJEB welcomes you to a lunchtime \"zadankai\" seminar: Two Cultures, One Team: Leading a Major Japanese-Owned Bank in? the Americas as the First American CEO featuring Steve Cummings '79 President & CEO, MUFG Union Bank, N.A. Moderated by Alicia Ogawa Senior Advisor, Center on Japanese Economy and Business, Columbia Business School;  Adjunct Associate Professor, School of International and Public Affairs, Columbia University Mr. Cummings will share his experiences as the first American CEO at the helm of all U.S. operations of Japan?s largest bank, a position he assumed in May 2015.? He?ll reflect on notable contrasts he?s observed between Japanese and American business cultures, how their strengths complement each other, and where they share common ground.? He looks forward to taking questions. Lunch will be served. Advance registration is required. General contact: Center on Japanese Economy and Business, cjeb@columbia.edu We regret that we are unable to accommodate media representatives at this event. ? Brief biography Steve Cummings'79 ?is the first American to serve as President and CEO of MUFG Union Bank.? He is also a Managing Executive Officer of The Bank of Tokyo-Mitsubishi UFJ, Ltd. (BTMU), the first non-Japanese to hold the title in this global company of more than 100,000 employees. ? As BTMU CEO for United States, Steve is in charge of all its operations in the nation.? He is a member of the Board of Directors of MUFG Americas Holdings Corporation and MUFG Union Bank. ?Cummings joined MUFG in May 2015 and is based in the company?s New York headquarters. ? Steve began his career in 1979 with Kidder, Peabody, and has since held progressively senior positions at Bowles Hollowell Conner, Wachovia, and UBS, where most recently he was Managing Director and Chairman for the Americas before joining MUFG. He holds a BA from Colby College and an MBA from Columbia Business School. ? ? Please be advised that this event may be photographed, so your image may appear on our website later. ? If this is an issue, please let us know. ?Thank you."
}