{
    "addr": "101 6th Avenue New York, NY 10013", 
    "title": "Evening Talks: Henry Louis Gates, Jr.", 
    "url": "http://www.eventbrite.com/e/evening-talks-henry-louis-gates-jr-tickets-18029158699?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-01-07T18:00:00-05:00", 
    "endtime": "2016-01-07T20:00:00-05:00", 
    "desc": "A conversation with Henry Louis Gates, Jr.? Henry Louis \"Skip\" Gates, Jr. ?is an American? historian , currently the Alphonse Fletcher University Professor and Director of the Hutchins Center for African and African American Research at? Harvard University . He is also an? Emmy Award -winning filmmaker, literary scholar, journalist, cultural critic, and institution builder. Gates has written 17 books and created 14 documentary films, including? Wonders of the African World ,? African American Lives ,? Black in Latin America , and? Finding Your Roots , now in its second season on? PBS . His six-part PBS documentary series,? The African Americans: Many Rivers to Cross ?(2013), which he wrote, executive produced, and hosted, earned the? News and Documentary Emmy Award ?for Outstanding Historical Program?Long Form, as well as the? Peabody Award ,? Alfred I. duPont-Columbia University Award , and? NAACP Image Award . Having written for such leading publications as? The New Yorker ,? The New York Times , and? Time , Gates is editor-in-chief of? TheRoot.com , a daily online magazine, while overseeing the Oxford African American Studies Center, the first comprehensive scholarly online resource in the field. In 2012,? The Henry Louis Gates, Jr. Reader , a collection on his writings, was published. Gates's latest book is? Finding Your Roots: The Official Companion to the PBS Series , released by the? University of North Carolina Press ?in 2014. The recipient of 53 honorary degrees and numerous prizes, Gates was a member of the first class awarded \"genius grants\" by the? MacArthur Foundation ?in 1981, and in 1998, he became the first African-American scholar to be awarded the? National Humanities Medal . He was named to the? Time ?25 Most Influential Americans list in 1997, to the? Ebony ?Power 150 list in 2009, and to Ebony's Power 100 list in 2010 and 2012. He earned his B.A. in English Language and Literature,? summa cum laude , from? Yale University ?in 1973, and his M.A. and Ph.D. in English Literature from Clare College at the? University of Cambridge ?in 1979. Gates has directed the W.E.B. Institute for African and African American Research?now the Hutchins Center?since arriving at? Harvard University ?in 1991, and during his first 15 years on campus, he chaired the Department of Afro-American Studies as it expanded into the Department of African and African American Studies with a full-fledged doctoral program. He also is a member of the American Academy of Arts and Letters and serves on a wide array of boards, including the? New York Public Library , the? NAACP Legal Defense and Educational Fund , the? Aspen Institute ,? Jazz at Lincoln Center , the? Whitney Museum of American Art ,? Library of America , and the? Brookings Institution . He has chaired the? Anisfield-Wolf Book Awards ?since 1995, and travels each September to? Cleveland, Ohio , to lead a community celebration of the winners. He won the prize himself in 1989 for editing the 30 volumes of \"The Schomburg Library of Nineteenth-Century Black Women Writers\"."
}