{
    "addr": "333 W 23rd St New York City, New York 10011", 
    "title": "TV of Tomorrow Show New York City 2015", 
    "url": "http://www.eventbrite.com/e/tv-of-tomorrow-show-new-york-city-2015-tickets-17548187100?aff=ebrowse", 
    "location": "New York City, New York", 
    "starttime": "2015-12-03T08:00:00-08:00", 
    "endtime": "2015-12-03T20:00:00-08:00", 
    "categories": [
        "TV", 
        "Conference"
    ], 
    "desc": "[itvt] Presents...The TV of Tomorrow Show NYC 2015 SOCIAL, VIDEO, PHOTOS ? SHOW DATE December 3, 2015 Check back for more information here or at http://www.thetvoftomorrowshow.com ? NYC LOCATION SVA Theatre ?http://www.svatheatre.com in Chelsea in Manhattan ? TICKETS ? WANT TO REGISTER OFFLINE? :??  The Eve nt brite service sometimes does not accept certain corporate credit  cards. ?  Please contact Tracy at swedlow@itvt.com and she'll ?email you a?PDF to fill out and fax or email b ack. ? SPEAKERS SUGGESTIONS AND FEEDBACK To discuss the TV of Tomorrow Show, or  to give us feedback and suggestions   (including new technologies you would like to see showcased and topics you would like to see discussed), email  Tracy  at  swedlow@itvt.com. ? MAIN CONTACT Please contact  Tracy Swedlow  at  swedlow@itvt.com  or  415-824-5806 (office) or 415-608-4766 (mobile)  to find out more about  group rates, sponsorship and exhibition opportunities, speaking proposals . ? PRESS CONTACT Please contact  Tracey Sheehy  at  tsheehy@breakawaycom.com ?  to find out more about attending as press or covering the show. ? TERMS & CONDITIONS (Thanks to Typo) Availability A limited number of tickets are sold in all of the advance sale phases. Once advance sale phase is sold out, you may buy a ticket in the following registration phase, or join the waiting list in case of cancelations. Your Ticket Please bring a printed or mobile copy of this confirmation for registration at the conference. You will receive your conference tickets at our on-site registration desk. Student Tickets For student attendees, please also bring along a valid proof of enrollment and a copy of your student identification to the venue. The registration team will email purchasers to verify that all students are enrolled in valid education programs as of April 30, 2015. Substitutions, Cancellation & Refunds We do not provide refunds for a cancellation request. If you want to transfer your ticket to a colleague substitute, please reach out to us and provide the original ticket buyer's name and the new person's full name, title, company and email address.? Absence from the conference does not entitle one to reimbursement of the admission fee."
}