{
    "addr": "235 West 23rd Street New York, NY 10011", 
    "title": "5 Years of FindSpark Bash: The Can’t Miss Networking Event of the Year", 
    "url": "http://www.eventbrite.com/e/5-years-of-findspark-bash-the-cant-miss-networking-event-of-the-year-tickets-18482747395?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-03T18:30:00-05:00", 
    "endtime": "2015-12-03T21:30:00-05:00", 
    "categories": [
        "Career", 
        "Meeting or Networking Event"
    ], 
    "desc": "FindSpark is turning five...and you're invited to celebrate with us! Join the FindSpark team, our ambitious community, speakers from past events, and our stellar employers for a night of?inspiration, connecting, and celebrating?as we look back on the milestones of 2015 and welcome the exciting adventures that 2016 will?bring. We're kicking the party off with style and fun, interactive activities. From an accomplishment?wall (to be filled out by YOU), to a post card station (write a thank you note to someone who's supported your career, and we'll send it!), this event?will challenge you to think of new ways that you can build connections and pursue?the career of your dreams! Our community is made up of diverse, ambitious pros from a variety of industries?and companies.?You could?meet: Plus, we'll get inspired by short talks?from some of our most passionate?FindSpark community members, including our founder & CEO: Location : Wix Lounge, 235 W 23rd Street, 8th Floor Dress : Cocktail Attire Tickets :?$0?? $20?depending on your FindSpark membership level & career status. FindSpark Premium Members ?get in free.? Learn more at? findspark.com/premium . ? MCG Social ? works with brands, companies, and agencies? to?use ?social media and events to engage their communities and grow their business. Our services include social media and event strategy, community management, social media at live events, launch parties, and the best social media training and workshops out there. Our previous clients include? NBCUniversal , Elizabeth Arden, Dylan?s Candy Bar, and Time Inc, amongst others. To learn more, please visit? www.mcgsocial.me . ? Thank you to our partner? Wix.com ?for hosting us at the Wix Lounge.? Wix.com ?enables you to build a free and professional online presence, just the way you want it. With an HTML5 drag-and-drop website editor, 100s of web apps, designer-made templates, and tons of features, Wix gives you the tools to launch and manage your online presence. So what are you waiting for?? Sign up for a free Wix workshop today! Museum Hack ? likes to joke and say it does museum tours for people who don?t like museums.?Their?expertise is in leading private social museum adventures, and whether it?s for a company offsite, a bachelorette party, or a leadership summit, the most popular comment from their?customers is, ?I?ve never had so much fun in a Museum!? They?began offering these unique experiences at the Metropolitan Museum of Art in New York City. Today, they?host hundreds of tours every year at museums in New York City, Washington D.C., and San Francisco. In addition to museum tours, Museum Hack?provides premium engagement and storytelling consulting services to startups, museums, luxury hotels, corporations, and universities. ?Museum Hack will be giving out sweet prizes at the bash! Whether it?s finding an apartment, applying for a new? credit ?card or getting a car loan, your? credit can make a big difference. If you?re not sure where you stand or how you can start building your credit ,? Credit ? Karma ?can help. They?ll hook you up with your scores, reports and a whole bunch of helpful tips, and it?s all totally free. Dev Bootcamp ?pioneered the short-term immersive ?web development bootcamp,? a model that transforms beginners into full-stack web developers. Through effort, community support and training, they?help beginners with little or no technical background reach a level of proficiency that allows them to get paid to continue learning on the job as junior web developers. They?have campuses in Chicago, New York City and San Francisco. To date they?ve?graduated more than 1,000 students who work on development teams all over the world."
}