{
    "addr": "2 East 91st Street New York, NY 10128", 
    "title": "Design Kids with Bash the Trash (Onsite at Museum: 2 E 91st Street)", 
    "url": "http://www.eventbrite.com/e/design-kids-with-bash-the-trash-onsite-at-museum-2-e-91st-street-tickets-19403696980?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-28T11:00:00-05:00", 
    "endtime": "2015-11-28T15:00:00-05:00", 
    "categories": [
        "Education", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Design your own instrument with guest designers from  Bash the Trash ! The tabla is one of the signature instruments from India, an amazingly versatile and interesting set of drums. Examine the design of the tabla, sketch your plan, build your instrument, and perform a musical piece! ? Workshops are geared toward kids ages 5 through 12. ? Target Design Kids is made possible by the generous sponsorship of  ? Can I bring my group to the program?? Design Tales and Design Kids are intended for families. We are unable to accommodate groups. Can I leave my child? Caretakers must stay with their child for the duration of the program. Reserving Tickets Each program day we present the same activity during two different time slots. When you select your event, reserve your tickets for the session time that works for you. Each adult needs an adult ticket, and each child needs a child ticket. The program is full. Can I still get in? Reservations are required to guarantee participation in Design Tales, and we do not keep a waitlist. Occasionally, however, reserved participants cannot attend the event, and there may be room in the program on the day of the scheduled event. If you were unable to reserve a spot, please arrive to the event location five minutes early and speak with our educators about joining. Please keep in mind that drop-ins are only accepted if space is permitting. What if I?m running late? Participants may be turned away if they arrive more than 10 minutes after the start of the program, even if they have a reservation."
}