{
    "addr": "610 West 112th Street New York, NY 10025", 
    "title": "Bank Street Alumni Book Event", 
    "url": "https://www.eventbrite.com/e/bank-street-alumni-book-event-tickets-19149879806?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-01T18:00:00-05:00", 
    "endtime": "2015-12-01T19:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Family & Education"
    ], 
    "desc": "Join Bank Street alumni Julie Diamond, Betsy Grob, and Fretta Reitzes at the launch of their new book? \n Te a ch i ng Kin d erg a rten: Lea r ner - Cen t ered   Cla s sro o ms  f or  the? 21 st  Century \n \n December 1, 2015 \n 6:00-7:30 PM \n \n Refreshments will be served. Books available for sale. \n \n \n ?We need this book. It speaks eloquently to what good practice looks like in real schools, as well as what it means to be a good teacher. These stories of amazing educators address what equity is all about ? starting with 5 year-olds. It?s too bad the next 12 years of school are not more like these kindergarten classrooms.? ? ? ?Deborah Meier, education activist, senior scholar at New York University?s Steinhardt School of?Education \n Today?s k i nd e rgarten teac h ers face eno r mous challe n ges.   This bo o k presents a   model for   21 st - century kind e rgartens that is rooted in child-centered l e arning and s h aped by the needs and go a ls of   the present day.  ? Kindergarten teache r s working wi t h diverse po p ulations of   students and focusing on i s sues of   social   justice provi d e vivid descr i ptions of   classroom   life ac r oss urban and rural commu n ities.   Teachi n g Kindergart e n  illustrates a progressive,   learner-cente r ed approach that meets and goes beyond the equity and accountab i lity   goals of   the   Common Core State Standards. \n Julie Diamond  taught   kindergarten in t h e New York City public sc h ools for   23 years,   and curr e ntly advises stud e nt   teachers.   S he is the author   of   Kindergarten:   A Teacher,   Her   Stu d ents,   and a Year of   Learning .   Betsy Grob  t aught   kinder g arten in Colorado and New   York before  s erving on the faculty of   Bank Street   College for   over   20   years.   She  c onsults on curriculum   natio n ally and internation a ll y .   Fretta   Reit z es taught   3 to   6 year   olds in the  t ri-state  a rea.   As direc t or   of   92Y?s Goldman Ce n ter   f o r   Youth   & Family,   she   created the   Wonderplay   Conference.   She provides professional  d evelopment   for   early child h ood educators,   and is the  c o-author   of   W onderplay  a n d  Wonderplay,   Too ."
}