{
    "addr": "Asia Society, 725 Park Avenue, New York, NY, United States  ", 
    "title": "FREE SCREENING of \"Assassination\"", 
    "url": "http://www.eventbrite.com/e/free-screening-of-assassination-tickets-19362064456?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-01T18:30:00-05:00", 
    "endtime": "2015-12-01T21:30:00-05:00", 
    "categories": [
        "Film", 
        "Other"
    ], 
    "desc": "The Korean Cultural Service New York and Asia Society are proud to co-present the fifth series of Korean Movie Night New York (KMN), which will run from Tuesday, November 3 to December 1, 2015 at Asia Society?s Lila Acheson Wallace Auditorium. KMN presents the best blockbuster films as the last series of the year. As Korean cinema continues to deliver world-class blockbusters, you can count on Korean Movie Night New York to select the best among the bunch for your viewing pleasure. This last series will present RYOO Seung-wan?s latest action thriller Veteran, period sword-fighting drama Memories of the Sword, starring LEE Byung-hun (G.I. Joe movies, Terminator Genisys), and historic epic Assassination, directed by CHOI Dong-hoon (The Thieves). Despite the strong showing of the big Hollywood films in Korea this Summer, led by The Avengers: The Age of Ultron, which claimed over 10 million admissions, domestic action and historic epic blockbusters continue to hold their own, with Veteran and Assassination currently holding the two top spots with 13 and 12.7 million admissions, respectively, proving once again the continuing strength of the Korean film industry. Korean Movie Night New York is an ongoing, approximately twice-a-month film program that introduces the full spectrum of contemporary and classic Korean cinema to New York audiences, from popular blockbusters, independent films, and documentaries to animation and family movies. The series is co-presented by Korean Cultural Service NY and Asia Society. For information on the series, please visit www.koreanculture.org or www.asiasociety.org/korean-movie-night or www.facebook.com/KoreanMovieNY. All screenings take place at Asia Society, 725 Park Avenue at 70th Street, New York City. All events are free admission, first come, first served. For information, call 212-517-2742. For stills, please contact Elaine Merguerian at 212-327-9313 / elainem@asiasociety.org or Jean Jo (212) 759-9550 (ext. 207) / jjo@koreanculture.org. Assassination (?? am-sal) Directed by CHOI Dong-hoon Starring: JUN Gianna, LEE Jung-jae, HA Jung-woo, OH Dal-soo, CHO Jin-woong, CHOI Deok-moon 2015 | 140 min. | In Korean with English subtitles Tuesday, December 1, 2015, 6:30 PM ?A sensationally entertaining mash-up of historical drama, Dirty Dozen style shoot-?em-up, spaghetti Western-flavored flamboyance, and extended action set pieces? ? The Variety The master of Korean ensemble blockbusters, director CHOI Dong-hoon (The Thieves), is back with historic espionage action drama, set in Shanghai and Seoul in 1933 during the Japanese colonial rule. The Korean government in exile gives one of its top undercover operatives, Agent Yem (LEE Jung-jae, New World), a mission: recruit three people to infiltrate occupied Seoul and assassinate the Japanese general along with a Korean collaborator. He selects steely-eyed female sniper Ahn (JUN Gianna, The Thieves), a brawler Big Gun (JO Jin-ung, A Hard Day), and an explosives expert (CHOI Deok-mun). But Agent Yem is a actually a double-agent for the Japanese and he stealthily hires a hitman Hawaii Pistol (HA Jung-woo, The Terror Live, The Chaser) to kill the assassins."
}