{
    "addr": "11 Times Square New York, NY 10036", 
    "title": "AngelWeek: Gathering of Angels + Super Startupalooza", 
    "url": "http://www.eventbrite.com/e/angelweek-gathering-of-angels-super-startupalooza-tickets-19037263969?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-30T18:00:00-05:00", 
    "endtime": "2015-12-01T19:00:00-05:00", 
    "categories": [], 
    "desc": "Angel Week is a 4 day series of related events for Angel Investors - and Entrepreneurs. They key event is the  Gathering of Angels  on Dec. 1. with  Super Startupalooza , a pre-event on the Nov. 30 for Entrepreneurs and Investor reviewers. The finalists of  Startupalooza  will present during the  Gathering of Angels  event . Keynote: Kevin Harrington,  Shark Tank Investor, TV Legend and founder of  Starshop. Related events include: Healthcare 2.0 Startups ? Cannabis Investing ? Innovation & Investing 2015 (Private Equity Forum) ? Inventors Roadshow ? IEEE IoT Central Startup Night ? So You Want To Be An Angel Sign up for the signature event and get access to the others: About Super Startupalooza pre-event on Nov. 30: ? Microsoft Center, 11 Times Sq.  This is a qualifying event for all startups who want to attend. All participants will be featured on the program and have presentatoin tables - finalists will be invited to pitch during the Dec. 1  Gathering of Ange ls event. A minimum of 12 companies will be selected to make elevator ptiches to the  Gathering of Angels  with a final pitch-off at the end of the day. Entrepreneur-oriented, all Angels welcome. 1. Gathering of Angels - Dec. 1 - Microsoft Center, 11 Times Sq.  Angel-oriented  Entrepreneurs can register.  2. Super Startupalooza - Nov. 30 (Pitching event to qualifiy for Gathering of Angels Presentation) All registrants get on program. Qualifiers get to pitch during main event. ?(Microsoft - 11 TImes Sq.) 3. Health 2.0/Medstartr Healthcare Startup Event - Nov. 30th,? 9 - 5 pm (Microsoft - 11 TImes Sq.) 4. Innovation & Investing (Private Equity Forum) - Dec. 2nd - 12 - 5 pm (Yale Club) 5. Cannabis Investing - Dec. 2nd - 9 am - 2 pm (Dorsey & Whitney) 6. Inventors Roadshow - Dec. 2nd, ?8 - 10 am (Microsoft 677 Fifth Ave.) 7. IEEE IoT Central Startup Night - Dec. 2nd 5:30 - 9:00 pm (Civic Hall? 156 Fifth Ave.) ??????????????????????????????????? www.angelweekny.com 1. Super Startupalooza - Nov. 30 (Pitching event to qualify for Gathering of Angels Presentation) Qualifiers get to pitch during main event. All registrants get on the program. 2. Gathering of Angels - Dec. 1 Angel-oriented event open to Entrepreneurs. Gathering of Angels: Agenda 8:30 - Registration 9:00 - 9:30? Keynote: ?Kevin Harrington, Shark Tank? Investor, Founder, Sta r shop 9:30 ??? 10:30 ? What Are Today's Best Deals? Charlie O'Donnell, Brooklyn Ventures; Murat Aktihanoglu, Entrepreneurs Roundtable; Keren Crispin, Long Island Angel Network, Dr. Ira Wallace, MidAtlantic BioAngels 10:40 - 11:40? New Trends in Angel? Investing Craig Mullett, Angel Investor Forum; Dan Conley, Angels + LifeInfoSci Investors; David Beatty, ? Goldenseeds; Joe Rubin, FundingPost;? Erica Duignan Minnihan,? 1000 Angels 11:50 ? 12:50? Who Closed the Exits? The New Liquidity. Michael Segal, Wynston Hill Capital; David Sorin, McCarter & English; Jay Wright, Bayberry Capital; Bill Reinisch, Paladin Capital Lunch Break 2:00 ? 2:30 ? Lunch ? Keynote  Brian Cohen, NY Angels:  Startup Promiscuity  Without a Happy (Ending)?EXIT in Sight 2:30 - 3:30 ? Angels Compare: Tech, Digital Media, Food and EdTech Investors Share Notes Gregg Young, NY Angels;? Les Neuman, iCANny;?Jeffrey Silverman, Laconia Capital Group; Dan Delmar, Harvard Business School Alumni Angels of Greater New York  3:40 ? 4:40 ? Crowdfunding: Reg A+ vs Equ i ty Crowdfunding  Adam Sharp, ? Early Investing;? Erica Duignan Minnihan,? 1000 Angels;?Aaron Kellner, Seedinvest;  Julie Smith, Meet the Investor  4:50 ? 5:30  Pitch Off  5:30 - 7:00 Cocktail Party www.angelweekny.com"
}