{
    "addr": "2920 Broadway New York, NY 10027", 
    "title": "Venture Capital Perspectives: Early Stage Biotech Investing with Doug Cole, Flagship Ventures", 
    "url": "https://www.eventbrite.com/e/venture-capital-perspectives-early-stage-biotech-investing-with-doug-cole-flagship-ventures-tickets-19325473010?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-01T11:00:00-05:00", 
    "endtime": "2015-12-01T12:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Business"
    ], 
    "desc": "Join us for a discussion and Q&A with Doug Cole, managing partner of Flagship Ventures, a life science venture fund with over $1.4 billion under management and a new $574 million fund devoted to early-stage therapeutics, health technologies and sustainability. In a live interview with CTV?s Director Orin Herskowitz, Doug will discuss Flagship Ventures? perspective on opportunities and challenges within the venture investment landscape, current trends, past experiences with early-stage investing, its VentureLabs Fellows program, and building a career as a venture capitalist. \r\n This event is co-sponsored by  Columbia Engineering Entrepreneurship ,  Columbia Entrepreneurship ,? The Eugene Lang Entrepreneurship Center , and the Columbia University  Office of Postdoctoral Affairs . \r\n \r\n Doug Cole, MD  is a managing partner at Flagship Ventures. He has previously served as Program Executive at Vertex Pharmaceuticals, Inc., in Cambridge, MA and as Medical Director at Cytotherapeutics, in Providence, RI. Prior to his work at Cytotherapeutics, Doug served as Instructor in Neurology at Harvard Medical School and an Assistant in Neurology at the Massachusetts General Hospital in Boston, MA. \r\n At Flagship, Doug has led investments in Agios Pharmaceuticals (NASDAQ: AGIO), Alvine Pharmaceuticals, Avedro, CombinatoRx, Concert Pharmaceuticals (NASDAQ: CNCE), Denali Therapeutics, Editas, Quanterix Corporation, Receptos (NASDAQ: RCPT; acquired by Celgene, Inc.), Seventh Sense Biosystems, Tetraphase Pharmaceuticals (NASDAQ: TTPH), and Torque Therapeutics. He is a co-founder of Flagship portfolio companies Ensemble Therapeutics, Permeon Biologics, Moderna Therapeutics, and Syros Pharmaceuticals. \r\n Orin Herskowitz , VP of Intellectual Property and Tech Transfer for Columbia University and Executive Director of Columbia Technology Ventures (CTV), is also an Adjunct Professor at Columbia?s Business and Engineering Schools. He has been a Board Member or Advisor to a number of innovation and entrepreneurship-focused initiatives in NYC, including the NYC Media Lab, the Coulter Translational Partnership, and PowerBridgeNY."
}