{
    "addr": "160 Convent Ave New York, NY 10027", 
    "title": "“Nueva Trova: La Nueva Canción Latinoamericana”", 
    "url": "http://www.eventbrite.com/e/nueva-trova-la-nueva-cancion-latinoamericana-tickets-17888898176?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-17T19:00:00-05:00", 
    "endtime": "2015-12-17T21:30:00-05:00", 
    "desc": "The? Association of Dominican Classical Artists ?(ADCA) has just announced its VI Concert Series 2015-16. The second event will take place on Thursday, December 17, 2015, 7:00pm, at the Aaron Davis Hall. The ADCA will be hosting the second concert of the season FREE of charge for the public. The concert will be featured by the Camerata Washington Heights and special guest singer Andre Veloz.? The Camerata Washington Heights is a group of musicians formed by the faculty members of? The Washington Heights Community Conservatory of Fine Arts . Its Repertoire, range from traditional classical composers from Europe and Latin America, to folkloric and popular music from the Latin American heritage. The goal of the grou p is to bring chamber music to the community of Washington Heights serving as a model for underprivileged youngsters in NYC. This concert will connect major historical events in Latin America with pieces by key artists such as V?ctor Jara, Violeta Parra, Luis Dias, Caetano Veloso, Chico Buarque, Mercedes Sosa, Pablo Milanes, Silvio Rodriguez, among others. Artists from Cuba, Chile, Argentina, Dominican Republic and Brazil.? This concert is the second in a series aimed to celebrate the tradition of annual concerts by the Association of Dominican Classical Artists. It initiated in 1980, with the participation of Dominican and other Latino soloists, with orchestral accompaniment playing classical music. In this occasion we will be presenting the genre of \"Nueva Trova\". Tickets are FREE of charge but seating is limited. Please reserve your seat by registering through our Eventbrite link:? http://adca.eventbrite.com/ About the ADCA: The Association of Dominican Classical Artists, Inc. (ADCA) was founded in 1980 by musicians and composers of Dominican descent living and working in New York City. ADCA has as its mission to foster appreciation for the classic and folkloric music of the Dominican Republic, or created by composers of Dominican and Latin American descent living in the United States; to create performance spaces for its artists. We accomplish our mission by presenting concerts and educational programs free of charge for the community. The Association of Dominican Classical Artists, Inc. (ADCA) brings live performances of classical music to the communities of Northern Manhattan. ADCA offers a series of chamber music concerts at the Aaron Davis Hall, City College of New York, with the purpose of fostering appreciation of Dominican and Latino art and music by bringing educational and live performances to communities with little or no access to both. associationdominicanartists.org"
}