{
    "addr": "11 Times Square. enter on 8th Avenue. New York, NY 10036", 
    "title": "MedStartr Momentum 2015", 
    "url": "http://www.eventbrite.com/e/medstartr-momentum-2015-tickets-19461538987?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-30T09:00:00-05:00", 
    "endtime": "2015-11-30T18:00:00-05:00", 
    "categories": [
        "Medicine", 
        "Conference"
    ], 
    "desc": "(Note: please visit the  main event page  for more information.) We started H2NYC and MedStartr.com to bring new ideas to healthcare faster and we are proud to have been among the first to introduce companies like Phreesia, Abilto, IHT Spirit, 1DocWay, Avado, Blueprint Health, and over 350 other new healthcare innovations to the world. ? Now, for the first time we will have a whole day focused oo helping 20 great early stage companies gather the momentum needed to get to the next level as they pitch to the investors, partners, early adopters, hospital leaders, and patient leaders that are ready to work with the next big idea. ?Please join us for MedStartr Momentum 2015 and help us bring the best new companies forward faster than ever. Apply ?to make the pitch Finals on stage in front of 200 people and our massive online crowd following the livestream on? MedStartr.tv ?and? twitter ?(#MedMo15). ?This is our largest prize package ever and it could exceed a $50,000 value but in truth, it is priceless. ?That's because it is designed to include everything a startup with a great idea and a solid team needs to succeed. ?See the Prize Package section below for more information. Over Twenty panelists and speakers will be on hand to speak, ask the tough questions, and help judge the finalists. ?Each judging panel will include at one Patient, Provider, Partner, Institution, and Investor. ?Think you have what it takes to be one of our Star Panelists? ? Apply to be a MedStartr Mentor here. Here is who is coming so far: Regina Holliday (WalkingGallery),? George Mathew, MD (Aetna), Dawn Bell (Novartis),? Owen Davis (NYCSeed), ?Ben Chodor (Sherpa), Sarah Krug (Cancer 101), Mandi Bishop (Dell), Thomas Tsang (Cornell), Amy Cueva (MAD*POW), AJ Lociano (Truveris), Zach Silversweig (Cipher Health) and over a dozen more top healthcare innovation leaders will speak and be on Panels helping judge... That's right, we are pulling together FOUR panels with 5 finalists each to take the stage and be judged by a panel of patients, providers, partners, institutions, investors and our crowd, online and off.? Prizes will include meetings with key partners and investors, a package of acceleration services, cash, and? investment / syndication with the brand new MedStartr Investment Fund. ? From the fitbit IPO to millions of kids wearing the IHT Spirit monitors in Gym class, the IoT has come to healthcare in a big way this year.? Five of the highest potential new ideas in the space will vie to win our heartbeats and mindshare. Traditional high cost, high touch care centers are rapidly becoming centers of innovation with the help of hundreds of nimble tech teams.? Five of the top companies transforming this space will present to win! From smart pills to better deep analytics, few areas are changing as fast as Pharma.? We invite the five best new ideas in Pharma tech to show us how they will enable the New Pharma paradigms and change how we take our medicine. ?The Panel will include potential investors, partners, and early adopters that can help make the best ideas take off! Patients and Physicians have many new tools to engage and collect vast amounts of data. We invite the best new ideas to compete and show us what they have built that will reshape a brighter, better healthcare future for us all. Events like this usually run $250 - $1,200 a ticket but we make a point of keeping our events accessible so our tickets are only $250 for a full day, food, great speakers, and more.? While supplies last you can still get early bird tickets for much less!?? ?? Dues Paying Members get $50 discounts on  all  tickets! ?Membership is $65 a year and includes free or discounted access to our events.? To become a member please visit our  H2NYC Meetup Group  dues page.  Thank you for your support! ?? Volunteer!? (Closed) ?? Apply to Pitch ?(Closed) ?? Offer to be a?great Panelist, Judge or Speaker ?(Closed) ?? Help us spread the word and be a Promotional? Sponsor ?? Get exhibitor space (See Startr Pack ticket above) ?? Sponsor and receive featured listing in publications, exhibitor space, credit for providing lunch or coffee ??Sponsor a Pitch Contest and Add to the Prize Packages ?? Sponsor the After Party!? ? Please email  Events@medstartr.com  if you are interested in adding to the prize packages or Sponsoring Accelerate 2015! Thanks for being members and supporters of healthcare innovation. Yours Truly,? Alex, Anthony, Mimi, and the H2NYC/ MedStartr team FAQs ? Are there ID requirements or an age limit to enter the event? Photo ID required to enter the building"
}