{
    "addr": "455 Madison Avenue. East 50th Street. New York, NY 10022", 
    "title": "The 41-74 Club of New York Holiday Luncheon & Fundraiser", 
    "url": "http://www.eventbrite.com/e/the-41-74-club-of-new-york-holiday-luncheon-fundraiser-tickets-19053338047?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-11T12:00:00-05:00", 
    "endtime": "2015-12-11T15:00:00-05:00", 
    "categories": [
        "Food \\u0026 Drink", 
        "Dinner or Gala"
    ], 
    "desc": "Dear Travel Partners and friends, The 41-74 Club of New York invites you to join us for our 78th Annual Holiday Luncheon and Fundraiser, benefiting  \"City of Hope\" , at the Lotte New York Palace one of the most beautiful venues in New York City. ? Register to join us.? You don?t want to miss the travel industry ?who?s who? networking, not to mention open bar, a spectacular meal, and the fabulous array of prizes donated to support this year?s charity!? It?s a grand celebratory way to generously give to those less fortunate.? Share with others   while we have space. Raffle tickets for travel prizes will be available at the event at a cost of  1 for $10 / 3 for $20 / 5 for $25. ? Business cards will be used in lieu of tickets.? Proceeds will benefit  \"City of Hope\"? www.cityofhope.org .? Visit  www.4174club.org  for a list of prizes (in progress now).? We will be continuously adding to the prize list so check back often for updates. ? Please bring unwrapped new children's pajamas, toys, or new books to benefit the \"Sanctuary for Families\" project. ? A special thank you to our Co-Hosts ~ sponsorship still available ? If you wish to send a check, please make it payable to \"The 41-74 Club of New York\", and mail it to: Sadie Longobardi  Amberlands Travel  1 Baltic Place  Croton on Hudson, NY 10520 Please follow all registration steps.? Your reservation is not confirmed until you receive an email with your ticket attached.? Please bring this ticket with you on the day of the event.  Cancellations on or before  December 5   will receive a full refund.? Tickets are non-refundable afte r  December 5, 2015 .  Space is limited and will sell out. Thank you for your support and we look forward to welcoming you! Iris Salazar????????????????? Florentina Florescu?????????????????? Samara Doucette  Chair??????????????????????????? Co-Chair???????????????????????????????????? Co-Chair"
}