{
    "addr": "Starr Foundation Hall. 63 5th Avenue. New York, NY 10003", 
    "title": "Academic Freedom, Free Expression, & China's Quest for World-Class Universities", 
    "url": "http://www.eventbrite.com/e/academic-freedom-free-expression-chinas-quest-for-world-class-universities-tickets-19016541989?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-03T18:00:00-05:00", 
    "endtime": "2015-12-03T20:00:00-05:00", 
    "categories": [
        "Education", 
        "Seminar or Talk"
    ], 
    "desc": "Academic Freedom, Free Expression, and China's Quest for World-Class Universities Thursday, December 3, 2015  6:00 - 8:00 PM  The New School  Starr Foundation Hall  63 Fifth Avenue  New York, NY 10011 The  Center for Public Scholarship?s  ? Endangered Scholars Worldwide ,  Scholars at Risk  Network  and  University of New Orleans Press  are hosting a panel ?discussion of China?s higher education system, its goals and the challenges it is facing. Our discussion will reflect on the government?s stated goal to create world-class universities in China, and will ask how this can be reconciled with continuing reports of prosecutions or other pressures against individual scholars and intellectuals. ? Can China become a world leader of higher education without full academic or expressive freedom? What challenges does this pose for western universities partnering with Chinese higher education, whether domestically by hosting student exchanges and Confucius Institutes, or through overseas programs or branch campuses? And what do these challenges in China mean for institutions partnering with higher education communities in other countries where academic and expressive freedom may be similarly constrained? ? ? ? ? ? ? ?? Teng Biao , ?Chinese human rights lawyer; visiting scholar, NYU School of Law?   Jewher Ilham , author and activist for her imprisoned father, Ilham Tohti?   Carl Minzner ,  Professor of Law, Fordham University School oif Law Moderator:? Jerome Cohen ? , faculty director, US-Asia Law Institute, NYU School of Law? This event is free and open to the public. Please register at?? Eventbrite . ? Please note, registration does not guarantee a seat. Seating is first come, first served. Please plan to arrive at least 15 minutes before the event begins and, if you wish to sit with someone, please arrive together and do not save seats. Thanks! Subscribe to our events newsletters . Founded in 1919, The New School was born out of principles of academic freedom, tolerance, and experimentation. Committed to social engagement, The New School today remains in the vanguard of innovation in higher education, with more than 10,000 undergraduate and graduate students challenging the status quo in design and the social sciences, liberal arts, management, the arts, and media. The New School welcomes thousands of adult learners annually for continuing education courses and lectures, screenings, readings, and concerts. Through its online learning portals, research institutes, and international partnerships, The New School maintains a global presence. Learn more at? www.newschool.edu ."
}