{
    "addr": "222 Jersey City Blvd Jersey City, NJ 07305", 
    "title": "3rd Annual Statewide Sickle Cell Disease Symposium November 21, 2015", 
    "url": "http://www.eventbrite.com/e/3rd-annual-statewide-sickle-cell-disease-symposium-november-21-2015-tickets-14594343073?aff=ebrowse", 
    "location": "Jersey City, NJ", 
    "starttime": "2015-11-21T09:00:00-05:00", 
    "endtime": "2015-11-21T14:30:00-05:00", 
    "desc": "We enthusiastically invite you?to The Sickle Cell Association of New Jersey's?3rd Annual Statewide Sickle Cell Symposium Saturday, November 21st from 9:00am to 2:30pm at the Liberty Science Center in Jersey City.??? Our goal is to improve and expand patient and provider knowledge and?to improve the treatment for sickle cell disease.??This Year's Workshops?&?Presenters: Dr.Jill Menell, St. Joseph's Medical Center-- The 411 on Hydroxyurea Ediomi Utuk, Co-Chair The Village Advisory Committee--SCANJ Patient Centered Outcomes Researh Project? Dr. Jennifer Krajewski, Hackensack University Medical Center--Bone Marrow Transplants Dr.Wanda Whitten Shurney, SCDAA Michigan and Detroit Children's Medical Center-- SCD 101 Kunal Sanghavi, MBBS, MS, Johns Hopkins Medicine--Telemedicine and Sickle Cell Disease Miralda Charles, MPH, Newark's Barnabas Medical Center-- Teen to Transition Dr. Ansley LaMar & Ayoola Ogunyimika,SCANJ Teen Spokesperson-- Youth Research Expedition And back again by popular demand is?a performance by New York's Big Apple Playback Theatre, the Lunch and Learn and museum admission to the exhibit halls. We're planning an exciting program suitable for?individuals effected by sickle cell disease, health care professionals?who provide care for patients with the condition from infancy to adulthood (including private practice physicians, hospitalists, ED staff, nurses, social workers), and the community at large. The Dr. Charles F. Whitten Awards?for outstanding service will be presented to individuals and organizations.? Early Bird Registration--?January 1, 2015 to November?16, 2015 is FREE.? Late Registration--?November 17, 2015-Day of Event?is?$25.00.? Parking validated.??For more information contact us at 973 482-9070."
}