{
    "addr": "50 W 28th St New York, NY 10001", 
    "title": "Preparing for the January Whole30 - New York, NY (12 PM)", 
    "url": "http://www.eventbrite.com/e/preparing-for-the-january-whole30-new-york-ny-12-pm-tickets-18894534060?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-12T12:00:00-05:00", 
    "endtime": "2015-12-12T14:00:00-05:00", 
    "categories": [
        "Health \\u0026 Wellness", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Please note, we also have  a 9 AM session  for this event on Saturday, December 12, 2015.  This special 2-hour seminar will be presented by Melissa Hartwig, co-creator of the  Whole30 program  and New York Times bestselling author of  It Starts With Food ? and? The Whole30 . ? PREPARE YOURSELF FOR THE JANUARY 1ST WHOLE30... AND AVOID FALLING FACE-FIRST INTO A PLATTER OF SUGARY TREATS BETWEEN NOW AND THEN. Whether you're a CrossFit NYC member preparing for their gym-wide Whole30 in January or a tri-state resident looking to reset your health and habits come the New Year, this special event with Whole30 co-founder Melissa Hartwig is a must-attend.? New to the Whole30? Perfect. Learn more about the program, the results you can expect, and how to prepare between now and January 1st. A Whole30 veteran? You'll still value the motivation, personalized advice, and community connections you'll make at this limited-seating event.? In this two hour seminar, Melissa will cover:? ? DO YOUR HOMEWORK Because we have limited time at this event, Melissa expects you to do some basic homework.? ? SEMINAR DETAILS This seminar runs from 9 AM - 11 AM, with a  very  short break at the halfway mark. Seating is limited at each event, so Melissa can better address your individual questions.  With your registration fee, you'll also receive a major swag-bag of some Whole30? Approved products we love. ? REFUND POLICY ? If you purchase a ticket, but discover due to work or family obligations you are unable to come to the event, please let us know in writing at least one week prior to the event date for a full refund. You may also transfer your ticket to another person--just email  headquarters@whole30.com  with their name and email address. We do not grant refunds to attendees who simply fail to show up for the event."
}