{
    "addr": "163 St. Nicholas Ave New York, NY 10026", 
    "title": "Project: Product Rescue", 
    "url": "http://www.eventbrite.com/e/project-product-rescue-tickets-18644471115?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-21T13:00:00-05:00", 
    "endtime": "2015-11-21T17:00:00-05:00", 
    "desc": "Project: Product Rescue  is a two-fold project in which women with curly and kinky textured hair can swap and donate new and gently used hair products, tools and accessories.  Project:   Product Rescue  is designed to provide quality essential hair care products and accessories to naturals who are unable to afford them. Our ultimate goal is to go global with this movement and provide underprivileged countries with proper hair care items which will not only promote healthy and proper hygiene but will boost the self-esteem of women and men around the world. We are starting this movement first in our own communities. New York City will be our first domestic stop the weekend of November 21st?. We are encouraging naturals in our community to join together in the spirit of giving and donating their unused hair products.  Attendees ?will also be able to swap their gently used products for new products. Additionally, we will be collecting canned goods for donations and giving away turkeys Please refer to our FAQs below for pertinent information. FAQS Is the event free? You do not have to purchase a ticket for admission. However, you must bring 2 gently used or new products for donation AND 3 canned goods for donation per person in order to enter the event. You also have the option of purchasing a food ticket along with your donation What is a gently used product? We will only be accepting products less than 1 year old and has less than 1/4 of the product used.? What type of products should I donate? We are seeking the basic essentials for hair care including but not limited to shampoo, conditioner, deep conditioner, moisturizer, gel, edge control, leave in conditioner, combs, brushes and hair ties . Can I swap if I donate a canned good? No, to be fair you can only swap if you bring a hair product. What type of canned goods should I donate? We are looking for one vegetable, one protein and one starch Where are the donations going? The both products and canned goods are being donated to local shelters in the NYC area. Are men welcomed? Of course!! We look forward to working with you to make this event a great success and helping make everyone?s holiday season a little more special!"
}