{
    "addr": "35 East 21st Street New York, NY 10010", 
    "title": "November Demo & Play Night", 
    "url": "http://www.eventbrite.com/e/november-demo-play-night-tickets-18478160676?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-30T18:00:00-05:00", 
    "endtime": "2015-11-30T21:00:00-05:00", 
    "categories": [
        "Gaming", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "Playcrafting NYC ? is the place to?see the newest independent games?being built in New York and network with the people who built them. Each month, we get together to watch awesome live game demos and play each game with the developers behind them. Join our community of game developers, designers, creatives, investors and more building across multiple platforms and genres.? Enjoy complimentary pizza as you meet the developers and network with game professionals from throughout our community. Plus our epic after party. Hope you can make it! We want to extend a special thank you to our Demo Night Sponsor? Pollen VC .? ? For Attendees: You must register on Eventbrite. Please include your first and last name when you RSVP. ?Your name must be on the list to get past building security.? Also, all guests must RSVP on their own in order to get each name on the list at the door. ?See you all there! For Developers: We're no longer accepting game submisions for this event. Please fill out the? online form ?here for your game to be considered for entry into future Demo & Play Nights. We'll reach out to confirm inclusion as those events are approaching. ? FEATURED GAMES ? Food Conga  by Mokuni LLC The classic ?snake game? meets ?match three? mixed with a motley cast of characters and uncommon food. Food Conga is a uniquely flavored mobile game made by the creators of ?Kitty in the Box.? Albert and Otto  by K Bros Entertainment Albert & Otto is a story about a boy and a magical bunny who journey together and solve puzzles in order to get back what was taken from them. Albert and Otto work together to overcome challenges thrown their way. We soon learn ?that what seemed at first like a journey to save the damsel in distress is anything but and that our hero Albert might be hiding something dark. Hecticube  by Graham of Legend Hecticube is a hectic, minimalistic, sports action-arcade experience which places you in a fast-paced multiplayer arena that will put your focus, speed, and dexterity to the test. FL337  by KWL Productions FL337 is the rebirth of the sidescroller beat 'em up. Enemies, bosses, combos, and power-ups comprise this action-packed brawler. Sumer  by Studio Wumpus Sumer is a new type of game: a multiplayer action game with the elegant strategy of modern European board games. As Sumerian nobles, players jump around a ziggurat, harvesting resources and sacrificing them to the gods. Between rounds, players participate in a M.U.L.E.-inspired real-time auction, offering up their wealth to bid on divine blessings. Pop the Lock  by Simple Machine The #1 top free iOS app in the US for more than a week was made in NYC! Tap in sequence to crack the code and pop the lock, but don't make a mistake or you'll have to start from the beginning. Various Projects  by Playcrafting Students Students from our 8 week Unity course will show off some of the prototypes they're working on! For more on the course and how to sign up, visit the course page online  here . Blade Ballet  by DreamSail Games Blade Ballet is a local multiplayer dance to the death. Players each control a robot that becomes a whirling dervish of destruction, attempting to knock out other robots by slicing them up. Players must also adapt to levels with unique challenges and features that change with each new round. Shardlight  by Wadget Eye Games In a post-cataclysmic world plagued by disease and hunger, a woman named Amy discovers that the all-powerful government is hiding a terrible secret. With the help of a mysterious figure, Amy will attempt to unite the oppressed, assist a revolution, and cure the plague that threatens humanity and her survival. ? Don't Miss the After Party!? Local Folks Multiplayer is bringing games made in the NYC area to the bar after the event.  Join us after Demo & Play Night for drinks and more games!"
}