{
    "addr": "74 Morningside Drive. 116 Street between Amsterdam and Morningside Drive. New York, NY 10027", 
    "title": "The Confined Arts 3rd Edition", 
    "url": "http://www.eventbrite.com/e/the-confined-arts-3rd-edition-tickets-17011181903?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-04T17:00:00-05:00", 
    "endtime": "2015-12-06T18:00:00-05:00", 
    "categories": [
        "Fine Art", 
        "Party or Social Gathering"
    ], 
    "desc": "With a new narrative and a brilliant group of artist, The Confined Arts will be reinvigorating the platform once again. The 3rd Edition  of The Confined Arts will?be a 40-day exhibition with an opening weekend consisting of?visual art, live poetry,?motivational speaking, panel discussions, a screening, workshops and more. Creative voices  will highlight a freshly recharged format at a much more refined location, while maintaining the powerful visual and performance pieces that have made this platform a unique medium to bring unheard voices and perspectives to the discussion of how the arts can continue to be a leader in the fight against mass incarceration across the country,  ???????? ?Opportunities and Change? and the ?Justice and Education Initiative? at Columbia University is hosting The Confined Arts?3rd Edition. The opening weekend will be spread across the three days, featuring an engrossment of powerful paintings, photographs, sketches, drawings and collage work from groundbreaking artists. All while captivating the creative voices of speakers, poets and conscious artist, as the sounds from musicians fill the atmosphere. Program Director Isaac Scott and the team behind The Confined Arts are working to provide the time and space for individuals across the ages to engage with artists, change makers, and activists, in our first stages of changing the narrative of the victims of mass incarceration. The arts transform and empower individuals, currently and previously incarcerated through this outlet of safe creative expression.  ???????? The Confined Arts provides humanity within the dehumanizing nature of incarceration. The Confined Arts will not allow the mental and physical bars of the system to hold in the creative voices, ideas, perspectives and talents of the range of incredible artists impacted. Challenging the unjust landscape surrounding the long-standing struggles for already marginalized communities in America, The Confined Arts works to weave a beautiful collective counter narrative for those trapped by confinement felt inside and out of incarceration. Join the expression: Opening weekend December 4-6, 2015: Friday December 4th: 4:30 PM-10PM,   Saturday December 5th: 12PM-10PM ,  Sunday December 6th: 12PM-5PM ? Heyman Center  for the Humanities at Columbia University 74 Morningside Dr., New York, NY 10027 ? To learn more about The Confined Arts, check out: http://www.opportunitiesandchange.com/the-confined-arts.html"
}