{
    "addr": "300 Park Avenue South. 8th Floor. New York , NY  10010", 
    "title": "XX+UX @ Rokkan", 
    "url": "https://www.eventbrite.com/e/xxux-rokkan-tickets-19606419328?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-02T19:00:00-05:00", 
    "endtime": "2015-12-02T21:00:00-05:00", 
    "categories": [
        "New York , NY  Events", 
        "Networking", 
        "Other"
    ], 
    "desc": "XX+UX is a monthly event for women in UX to meet and mingle. This month,  Rokkan ?will be hosting. Come see our ?panel of seasoned women in UX discussing? workplace/process from these 3 lenses agency, in-house and freelance. You will have the? opportunity to ask any questions and network.? \n \n 7:00 - 7:30 ? Mingle and network?while enjoying food and drinks \n 7:30 - 8:30 ?Panel Discussion and Q&A \n 8:30 - 9:00 ?Continue Mingling and Networking \n \n About the Panel: The purpose of this panel is to discuss the what it is like to work in UX in three different areas, Freelance, In house and Agency.?We have three seasoned women that will discuss their experiences both failures and successes, process and what it is like to work in these spaces.? \n About the Panelists: \n Margaret Shear, Interaction Design and Research Consultant Over the past decade, Margaret Shear has built an independent consulting practice as a?design team leader?and practitioner.?She?partners?with design consultancies, technology organizations, and start-ups to create digital products that improve people's daily lives. \n Recent project highlights?include collaboration?with Jawbone on the future digital experience for their wearable product?and leading experience design for OpenTable as they strategized a?mobile payments offering.?She?maintains?ongoing consulting?relationships with frog, Smart Design, Adaptive Path and others. \n In 2008, she co-founded, designed, and launched the first taxi-finding app ever to hit?the iTunes App Store. \n Margaret earned her bachelor's degrees from Stanford University in Studio Art and Science, Technology & Society. http://margaretshear.com \n \n Maria Moratis, User Experience Director? ? Maria?s?objective is to translate business vision into intuitive and engaging user interfaces. With more than 15 years? experience, her expertise covers a broad range of industries with a deep focus? on?financial services.?Prior to joining Isobar, Maria worked at J.P. Morgan's Securities Services for four years,?where?she was?a Client Experience Lead designing a variety of client facing applications \n A graduate of the Interactive Telecommunications Program at New York University, Maria is the?chair emeritus of the New York chapter of CHI (Computer Human Interaction group: the professional organization for human interaction professionals). She also holds?a MBA?from Columbia University and judges in various new venture competitions such as New York Next Idea and?Ultralight?Startups. In 2001, Maria founded Usable Systems, a user experience strategy practice. The practice?s mission is to create engaging, meaningful and intuitive online experiences. The practice has advised clients such?as:?the?Collegeboard, Novartis and Oxygen Media. http://usablesystemsdesign.com \n \n Irene Pereyra,? Founder and the User Experience Director Growing up?in?Amsterdam I?was constantly surrounded by?modernist design, which very heavily influenced my?taste and sensibilities. To?me, great design is?practical and starts with?breaking things down to?its simplest form, the straightest line from A?to?B. Anything superfluous makes me?uneasy. I?frequently have heated debates on?how things can be?done better with less?stuff. http://antonandirene.com \n About the Moderator: \n Janine Toro, Senior User Experience Designer? Janine Toro is a designer, educator, alumnus of the School of Visual Arts Designer as Author + Entrepreneur program and founder of?What Do You Carry, a website showcasing what creative types carry daily. Her passion and enthusiasm for design is constant as she is actively?sharing her knowledge and involved in the design and education community. Design has remained a constant force in her life and has become a part?of everything she does including her love of cooking and side projects. She currently is a Senior Experience Designer at Rokkan in New York City. www.janinetoro.com \n \n There will be drinks, food and a chance to socialize with some of the best and brightest ladies in design, research and technology! \n We regularly sell out at these events, so sign up early to guarantee your spot. \n - - - - - - \n Join the  G+ Community  to connect & hear about future events: \n #xxux"
}