{
    "addr": "42-09 28th St New York, NY 11101", 
    "title": "Youth Mental Health First Aid Training", 
    "url": "http://www.eventbrite.com/e/youth-mental-health-first-aid-training-tickets-17763708731?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Mental health", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Youth Mental Health First Aid  ? Youth Mental Health First Aid USA is an 8 hour public education program which introduces participants to the unique risk factors and warning signs of mental health problems in adolescents, builds understanding of the importance of early intervention, and teaches individuals how to help an adolescent in crisis or experiencing a mental health challenge. Mental Health First Aid uses role-playing and simulations to demonstrate how to assess a mental health crisis; select interventions and provide initial help; and connect young people to professional, peer, social, and self-help care. ? WHAT WILL PARTICIPANTS LEARN? ? The course teaches participants the risk factors and warning signs of a variety of mental health challenges common among adolescents, including anxiety, depression, psychosis, eating disorders, AD/HD, disruptive behavior disorders, and substance use disorder. Participants  do not  learn to diagnose, nor how to provide any therapy or counseling ? rather, participants learn to support a youth developing signs and symptoms of a mental illness or in an emotional crisis by applying a core five-step action plan:  ? ?  A ssess for risk of suicide or harm  ? ?  L isten nonjudgmentally  ? ?  G ive reassurance and information  ? ?  E ncourage appropriate professional help  ? ?  E ncourage self-help and other support strategies  ? The Youth Mental Health First Aid USA curriculum is primarily focused on information participants can use to help adolescents and transition-age youth, ages 12-18. ? WHO SHOULD TAKE THE COURSE? ? The course is designed for adults who regularly interact with adolescents (teachers, school staff, coaches, youth group leaders, parents, etc.), but is being tested for appropriateness within older adolescent groups (16 and older) so as to encourage youth peer to peer interaction. In January 2013, President Obama recommended training for teachers in Mental Health First Aid. Since 2008, the core Mental Health First Aid course has been successfully offered to hundreds of thousands of people across the USA, including hospital staff, employers and business leaders, faith communities, law enforcement, and the general public. ? WHO CREATED THE COURSE? ? Mental Health First Aid USA is coordinated by the National Council for Behavioral Health, the Maryland Department of Health and Mental Hygiene, and the Missouri Department of Mental Health. Mental Health First Aid USA worked with experts at the National Technical Assistance Center for Children?s Mental Health at the Georgetown University Center for Child and Human Development to develop the youth program. ? TRAINING TIME 8:30AM-5:30PM ? ***Please only register once for this course***"
}