{
    "addr": "97 Sunfield Avenue Edison , NJ 08837", 
    "title": "New Jersey Comic Expo", 
    "url": "http://www.eventbrite.com/e/new-jersey-comic-expo-tickets-16091112952?aff=ebrowse", 
    "location": "Edison , NJ", 
    "starttime": "2015-11-21T10:00:00-05:00", 
    "endtime": "2015-11-22T17:00:00-05:00", 
    "desc": "New Jersey Comic Expo is a comic book convention being held at the New Jersey Convention & Exposition Center in Edison, NJ on November 21 & 22, 2015. It?s a celebration of comic books and pop culture that showcases the exceptional works of talented writers, artists, illustrators and creators of all types of pop culture. At the New Jersey Comic Expo, you?ll find exhibitors promoting and selling all types of related products, as well as entertaining and educational programs for all ages, guest signings and meet & greet sessions with celebrities. For more specific information about the show,  please check out the? FAQ section ?of the website. New Jersey Comic Expo is MAD Event Management LLC? production. Online ticket sales will end at 8:00 PM on Friday, Nov. 20 - buy your tickets at the door beginning Saturday, Nov. 21 at 10:00 am or at your local comic book retailer. Tickets purchased at the door will be priced higher than tickets purchased here.? Show Hours: Saturday, Nov. 21 - 10:00 am - 7:00 pm (Advance Ticket holders at 9:30 am) Sunday, Nov. 22 - 10:00 am - 5:00 pm (Advance Ticket holders at 9:30 am) Kids age 10 and under are admitted for free when a parent or guardian purchases a ticket (limit of 2 free kids per adult ticket). ?Tickets are not required for children. We are pleased to offer a $5 discount to ?members who are active and former military and law enforcement (use code MilitaryLawEnforcement), as well as senior citizens (SeniorCitizen) aged 65 and over. Questions? ?Please visit the FAQ section of the website. ?We use a bar code system for tickets purchased online, so please keep a copy of your receipt to bring to the Expo. Refunds are available until November 21, 2015 when requests are made in writing to? CustomerService@newjerseycomicexpo.com and include the order number, order date and email address of the attendee. ?Tickets are also available for sale at the Door (prices will be higher) and at your local Comic Book Shop. Frequently Asked Questions: What can/can't I bring to the event? We welcome attendees dressed in costumes, but do require a strict weapon check before entrance (so don't bring any real weapons with you, even if it's part of your costume). Where can I contact the organizer with any questions? ? You can reach us at customerservice@newjerseycomicexpo.com with any questions. Is my registration/ticket transferable? Your registration is transferable. ?You may change the name on your ticket by entering the site and using your original confirmation number."
}