{
    "addr": "1605 Broadway New York, NY 10019", 
    "title": "Couture Fashion Week New York February 2016", 
    "url": "http://www.eventbrite.com/e/couture-fashion-week-new-york-february-2016-tickets-18809351276?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-02-12T18:00:00-05:00", 
    "endtime": "2016-02-14T23:30:00-05:00", 
    "categories": [
        "Fashion", 
        "Festival or Fair"
    ], 
    "desc": "Venue:  Crowne Plaza Times Square Manhattan 1605 Broadway  (between 48th/49th Streets) Fashion Shows:  Broadway Ballroom, 4th floor Parties:  Brasserie 1605, Lobby Level GENERAL TICKETS: FRONT ROW TICKETS: PLATINUM VIP TICKETS: FRIDAY AND SATURDAY AFTER PARTIES ?*** GROUP TICKET OPTIONS *** About the Event: 23rd Season!   Couture Fashion Week presents a series of couture and luxury fashion shows twice a year in New York City. Reserve your spot today to experience an incredible showcase of luxury and style. *?? *?? * What some recent guests have to say... \"My daughter just got back from NY and I can't express how much she enjoyed the Couture Fashion Show yesterday. She said it was the best birthday ever! The whole experience of the show and the seats and everyone there was thrilling.\" \"The event was fabulous! It was my first fashion show ever and it was better than I ever dreamed. Thanks again.\" \"The show was really fabulous. My friend from Israel was so pleased. We went early and had the most ideal seats. The fashion and the models were top notch. Planning to attend every year from now on.\" \"Last year my company purchased 22 tickets for various clients; well the event was a hit and a huge success. We would be very interested in attending the event again this year but in a much more grandiose manner. We are an international company with international and domestic clients. Our clients were raving about the event and are asking about this year.\" Frequently Asked Questions  | Visit the? CFW YouTube Channel *?? *?? * For more questions, email: info@couturefashionweek.com Please do NOT contact the Crowne Plaza Times Square Manhattan"
}