{
    "addr": "Madison ave. New York, NY 10016", 
    "title": "NYC Real Estate Investor Orientation", 
    "url": "http://www.eventbrite.com/e/nyc-real-estate-investor-orientation-tickets-6852045653?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-24T18:30:00-05:00", 
    "endtime": "2015-11-24T20:30:00-05:00", 
    "desc": "Want to work smarter for yourself? Want to be financially free?? Today I would like to invite you to our 2-hr real estate investing orientation where you will meet with our local real estate investment team and learn more about what we do as real estate investors & business ownership. Bring something to take notes with and come sit back and listen to why real estate investing is meant for everyone. Whether you like real estate or not, you might not realize yet that you already are an investor. You most likely pay for where you live now and you invest in someone's dreams! We all either pay a rent/mortgage or we get paid rent/mortgage. Would you rather pay someone for where you live, or would you like to get paid? How would you like to get FREE education, maybe a FREE car every couple years? We will show you how SMART investors are doing exactly that. At our 2-hr real estate investing orientation, we intend to show why that possibility has slipped past the 99% and what we are doing with real estate TODAY! We will ? show you the ONLY curriculum based, ongoing, and scalable education platform in the industry. ? show you a plan that has assisted students, in our community, to a net worth over a million dollars in controlled assets. ? show you how you can be involved in the properties that we are involved in. ? show you to a working business model that you could have walk down the hall to your home office instead of fighting traffic. ? show you the ways to make money, and how to be wealthy with a variety of strategies. ? show you how you could be done interviewing for jobs for the rest of your life and comprehensively teach your children how to BE the same! WE ARE LOOKING FOR PEOPLE WHO WANT TO MAKE MONEY: ? In Real Estate Investing: We are looking for those who want to learn how to be an investor and those who want to build wealth through investments in Real Estate. Not only do we invest locally, but we also invest nationwide. Our investment associates earn anywhere from $5000-$100,000 per real estate transaction depending on the type of real estate transaction. A real estate license or experience is not necessary, but if you have either, great. Either way, we are here to show you how to be a real estate investor, where to invest, and our ways to make money. We work with everybody in our real estate investor training programs and here to help you build your own real estate investment portfolio. and/or In Sales/Marketing: If you enjoy getting out and being around people, attending our wealth building workshops and real estate seminars, this can help you to network and get to help other people interested in real estate investing get started with their home based business. You can do most all your work from home! Once certified, our sales agents are paid to enroll new real estate investing training associates. We get paid on Tuesday's & Friday's (8X a month). Our home based business is yours to control as long as you are willing to network and help provide customer service to the people you get enrolled. That's it! We create successful real estate investors and we have the results to prove that our system works. You must be coachable, willing to work very hard, dedicated, and most importantly passionate about the field of REAL E$TATE. We are very selective of whom we work with, and timing is everything. NOW IS THE TIME to make YOUR move towards building wealth. Register for a real estate seminar and come learn how you can build that massive and passive income working with us. We have offices local and we work with our associates making sure they are successful. CHANGE YOUR FINANCIAL FUTURE, Register Above! Learn Different Financing Strategies with or without your money through Self Directed IRA's, HSA's, Private Funding, Hard Money Lenders, Short Sales, Foreclosures & REO's, Fix & Flips, Rehabbing, Tax Liens, Wholesaling, Buy & Hold, Rent or Least Options, No Money, No Credit Acquisition, Subject To Investing, Multi Units or Apartment Complexes, Seller Financed Notes, Commercial Investments, and much more!"
}