{
    "addr": "727 7th Avenue New York, NY 10019", 
    "title": "World Famous New Years Eve 2016 in Times Square - Steps From The Ball Drop!", 
    "url": "http://www.eventbrite.com/e/world-famous-new-years-eve-2016-in-times-square-steps-from-the-ball-drop-tickets-15185052902?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-31T20:00:00-05:00", 
    "endtime": "2016-01-01T00:00:00-05:00", 
    "categories": [
        "New Years Eve", 
        "Party or Social Gathering"
    ], 
    "desc": "Includes: ? ? T he famous ball drop at One Times Square is televised every year and has been a? New York City New Years Eve (NYE) ?tradition since 1906. The lead-up to the famous ball drop was for years emceed by Dick Clark, who recently turned the reigns over to his multimedia liege, Ryan Seacrest, whose road to the top was paved by his host gig on television's ?ber-popular \"American Idol\". Hundreds of thousands of people come to the free Times Square New Years celebration every year, so if you are looking to get a good spot, then this is the place to be. Just how close ?is TONIC to \"Where the Ball Drops\"??? ? Notice? Tonic ?sign on left, ball drop in center of photo above \" Toshiba \" Actual photos take by guests' in years past? ? ? ? ?~ ? ? Photos of Tonic ? ? ? ? ? TICKET HOLDERS WILL BE ABLE TO ACCESS TONIC TIMES SQUARE VIA 6TH AVENUE + 49th STREET. YOU MUST SHOW PRINTED EVENTBRITE TICKETS AT SECURITY CHECKPOINTS. PLEASE BE SURE TO PRINT OUT YOUR TICKETS. DOORS OPEN AT 8PM!? YOU MUST ARRIVE BY 10:30PM DUE TO SECURITY CONCERNS. ? New Year's Eve ticket prices often go up significantly (100% +) the closer you get to New Years Eve. Also note that many NYE Events will sell out well in advance of New Years Eve.? About your Tickets:? ?(1) Show up early and help reduce the wait time, (2) Make sure to have your physical ticket on hand because you will need to show it to NYPD and security upon request, (3) You accept the risks and agree to adhere to the NYPD rules and regulations for the evening, (4) A LIVE VIEW of The Ball Drop is not guaranteed. Large crowds should be expected"
}