{
    "addr": "242 West 41st Street New York, NY 10036", 
    "title": "Fixed Income 2016:  The BIG Fix", 
    "url": "http://www.eventbrite.com/e/fixed-income-2016-the-big-fix-tickets-18158200667?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-01-28T12:00:00-05:00", 
    "endtime": "2016-01-28T17:30:00-05:00", 
    "categories": [
        "Finance", 
        "Conference"
    ], 
    "desc": "OTC fixed income markets rambled on for decades; the model for progressing, executing, and processing information and trades remained virtually unchanged. As the markets prospered, the adage ?If it ain?t broke, don?t fix it? ruled the day. In the wake of the financial crisis, however, the traditional market structure is finding itself challenged by a variety of catalysts, and the call for change is omnipresent. The status quo is besieged on all sides by pressures it no longer can resist. The time has arrived to fix a market that is demonstrating signs of breaking down, and collaboration among participants will be critical.? ? 12 pm - 1 pm ?? Registration & Networking ? 1 pm ?  Welcome -  Brien Henderson, Partner, Managing Director, Sales and Marketing,  TABB Group ? 1:15 pm -  Opening Address & A Look at the Fixed Income Practice 2016 -  Anthony Perrotta, Partner, Global Head of Research and Consulting,  TABB Group   ? 1:15 pm ? 2 pm ?? Metamorphic Market: Transformation in U.S. Treasury Trading? We?ll assess the changes that are reshaping the manner in which risk is transferred and hedged in this critically important bond market and examine the ways key characteristics of modernization ? technology, automation and velocity ? are complementing disclosed relationships to bring about a new paradigm. Speakers: ? 2 pm ? 2:30 pm -? Keynote? ? 2:30 pm ? 3:15 pm ?-? The Network Effect: Unlocking Liquidity?? As regulatory and market forces alter the liquidity landscape and erode the traditional model, alternative mechanisms for search, discovery and intermediation of risk are on the rise. Connecting asset owners is key to moving capital around the market. Exchanges, SEFs, ECNs, ATSs, and single-dealer platforms are leveraging technology to connect market participants. Can these new platforms develop beyond an efficiency tool and fundamentally enhance liquidity?? Speakers: Moderated by: Callie Bost, Analyst,  TABB Group ? 3:15 ? 3:45 pm -? Networking Break ? 3:45 pm ? 4:30 pm ?? Bridging the Divide: Liquidity Alternatives? As fixed income markets expand and become increasingly challenged, traditional investment vehicles are being complemented by alternative products, giving investors options for managing beta and generating alpha. We?ll delve into the relentless growth of fixed income ETFs, and determine whether all that glitters is gold. Speakers: ? Moderated by: Radi Khasawneh, Analyst,  TABB Group ? 4:30 pm ? 5:15 pm ?? Fixed Income Exoskeleton: Empowering the Market? The balance of power in the fixed income market has shifted. As the drive to connect market participants accelerates, asset owners require the tools necessary to manage risk transfer. Are buy-side firms prepared for the changing environment? What tools are needed to allow them to emerge unscathed as the paradigm shifts? Speakers: ? Moderated by: Terry Roche, Principal, Head of FinTech Research,  TABB Group ? 5:15 pm ?? Closing Remarks -  A nthony Perrotta, Partner, Global Head of Research and Consulting,  TABB Group ? 5:30 pm ?- Cocktail Reception ? ?Sponsors:"
}