{
    "addr": "394 Broadway. 5th Floor. New York, NY 10013", 
    "title": "Spark Manhattan: How to Cultivate Successful Client Relationships", 
    "url": "http://www.eventbrite.com/e/spark-manhattan-how-to-cultivate-successful-client-relationships-tickets-19426294570?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-02T19:00:00-05:00", 
    "endtime": "2015-12-02T20:30:00-05:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Meeting or Networking Event"
    ], 
    "desc": "Cultivating successful client relationships means onboarding clients before they even meet you. It starts with a website or portfolio that highlights you as a problem-solver and it ends with a satisfied client referring someone new your way! ? It?s time to flip the narrative: you don?t want to work for good clients,  good clients want to work with you . ? Join Spark on December 2 and workshop ?How to Cultivate Successful Client Relationships?! ? Express a clearer vision to bring in better clients ? Align your services with your values to ensure your needs are met ? Improve communication by learning from past experiences Flip problems into opportunities to become indispensable  ? J ustine Clay has been helping freelance creative talent build thriving careers for more than 15 years. She began her career in creative representation and, in 2010 Justine launched her coaching business,   Pitch Perfect .  Working with freelance creative professionals and entrepreneurs of all stripes, Justine teaches her clients how to position, market and profit from their creative expertise through one-on-one coaching, her  Market & Grow Your Creative Business  on-line course, and workshops.? Sign up for Justine?s free 6-part video   series at   www.6stepstomoredreamclients.com   and start growing your creative business or career today! ? This Spark event is brought to you by? Freelancers Union and Pitch Perfect: Career Coaching for Creative Professionals .? Learn more about us below! ? Official Spark Sponsor ? ? Become A Spark Co-Leader! Interested in helping Spark Manhattan grow? We're looking for co-leaders! Whether you'd like to help with promotions, volunteer your photography skills, or lead the event itself, we'd love you to join our team. ? APPLY HERE now! ? ? ?? ? ? ? ??  ? ? About Freelancers Union? Freelancers Union is a membership organization that provides benefits, resources, and advocacy for 300,000 independent workers nationwide. To learn more or join, visit? freelancersunion.org .? Membership is free. ? About Impact Hub Impact Hub NYC is a coworking & events space for a membership community of entrepreneurs, activists, creatives, and professionals taking action to drive positive social and environmental change. Experience it firsthand and  sign up for a free week  with the Hub NYC community! (Referral Code: FREELANCE)"
}