{
    "addr": "185 West Broadway New York, NY 10013", 
    "title": "The 2016 NYC Gifted & Talented Symposium & Benefit", 
    "url": "http://www.eventbrite.com/e/the-2016-nyc-gifted-talented-symposium-benefit-tickets-16106931265?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-03-12T08:00:00-05:00", 
    "endtime": "2016-03-12T16:00:00-05:00", 
    "categories": [
        "Education", 
        "Conference"
    ], 
    "desc": "Update ?your calendar!?PALNYC announces the second biennial? 2016 NYC Gifted & Talented Symposium & Benefit is now on ? Saturday, March 12, 2016 !? ?  one day to invest in your child?s future . This day-long symposium, presented by? PALNYC? will help parents and educators support the cognitive, social and emotional development of NYCs high potential youth. Explore the pre-K through 8th grade educational landscape in NYC, programs that cater to the talents and strengths of G&T learners, and learn ways you can support your child's unique strengths and interests through local and online resources.? Participants interested in a full refund due to the date change may contact Angelique LeDoux directly at palworkshops@me.com. ? Network and Collaborate? with like-minded parents and specialists from some of NYC?s most unique & competitive programs Visit ? the Curated Exhibit Hall ?to discover local and online programs specifically focused on unique school and after school programs, holiday camps, specialized programs, testing, tutors, ed tech support, financial aid & more. Learn about the different school and educational options relevant to your child,? including co-ed versus single sex, boarding versus day programs, progressive versus traditional school philosophies, gifted & talented versus gen ed programs, public versus private, charter and every other option you can think if for your pre-K-8th grader. Time & Date : 8:00am - 4:00pm, Saturday March 12, lunch included Location :? ? New York Law School ??185 West Broadway, New York, NY Attendees : Parents of pre-k through middle school students Registration : Visit our? Eventbrite ?page to register Tickets : $75 early bird special until December 15, 2015, $99 standard, $125 at the door *nonprofit and donor discounts are available online for a limited time. Contact : Angelique LeDoux @ 212.343.8881? or via email @? palworkshops@me.com ? Who Should Attend? Parents and educators, principals, mental health professionals, education researchers, ed tech specialists, consultants, school counselors, pediatricians and pediatric dentists, school nurses, and anyone who wants to join the conversation about supporting NYC's high potential youth.? The content is relevant for parents and professionals from Pre-K through middle school.? There is something for everyone? Do you suspect advanced ability in your child but you?re not sure how best to support it? Want the inside scoop for getting your child into a Gifted & Talented program? Want to know if there is a better school fit for your child?s learning style? Need resources for supporting the talent development and passion area of your budding computer programmer, math wiz or entrepreneur? Want a richer understanding of what it means to raise a gifted child- the perfectionism, the potential for underachievement and uneven development? Looking for ways to individualize and differentiate learning in your classroom with mixed ability kids? Or want better tools to connect what?s happening in the classroom to kids and parents for better engagement? Click here to view The 2015 NYC Gifted & Talented 'Right Fit' Symposium & Benefit schedule & directory or click the Agenda below for more details. ? The NYC Gifted & Talented Symposium & Benefit? includes topics on talent development, social & emotional development and how to negotiate the practical matters for parents and educators of NYCs high potential youth, including:? Supporting Your Child's Passion; Preparing for the Road Ahead; The ABCs of Pre-K: Understanding the Options and Approaches; Admissions & Testing for Elementary, Demystified; Understanding G&T Ability: The Issues of Giftedness; 90th Percentile: Who Cares?; It's Elementary:The Official Story on G&T Options in NYC; Executive Function and Organizational Skills for Middle Schoolers; Self-Dismissal, Safety & Being NYC Street Savvy: A Parent Primer; Transition Time: Supporting Culturally Diverse, High Ability Kids; Navigating the Twice Exceptional Path; What to do When It's Not the Right Fit; Middle School Mayhem: Parent Perspectives,  and much more. ?For a better idea of what to expect from the panels and workshops at this year's Symposium, view the tentative? Schedule at a Glance ? and stay tuned for a full list of speakers and workshops. The NYC G&T Symposium is currently taking? applications ?for exhibitors and sponsors at the NYC G&T Symposium. ?The symposium is co-sponsored by? PALNYC ?and organized by an advisory committee comprised of select pre-K through high school organizations in New York City including representatives from a wide range of schools and organization including those that specialize in in gifted education.? Past supporting organizations of the NYC Gifted & Talented Symposium have included? NAGC, AGATE, PACE, NJAGC, RIISE Diversity Recruitment, Common Sense Media ?and more. In addition to well rounded panels, expert speakers and the announcement of the winners of the 3rd annual ? Michael Perelstein Memorial Scholarship Fund?s Discover Your Passion? Competition , the Symposium boasts a ?Curated Exhibit Hall. ?A hallmark of the Symposium and touted by past attendees to be? ? ??a wonderful opportunity to engage with the NYC community? the Exhibit Hall will include a sampling of NYC's finest educational programs and schools. Interested in Presenting?at the 2016 NYC G&T Right Fit Symposium? The application deadline?for presenting at the NYC G&T Symposium has passed. For more information on presenting with PALNYC in the future contact Angelique LeDoux via email at palworkshops@me.com."
}