{
    "addr": "643 Park Avenue New York, NY 10065", 
    "title": "New York Art, Antique & Jewelry Show - November 20-24, 2015", 
    "url": "http://www.eventbrite.com/e/new-york-art-antique-jewelry-show-november-20-24-2015-tickets-18056489446?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-20T19:00:00-05:00", 
    "endtime": "2015-11-24T17:00:00-05:00", 
    "desc": "will host over 80 international exhibitors at the Park Avenue Armory (643 Park Avenue at 66th Street) ? November 20-24, 2015, with a private Opening Night Preview on November 20th. ?The show is a must-shop event, offering collectors a stunning selection of high-quality offerings from ancient antiquities, through 21st century contemporary art, including furniture, fine art, antiques, jewelry, silver, art, glass, enamels, photography, porcelain, pottery, objets de Vertu, rare books and manuscripts, rugs and tapestries, jewelry and more. ? Saturday, November 21 ? ? ? ? ? ? 11am ? 8pm Sunday, November 22 ? ? ? ? ? ? ? 11am ? 6pm Monday, November 23 ? ? ? ? ? ? ? 11am ? 8pm Tuesday, November 24 ? ? ? ? ? ? ? 11am ? 5pm You can reach Park Avenue Armory on the 6 train at 68th Street/Hunter College or the F train at 63rd Street/Lexington Avenue. You can take the M101, M102, or M103 (limited and local) to 68th Street and Lexington Avenue; M66 to Lexington Avenue and 67th Street (Westbound) or Madison Avenue and 68th Street (Eastbound). for more information on show location and parking.? Due to security reasons, attendees? items will not be allowed in to the New York Art, Antique & Jewelry Show. It is the duty of the security officers at the entrances to check all bags coming in to the show ? if you have items in your bag, you will not be allowed to bring them inside. The reasoning behind this is simple: all exhibitors are required to present customers with a ?Pass Out Form? when any purchase is made. This form is required by security for anyone to bring merchandise out of show. Wheelchairs are provided at the show and can be loaned to attendees in need of assistance with a valid form of identification from the Box Office. Electric Scooters are NOT provided at the show. However, they are permitted inside the show. Anyone in need of an electric scooter will need to make arrangements personally, prior to attending the show. ? Visit  ?or email info@palmbeachshow.com"
}