{
    "addr": "251 Mercer Street. New York, New York 10012", 
    "title": "Hour of Code", 
    "url": "http://www.eventbrite.com/e/hour-of-code-tickets-18992367683?aff=ebrowse", 
    "location": "New York, United States", 
    "starttime": "2015-12-12T11:00:00-05:00", 
    "endtime": "2015-12-12T17:00:00-05:00", 
    "categories": [], 
    "desc": "Anyone can learn the basics of coding  and become a maker, a creator, an innovator! ? The  Hour of Code  is a global movement reaching tens of millions of students in 180+ countries -  ages 4 to 104 are welcome  to attend our day of learning to code on  Saturday Dec 12th at NYU . Come join  Big Apple Py ,  ACM at NYU ,  Knewton  and  CoderDojo NYC  to try your first programming project at an  Hour of Code , a campaign to introduce  10 million people  to one hour of programming during  Computer Science Education Week.  What : Make your first programming project    When : Saturday, Dec 12, from 11AM - 5PM (food and drinks provided)   Where : NYU Courant Institute.?251 Mercer Street, NYC 10012    Details : Attendees will need to provide their own laptop. This is a free event. A huge thank you to our venue sponsor  ACM at NYU (NYU's Association for Computing Machinery) , and to  Knewton , who will be providing lunchtime food and refreshments! ? Event Organizers & Sponsors     ? Community Partners Is your group participating, mentoring,? or helping to spread the word about this event?  We'd love to include you on this page!  ? Use the? \"Contact the Organizer\" button on your right ?to let us know. ? What is the Hour of Code initiative? We live in a world surrounded by technology. And we know that whatever field our students choose to go into as adults, their ability to succeed will increasingly hinge on understanding how technology works. But only a tiny fraction of us are learning computer science, and less students are studying it than a decade ago. That?s why  Big Apple Py ,  ACM at NYU ,  Knewton  and  CoderDojo NYC  are joining in on the largest learning event in history: The Hour of Code, during Computer Science Education Week (Dec. 7-13). Last year, 15 million students tried computer science in one week. This year, we're joining students worldwide to reach 100 million students! ?? Answers to Common Questions Q: What curriculum will we go through on Saturday? ? A: We will be going through some of the  Hour of Code curated activites . We will focus on the Python tutorials (for applicable ages) but also try to help with any of the others if participants choose them. Q: Does Saturday's Hour of Code event take one hour or six? A: Each tutorial take about an hour. After participants complete their first Hour of Code, they can head out if they need to or stick around to try a few more! Q: The Hour of Code website mentions students a lot, but I am not a student. Can I still participate? A: Absolutely! The Hour of Code iniative was started to encourage more schools to add computer science to their curriculum, but everyone can benefit from learning how to code, whether you're 4 or 94. Q: I don't have a laptop but I still want to learn how to code. What should I do? A: You can still learn the principles of coding, even without a laptop! Hour of Code has an  \"unplugged\" tutorial series  for folks without a device or internet, and we'd be happy to help you with one of those as well!"
}