{
    "addr": "268 West 47th Street  New York, NY", 
    "title": "Bronx Science Class of 1966 50th Year Reunion", 
    "url": "http://www.eventbrite.com/e/bronx-science-class-of-1966-50th-year-reunion-tickets-18973877378?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-04-16T18:00:00-04:00", 
    "endtime": "2016-04-16T22:00:00-04:00", 
    "categories": [
        "Family \\u0026 Education", 
        "Meeting or Networking Event"
    ], 
    "desc": "Bronx High School of Science Class of 1966 ?50th year reunion, Saturday April 16th at the Copacabana in New York City. Oh, what a night it will be!? Surely an evening to remember! Join us for what is shaping up to be a magical evening, steeped in fond memories, as we celebrate the Bronx High School of Science Graduating Class of 1966? ?? 50 years on! The event will take place on Saturday, April 16, 2016 at the legendary COPACABANA ?It?s the perfect reunion venue, featuring multiple areas in which to eat, drink, and mingle, with a glass roof adding fantastic sky views.? A mix of lounge seating and table seating, with plenty of room to move about, will complement the mood and intention of the evening, as you catch up with old friends and classmates while enjoying a delectable repast. Here?s a sampling of the planned menu, included in the cost of your ticket --- * Please contact a committee member regarding any particular dietary requirements and/or considerations * Kosher meals will be available at an additional cost Ticket Pricing: Tickets are $140  through  January 15, 2016  ? Buy early and save! Tickets are  $160 per person after January 15, 2016  Please note there will be a small processing fee added on to the price of a ticket through Eventbrite. As the Reunion Committee continues to plan for this highlight event, and other weekend? possibilities, including a School visit on Friday, you are encouraged to sign on early, not only to? indicate your intended participation and allow others to see who's coming, but to help? cover early costs. Needless to say, it is a necessary consideration."
}