{
    "addr": "598 Broadhollow Road Melville, NY 11747", 
    "title": "12th Annual Long Island Fight for Charity 2015", 
    "url": "http://www.eventbrite.com/e/12th-annual-long-island-fight-for-charity-2015-tickets-17941082260?aff=ebrowse", 
    "location": "Melville, NY", 
    "starttime": "2015-11-23T17:30:00-05:00", 
    "endtime": "2015-11-23T22:00:00-05:00", 
    "desc": "Prominent ?above the line? name recognition on all print materials and advertising 14 VIP tickets Full-page color ad in  Main Event Journal Banner displayed at Boxer Matchup Cocktail Reception Banner displayed at Main Event Sponsor name listed on the cover of the event brochure Logo and link on the Fight for Charity website and social media mentions Brand name and logo displayed and mentioned during online live stream of the event? Name recognition on all print materials and advertising 12 VIP tickets Full-page color ad in   Main Event Journal Banner displayed at Boxer Matchup Cocktail Reception Banner displayed at Main Event Logo and link on the Fight for Charity website and social media mentions Sponsor name listed on cover of the event brochure Brand name and logo displayed and mentioned during online live stream of the event? ? Company name on two corners of the ring and advertising Name recognition on all printed materials 10 VIP tickets Full-page color ad in   Main Event Journal Banner displayed at Main Event Logo and link on the Fight for Charity website and social media mentions Brand name and logo displayed and mentioned during online live stream of the event? Name recognition on all print materials and advertising  out of the 10 bouts will be   - your brand name and your logo in the ring Your own ?Boxer? (optional) featured in  10 VIP Main Event Tickets; 5 Boxer Main Event Tickets Full-page color ad in   Main Event Journal High visibility at pre-event Boxer Matchup Reception Logo and link on the Fight for Charity website and social media mentions Brand name and logo displayed and mentioned during online live stream of the event? Company logo on judges voting signs 8 VIP tickets Full-page color ad in   Main Event Journal Banner displayed at Main Event Logo and link on the Fight for Charity website and social media mentions Brand name and logo displayed and mentioned during online live stream of the event? Company name displayed on each Round Card 6 VIP tickets 1/2-page color ad in   Main Event Journal Banner displayed at Main Event Logo and link on the Fight for Charity website and social media mentions Brand name and logo displayed and mentioned during online live stream of the event ? Company name on a boxer?s robe or trunks 6 VIP tickets 1/2-page black-and-white ad in   Main Event Journal Logo and link on the Fight for Charity website and social media mentions 4 VIP tickets 1/4-page black-and-white ad in the   Main Event Journal Logo and link on the Fight for Charity website and social media mentions Company name on your favorite boxer?s trunks"
}