{
    "addr": "15 West 43rd Street New York, NY 10036", 
    "title": "CUPA-HR NY Metro 2015 Holiday Program:  A Year in Review: A Regulatory HR Update", 
    "url": "http://www.eventbrite.com/e/cupa-hr-ny-metro-2015-holiday-program-a-year-in-review-a-regulatory-hr-update-registration-19315595466?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-03T15:30:00-05:00", 
    "endtime": "2015-12-03T19:30:00-05:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Meeting or Networking Event"
    ], 
    "desc": "You're Invited to the Joint Holiday Program for CUPA-HR NY Metro Chapter and  HERC Metro New York & Southern Connecticut  ? A Year in Review: A Regulatory HR Update ? ? ? Join us on Thursday, December 3, 2105 at  The Princeton Club   for the 2015 CUPA-HR NY Metro & Metro New York and Southern Connecticut HERC joint Holiday Program presented by  Michael J. Monahan , Assistant Managing Principal at Grant Thornton, LLP. With the ever evolving landscape of regulations, rulings and human capital initiatives, 2015 has included lots of topics for discussion amongst H.R. professionals and leaders! This session will look to provide attendees with a ?Year in Review? for such issues as the Affordable Care Act, NRLB Franchise Ruling Implications, the Expansion of Municipal Sick Pay Acts, Higher Education Compensation and Benefits Challenges, the implications for the upcoming election cycle and recent U.S. Supreme Court Rulings, along with IRS regulations following Obergfell or the DOL?s new FLSA standards and more? Covering a broad array of topics in a brief period of time, Mike will also provide some case studies and examples on how some organizations have begun to respond to a few of these issues and how they are planning for (or have planned for 2016 and beyond, as well)!! ? The annual Holiday Party will immediately follow (5:30 pm -7:30 pm).  Space is limited. Please register early to avoid disappointment. ? Please Note: This program has been pre-approved for 2.00 (HR (General)) Recertification Credit Hours towards PHR, SPHR and GPHR recertification through the HR Certification Institute. Please be sure to note the program ID number on your recertification application form. For more information about certification or recertification, please visit the  HR Certification Institute website . ? 2015-2016 CUPA-HR New York Metro Chapter Officers ? Donald Perretti ? President ?Kiley Kula ? Past President  ?Jazzmine Clarke-Glover ? President-Elect Tanya Woods?? Program Chair ?Michelle Keenan ? Past Program Chair Sheraine Gilliam ? Communications Chair Jody Pariante ? Treasurer  Carolyn Higgins ? Secretary??????  ?Robert Lazer ? National Board Liaison Tania Ronquillo - Ex- Officio Elias Zambrano - Ex Officio"
}