{
    "addr": "85 Broad St.. 16th Floor. New York, NY 10038", 
    "title": "Women in Tech Panel: Turning Feedback Into Insights", 
    "url": "https://www.eventbrite.com/e/women-in-tech-panel-turning-feedback-into-insights-tickets-19297296734?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-16T18:30:00-05:00", 
    "endtime": "2015-12-16T20:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Science & Tech"
    ], 
    "desc": "Moderator \n Jessica Bates  Senior Design Researcher, Motivate Design \n \n Panelists \n Val Pucilowski  UX Researcher, Etsy \n When she?s not conducting research on Etsy?s seller experience, she consults?with companies looking to improve upon their UX research and front-end design. Val also volunteers with the?Coalition for Queens - interviewing students for their Access Code program and lecturing on the merits of?conducting qualitative research to inform the product development lifecycle. \n Jennifer Bruno  Product Manager, Cond??Nast \n Jennifer is a Product Manager on Copilot, a proprietary CMS that powers a growing number of Cond? Nast's?brand websites. She most recently worked with Epicurious to replatform over 350k recipes and also launched?six brands on Apple News. \n Sylvia Lee  Product Designer, NASDAQ \n A native New Yorker, Sylvia is a product designer who is interested in the crossroads of design, technology,?and education. Passionate about education and community, Sylvia is an organizer and volunteers at NYC?UXPA and an associate board member at KAFSC. She works as a product designer at NASDAQ where she?designs kickass products and solve real world problems. \n \n \n \n \n WeWork is the platform for creators.? We provide the workspace, community, and services you need to make a life, not just a living.? To learn more about the WeWork locations in New York City, click ?here ?to book a tour or send an email to? joinus@wework.com . Make sure to let them know you were referred by? NYCDA ."
}