{
    "addr": "1515 Broadway New York, NY 10036", 
    "title": "EXCISION PRESENTS THE PARADOX 2016 TOUR - NYC SHOW 1", 
    "url": "http://www.eventbrite.com/e/excision-presents-the-paradox-2016-tour-nyc-show-1-tickets-19328065765?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-02-26T21:00:00-05:00", 
    "endtime": "2016-02-27T02:00:00-05:00", 
    "categories": [
        "EDM / Electronic", 
        "Concert or Performance"
    ], 
    "desc": "EXCLUSIVE FAN CLUB TOUR BUNDLES ? EXCISION PRESENTS THE PARADOX 2016 TOUR ? Excision, the Canadian dubstep demon known for face-splitting sounds and intense live shows has traveled the globe spreading the power of heavy bass music. Now, Excision is ready present his all new stage production - The Paradox - on a monster tour across all of North America. Featuring 150,000 watts of soul-crushing PK Sound and and a one of a kind video and lighting experience, The Paradox 2016 tour is one you cannot miss. Catch Excision, with special guests? Figure ?and? Bear Grillz ?in a city near you!* VENUE: PLAYSTATION THEATER AGE REQUIREMENT: 18+ HOURS: 9PM-2AM ? REFUND POLICY All Sales Are Final. If you purchase a bundle and cannot pick it up the day of the event we  cannot  ship it to you. Bundle purchasers must visit the Excision Merch Booth the day of the show in order to redeem their bundles.? ? SHIPPING GA TICKETS:? All GA tickets MUST BE PICKED UP THE DAY OF THE EVENT AT WILL CALL. ?You must bring a valid ID matching the name on your order to claim your tickets. XXX BUNDLES: ?You will be emailed by someone from the Excision staff to collect you and your guest's names and be added to our guest list. Once this step is complete, please proceed to wherever the venue is taking guest list admittance. You must bring your print at home XXX package ticket with you the day of the event and redeem your bundle at the Excision Merch Booth. If you have purchased a XXX bundle within 3 days of an upcoming event or have not been contacted by us within 5 business days, please email excisiontickets@gmail.com with your order information and issue. You must bring your print at home X or XX package ticket with you the day of the event and redeem your bundle at the Excision Merch Booth.? Please note that the X and XX bundles do not include admission to any events and you must purchase a separate ticket to enter the show. ? All bundle packages must be picked up at the Excision Merch Booth the day of the event. No bundles will be shipped prior to, or after the date of the show. Bundle items may vary depending on item availability. ? HAVING TROUBLE WITH YOUR TICKETS? GA TICKETS:? All GA tickets MUST BE PICKED UP THE DAY OF THE EVENT AT WILL CALL.? You must bring a valid ID matching the name on your order to claim your tickets. Some customers were incorrectly sent PDF tickets during the first few days of the fan-club on-sale. Please note that these? will not ?get you into the event. You must still bring a valid ID to will call the night of the event to pick up your tickets. If you need to change the name on your order or have any questions, please e-mail us at excisiontickets@gmail.com If you do not see your order confirmation in your inbox? CLICK HERE  to access the Eventbrite help center. IMPORTANT: Make sure to check your junk/spam folder. If you are having any other technical ticketing-related issues with your order? CLICK HERE  to contact Eventbrite. Need to view or update the information on your order?? CLICK HERE  for instructions."
}