{
    "addr": "55 West 13th Street, New York, NY 10011. Room I202. ", 
    "title": "Politics and Policy: The Latino Vote and The 2016 US Presidential Election", 
    "url": "http://www.eventbrite.com/e/politics-and-policy-the-latino-vote-and-the-2016-us-presidential-election-tickets-19320753895?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-07T19:00:00-05:00", 
    "endtime": "2015-12-07T21:00:00-05:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Seminar or Talk"
    ], 
    "desc": "No group is more crucial to the outcome of the 2016 presidential election than Latino?voters, and no group of voters is more in play than Latinos during this campaign season. ?A?surge in Latinos of voting age combined with Donald Trump?s polarizing comments about?Mexican immigrants have put Latinos at the center of the race for the White House. Every year an estimated 800-thousand Latino youths reach voting age and an almost equal?number of immigrants from Latin America become naturalized U.S. citizens.? That means by?next November the ranks of eligible Latino voters will have grown by 4 to 6-million since?the 2012 presidential election. This event, part of Milano?s Politics and Policy series, will offer a fresh examination of the?role of Latinos in the 2016 election.? Featuring a panel of journalists, pollsters, and political?insiders, we?ll explore political, demographic and economic trends that will shape the outcome in 2016. Join us on Monday, December 7th for a?conversation organized by  Feet in 2 Worlds ,  The Center for New York City Affairs at The New?School  and the  Milano School of International Affairs, Management, and Urban Policy . Moderator : Ray Suarez, Host,  Inside Story ,  Al Jazeera America  Panel will include:  Dr. Sylvia Manzano , Latino Decisions  Gonzalo Ferrer ,  Republican National Hispanic Assembly  Daniel Altschuler ,  Voter Power Project,  Make the Road New York   Samuel Molina ,  Mi Familia Vota California Sindy Benavides,  League of United Latin American Citizens (LULAC) Be part of the conversation with #politicsandpolicy and #voto2016!"
}