{
    "addr": "3041 Broadway. Social Hall. New York, NY 10027", 
    "title": "Francis Fukuyama and Robert Wright Consider: Where Is History Heading?", 
    "url": "https://www.eventbrite.com/e/francis-fukuyama-and-robert-wright-consider-where-is-history-heading-tickets-19530763038?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-08T18:00:00-05:00", 
    "endtime": "2015-12-08T20:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Spirituality"
    ], 
    "desc": "Where is humankind heading?? Toward the Shangri-la envisioned by techno-utopians? Toward something closer to the apocalypse? And does our knowledge of human history help answer such questions? Acclaimed political scientist Francis Fukuyama, author of  The End of History and the Last Man , and Robert Wright, author of  Nonzero: The Logic of Human Destiny , come together to consider the shape of things to come?and to ponder the question of whether the direction of history to date suggests that there may in some sense be a larger purpose unfolding on this planet through the workings of nature, including human nature. \n FRANCIS FUKUYAMA is Olivier Nomellini Senior Fellow at the Freeman Spogli Institute for International Studies (FSI), and the Director of FSI's Center on Democracy, Development, and the Rule of Law. Dr. Fukuyama has written widely on issues in development and international politics. His book,  The End of History and the Last Man,  earned international acclaim and has appeared in over twenty foreign editions. His most recent book,  Political Order and Political Decay: From the Industrial Revolution to the Globalization of Democracy , was published in September 2014. He was a member of the Political Science Department of the RAND Corporation, and of the Policy Planning Staff of the US Department of State. He previously taught at the Paul H. Nitze School of Advanced International Studies of Johns Hopkins University and at George Mason University's School of Public Policy. He served as a member of the President's Council on Bioethics from 2001-2004. He is also a member of the American Political Science Association, the Council on Foreign Relations, and the Pacific Council for International Affairs. ? \n ROBERT WRIGHT is the author, most recently, of  The Evolution of God , which was a New York Times bestseller and a finalist for the Pulitzer Prize. His other books include  The Moral Animal , which The New York Times Book Review named one of the ten best books of 1994, and  Nonzero , which Bill Clinton called ?astonishing? and instructed White House staff members to read. In 2009 Wright was named by Foreign Policy magazine as one of the top 100 global thinkers. Wright has written for The Atlantic, The New Yorker, The New York Times Magazine, Foreign Policy, and the op-ed pages of The New York Times, The Washington Post, and The Financial Times. His books have been translated into more than a dozen languages, and his awards include the National Magazine Award for Essay and Criticism. Wright is Visiting Professor of Science and Religion at Union Theological Seminary in New York, and is editor-in-chief of the websites Bloggingheads.tv and MeaningofLife.tv.? \n This event is part of ?Contentions,? an interview and debate series hosted by Robert Wright, Visiting Professor of Science and Religion at Union Theological Seminary. Through conversations with prominent intellectuals, ?Contentions? examines the relationship between science and spiritual questions."
}