{
    "addr": "340 W 50th St New York, NY 10019", 
    "title": "LandlordsNY LIVE! A Property Management Symposium for Owners and Managers", 
    "url": "http://www.eventbrite.com/e/landlordsny-live-a-property-management-symposium-for-owners-and-managers-tickets-17984146065?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T08:00:00-05:00", 
    "endtime": "2015-12-08T14:00:00-05:00", 
    "categories": [
        "Real Estate"
    ], 
    "desc": "In a unique twist of the usual real estate events and expos, the LandlordsNY Property Management Symposium was created to assist landlords and managers...period! This private event is only open to LandlordsNY Members. All the elements of the website live on stage including live forum/panel discussions with seasoned landlords and managers, Q & A with LandlordsNY Experts, practical, no-nonsense tips and advice that will immediately impact your daily operations and bottom line. ? This is the only conference designed solely for you. Clear your morning on December 8, 2015 and make plans to attend! Rub elbows with other pros! Some 300+ landlords and property managers will be on hand to swap advice, services and war stories about everything from saving money to using the latest technology. ?- ?Learn How to Evict Tenants Using Airbnb.  ? Short-term rentals have become a very hot-button issue for landlords in recent years. LandlordsNY Legal Expert Michelle Maratto Itkowitz will answer your questions on what to do when you discover tenants in your building using popular rental sites like Airbnb. All attendees will also receive a takeaway booklet with Q A plus helpful tips for a smooth eviction. ? - Leveraging Technology for Multifamily Management? In this interactive session, a varied cross section of landlords and property managers will shed light on how they have embraced technology to streamline and bring order to the property management process. Panelists will share their experiences with various property management software products, discussing the relative pros and cons of their solution, why that chose their particular path, and what features are still on their wish lists. Beyond these questions, the moderator plans to open things up to the audience for your participation, so please be prepared to share your experiences with the panel. -  Rent Laws 2015 and You, presented by Rent Stabilization Association ?- LandlordsNY Experts ? Educational, relevant and money saving tips from leading industry experts! Bring your legal, financial, violation or energy-related questions - along with any important paperwork you would like reviewed - to discuss with LandlordsNY Experts. ?-  Learn about real estate on the Internet With a special focus on social media and why you should care! ?-  Strictly kosher full hot breakfast, snacks, yogurt bar, delicious gourmet coffees and delicacies. FAQs What are my transport/parking options getting to the event? Public transportation is the easist option, conveniently located in midtown Manhattan all trains will get you there! The C,E,1, N, Q, and R trains are the closest to the venue with all other lines running to 42nd street Times Square.  There are 2 parking garages across the street on 50th.  Where can I contact the organizer with any questions? You may email info@landlordsny.com or call 718-704-0696 ext 102. I am not a LandlordsNY member, can I attend? If you own or manage property as a business in New York then YES, you can attend. LandlordsNY membership is free, sign up at www.landlordsNY.com or call/email us directly and we will get you registered - no problem! I am interested in sponsoring or exhibiting, how do I get information? Email sales@landlordsNY.com or call 718-704-0696 ext 102. Are there kosher options? Yes, LandlordsNY LIVE is a Glatt kosher event."
}