{
    "addr": "2 MetroTech Roadway Brooklyn, NY 11201", 
    "title": "The NYC Arcade", 
    "url": "http://www.eventbrite.com/e/the-nyc-arcade-tickets-17901872984?aff=ebrowse", 
    "location": "Brooklyn, NY", 
    "starttime": "2015-12-10T17:00:00-05:00", 
    "endtime": "2015-12-10T21:00:00-05:00", 
    "desc": "Join 700+ attendees for a FREE showcase of digital games, tabletop games, mobile apps, interactive installations, new media art, virtual reality, and more! Apply here to showcase your work -? The full lineup of projects will be listed here prior to the event. __________________________________________________ This is a safe and inclusive space where we respect people of all backgrounds. Please help us all be mindful of our speech and behavior. Harassment of any form is not tolerated, and in certain cases violators may be asked to leave the premises. If there's an issue, please let the event organizers know.  We welcome anonymous feedback via this form -  __________________________________________________ Our operations are 100% volunteer-driven. Join our team -  __________________________________________________ Join our mailing list:  Like our page on Facebook:  Follow us on Twitter:  Join our Meetup: ? __________________________________________________ Please be advised that photos will be taken at the event, and that we may use those photos for promotional purposes in the future. JUN 18, 2015 -    JAN 15, 2015 -    FEB 25, 2015 -    NOV 22, 2014 -    SEP 30, 2014 -    JUL 1, 2014 -  __________________________________________________   New York based media and entertainment lawyer specializing in copyright, trademark, and privacy law.    Independent game studio creating Pixel Noir - \"a modern RPG made to twist your urban mind.\"  ?   A creative community that provides artists & tech driven individuals a platform to learn, share, create & connect.  ? Nighthawk Interactive is about helping developers make the great games we all love to play. __________________________________________________ \"The NYU Game Center is dedicated to the exploration of games as a cultural form and game design as creative practice.\" ? __________________________________________________   ?The mission of The Sheep?s Meow is to support local developers, make game creation inclusive & accessible, and help people get started making their own games.?"
}