{
    "addr": "902 Broadway. 4th Floor. New York, NY 10010", 
    "title": "UX Designer & Product Manager Meet & Hire", 
    "url": "http://www.eventbrite.com/e/ux-designer-product-manager-meet-hire-tickets-19301938618?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-03T16:30:00-05:00", 
    "endtime": "2015-12-03T19:30:00-05:00", 
    "categories": [
        "Career", 
        "Meeting or Networking Event"
    ], 
    "desc": "At this event, you will have the opportunity to meet with the recent graduates of our full-time User Experience Design Immersive course and our full-time Product Management Immersive course. Come check out student work and talk to them about full-time, contract and paid internship opportunities. General Assembly  does not  collect a commission for hiring our graduates.? Food and refreshments will be provided! ? About Our Students Our gradutes are made up of a group of proactive, creative, collaborative, and motivated user experience designers and product managers ready to make a difference in their next position. While our graduates all display common sets of skills and competencies, they each bring their own backgrounds and interests to their work as UX designers and Product Managers. Our students come from fields as diverase as engineering, non-profit, law science, finance, education, and more. ? Format The event is structured as a reverse job fair. Graduates will be stationed at tables, showcasing their individual and team projects. Employers are free to engage each student at their discretion. All attendees will receive a GA grad profiles brochuse in advance to make their experience more targeted. ? Please only register for this ticket type if you are attending on behalf of a company that is looking to hire junior UX designers and product managers. Please do not register if you are a recruiter, looking to hire senior/executive level talent, or are a job seeker that has not graduated from a full-time General Assembly program."
}