{
    "addr": "New York, NY", 
    "title": "Outlanders United Tartan Week 2016", 
    "url": "http://www.eventbrite.com/e/outlanders-united-tartan-week-2016-tickets-17472352276?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-04-07T19:00:00-04:00", 
    "endtime": "2016-04-11T11:00:00-04:00", 
    "desc": "We are presently at capacity for parade marchers - if there is space on the waitlist you will see a \"JOIN WAITLIST\" option in blue that will allow you to add yourself to the waitlist should a spot become available. Any available spots are offered in order of sign up--if a spot is released, you will receive an offer via email and will have 24 hours to purchase before the link expires and the spot is offered to the next person on the waitlist. Spectator Spots we offer a PAID and FREE option. Those who select the paid option will receive an Outlanders United badge and lanyard, the same as the marchers. We ask that everyone sign up so that we can email information with you when there is new information to share.? There are many events scheduled during Tartan Week to celebrate Scottish culture and heritage, some of them require advanced ticket purchase. Last year events included a Ceilidh, the Kirkin' of the Tartan followed by a brunch, and a post parade \"After Party.\" These were not ticketed until the spring.?  These events are not ticketed by us--but will wil alert you when tickets are available. ?We know we will also have a number of Outlander fans traveling to NYC from outside the US--so we may schedule an activity of our own for the evening of Thursday, April 7th so that we have time for some shennanigans that will not conflict with other Tartan Week events. Please plan accordingly. We have negotiated a group rate on a room block at the Westin. ?The rate is guaranteed through February--more rooms will be add as needed between now and then. Space for Thursday, April 7th are limited, but they should have good availability for Saturday and Sunday nights.? Remember--we march as one group--Outlanders United--not as individual groups. ?There WILL be a dress code required for marchers, as there was in 2015. There is no dress code for parade viewers. We will update this space as new information becomes available. Again, please note that there are events that will NOT be ticketed here as they are not hosted by us. ?We will keep each of you posted when we have news about tickets sales for those events. If you have questions, please post them in our Facebook Group ?https://www.facebook.com/groups/outlandersunited/ as chances are good that other people have the same question. This year we have a nominal registration fee to defray the cost of incidentals associated with our participation, such as badges and lanyards, printing, banner purchases, shipping, and hotel storage & handling costs, payment of pipers/travel/expenses. Any left over will be used to put a deposit on a space for the Thursday evening event.? All tickets are non-refundable and strictly non-transferable."
}