{
    "addr": "221 East 71st Street New York, NY 10021", 
    "title": "Countering ISIS and Islamic Extremism: Implications for a New Regional Order - Ambassador Dennis Ross", 
    "url": "http://www.eventbrite.com/e/countering-isis-and-islamic-extremism-implications-for-a-new-regional-order-ambassador-dennis-ross-tickets-19610062224?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T18:00:00-05:00", 
    "endtime": "2015-12-10T20:00:00-05:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "About the Speaker Ambassador Dennis Ross is counselor and William Davidson Distinguished Fellow at The Washington Institute for Near East Policy. Prior to returning to the Institute in 2011, he served two years as special assistant to President Obama and National Security Council senior director for the Central Region, and a year as special advisor to Secretary of State Hillary Rodham Clinton. For more than twelve years, Ambassador Ross played a leading role in shaping U.S. involvement in the Middle East peace process and dealing directly with the parties in negotiations. A highly skilled diplomat, Ambassador Ross was U.S. point man on the peace process in both the George H. W. Bush and Bill Clinton administrations. He was instrumental in assisting Israelis and Palestinians to reach the 1995 Interim Agreement; he also successfully brokered the 1997 Hebron Accord, facilitated the 1994 Israel-Jordan peace treaty, and intensively worked to bring Israel and Syria together. About the Moderator Prof. Amirahmadi is director of the Center for Middle Eastern Studies and a professor at the Edward J. Bloustein School of Planning and Public Policy. Amirahmadi is the founder and president of the American-Iranian Council, a research and policy think tank devoted to improving understanding between the peoples of Iran and the United States. He is the author of Revolution and Economic Transition: The Iranian Experience and editor of 10 other books. His latest book is The Political Economy of Iran. National and international print and broadcast media outlets frequently interview him, including CNN and the New York Times. Amirahmadi has served as consultant to the United Nations, the Aga Khan Foundation, the World Bank and several governments, as well as private companies. He has presented at conferences around the world. Photos featured in the event promotion: Left: via? Mashable , Eduardo Lima ? Right:  Aljazeera America ,? Mohammed Jalil/EPA"
}