{
    "addr": "2 Washington Street 21st floor New York, NY 10004", 
    "title": "\"Grace Prescriptions\" NYC Workshop by Walt Larimore and Bill Peel / CME Credits", 
    "url": "http://www.eventbrite.com/e/grace-prescriptions-nyc-workshop-by-walt-larimore-and-bill-peel-cme-credits-tickets-18862579483?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-04T14:00:00-05:00", 
    "endtime": "2015-12-05T16:00:00-05:00", 
    "categories": [
        "Other", 
        "Conference"
    ], 
    "desc": "Organized by  Beacon Christian Community Health ?Center. Sponsored by?Nyack College, CMDA-NYC, CMDA-Mid Hudson Valley, Center for Faith & Work (Redeemer Presbyterian Church), Christian Community Health Fellowship How often do you prescribe grace to your patients? Not just kindness, which is important, but also specific and appropriate doses of grace that may bring your patients a step closer to a right relationship with God? Many of us in healthcare struggle with guilt and inadequacy in this area. But there is hope. Join us for the live seminars of? Grace Prescriptions? designed to teach you to share your faith with patients in ways that safeguard the important ethical principles of respect, sensitivity and permission. Originally taught in CMDA?s popular? Saline Solution? course, these concepts are proven to be effective as thousands of lives have been transformed.? Grace Prescriptions? builds on this legacy. Taught by co-authors Walt Larimore, MD, and William C. Peel, ThM, we encourage you to come learn how God can use you to dispense? Grace Prescriptions. Great news! We have been approved to offer 6.75 hours of CME credits for? Grace Prescriptions ?attendees! There will be a $70 processing fee for the request. More details will be available at the conference. ? Click to view a video excerpt from Grace Prescriptions : Immediately after the workshop, you are invited to dinner for fellowship, and to hear Dr. David Kim, CEO of Beacon CCHC, speak about Christ-centered Urban healthcare.? Brief?Schedule  (Detailed Schedule  Here ) Day 1 Friday  2:00 p.m. - Check-in  3:00 p.m. - Conference ????Are Spiritual Interventions Appropriate? ??? Biblical Case for Spiritual Care 4:40 - 4:55?- Break ??? Clinical Case for Spiritual Interventions ????Understanding Barriers 6:10 - 6:55 p.m. - Dinner ????The Importance of?a Spiritual History ??? Earning the Right to be Heard 9:00 p.m. - Conclusion Day 2 Saturday  8:30 a.m. - Breakfast  9:00 a.m. - Conference ????Faith Flags, Stories, & Prescriptions 10:15 - 10:30 -?Break ??? Personal Faith Story ??? Reality of Time & Spiritual Care Team 12:00 - 12:45 p.m. - Lunch on your own ????Sharing the Good News ??? Biblical Case for Prayer 2:15 - 2:30 - Break ??? Clinical Case for Prayer ??? Seminar Summary & Challenge 4:00 p.m. - Adjourn 5:00 - 7:30 p.m. - Dinner and Presentation (Doors open at 5, dinner served at 5:30) ***Limited childcare will be available for children ages 3+. Children must be potty-trained. Please indicate how many children will need childcare on registration page.? ? ***HOTEL ROOM BLOCK NOW AVAILABLE!***   ? We have reserved a block of hotel rooms at the Doubletree Hotel, located at 8 Stone Street, New York, NY 10004 (this is a 4 minute walk to Nyack College) ? Rate is $269/night + tax for King and $299/night + tax for 2 doubles.? ? Rate includes free Wi-Fi; 24 hour fitness center; and option available for breakfast at $12/person (including tax) for full American buffet.? Parking: $40/night for self parking; $55/night for valet. Rate available for nights between December 3 - 6, 2015. ? Click on this link to access the hotel registration: ? ? http:// doubletree .hilton.com/en/dt/groups/personalized/N/NYCBPDT-BCC-20151203/index.jhtml?WT.mc_id=POG or you may call the hotel at 212-480-9100 and use Group Code: BCC Rate available until November 6, 2015 or until room block is sold out."
}