{
    "addr": "1535 Broadway New York, NY 10036", 
    "title": "Inman Connect New York 2016", 
    "url": "http://www.eventbrite.com/e/inman-connect-new-york-2016-tickets-15396289717?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-01-26T09:00:00-05:00", 
    "endtime": "2016-01-29T12:00:00-05:00", 
    "categories": [
        "Real Estate", 
        "Conference"
    ], 
    "desc": "Produced by Inman ?, Inman Connect? is the premier real estate technology event for everyone who cares about the real estate industry and where it is going. Each year, thousands of influential real estate leaders gather at Inman Connect to network, make deals, explore current trends and technology, and to learn how to embrace and leverage the change that surrounds our industry. Inman Connect celebrates its 20th year in 2016, with conferences in New York City, January 26-29 and San Francisco August 2-5. ? Cancellation Policy For? Inman Connect ?events, cancellations must be received in writing 30 days prior to the event. Please send all correspondence to? customerservice@inman.com . Refunds will not be granted (including no-shows), but registrations may be transferred to a future Inman Connect event within one year of the original event date for a $75.00 administrative fee due at time of transfer . All cancellation requests will be processed within two business days. Transfer Policy You may transfer your conference registration to another individual by notifying us in writing at? customerservice@inman.com . Attendee substitutions will not be allowed on or after the start of the event date. All substitution requests will be processed within two business days. Force Majeure If events beyond the reasonable control of the parties, including, but not limited to, acts of God, war in the United States, strikes, terrorist attacks in the city where the event is being held, or curtailment of transportation either in the event city or in the countries/states of origin of the attendees, which prevents at least 40% of the attendees from arriving for the event, so that it is impracticable, illegal, or impossible to hold the conference, Inman News may cancel the event and offer attendees a credit for Inman News products (including a future conference) in the amount of the paid registration fee. On-site Policies: On-site policies are specific to the rules and regulations of the Third Party hosting venue. Distribution of Collateral Distribution of collateral (i.e. flyers, pamphlets or other materials of any type) will not be permitted without the consent of Inman. Solicitation Soliciting at Inman by non-exhibiting companies or individuals is strictly prohibited. Individuals in violation of this policy shall be subject to permanent and immediate removal from the area and surrender their badges, without right to reimbursement of any fees. Camera Policy Failure to comply with event Camera Policy may result in the film being confiscated. Video Recorders or Digital Camera Recording Co-Sponsor understands and agrees that Inman may make recordings of all or a portion of the event(s) and that Inman shall own the copyright in all such recordings. Co-Sponsor, on its own behalf and on behalf of its employees, grants Inman the non-exclusive, royalty-free, perpetual, worldwide right and license to use the name, likeness, voice, trademarks and logos of Co-Sponsor and its employees in any and all media now known or hereafter developed in connection with the recordings. Photo Release I hereby give permission to Inman to use my photo in all marketing and promotional materials used to promote any Inman News event. Privacy Policy This policy discloses what information we gather about you when you visit any of our Web sites or buy product directly from us. It describes how we use that information and how you can control it. Our privacy policy addresses:"
}