{
    "addr": "365 5th Avenue. Elebash Hall. New York, NY 10016", 
    "title": "Richard Fung: 2015 Kessler Award Lecture & Reception", 
    "url": "http://www.eventbrite.com/e/richard-fung-2015-kessler-award-lecture-reception-tickets-18563870035?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-16T18:30:00-05:00", 
    "endtime": "2015-12-16T21:30:00-05:00", 
    "categories": [
        "LGBT", 
        "Seminar or Talk"
    ], 
    "desc": "RICHARD FUNG: 2015 KESSLER AWARD LECTURE & RECEPTION Reorientations: Shifts and continuities in Asian Canadian? queer and trans identities and activism Richard Fung is this year?s Kessler Award recipient. He is a Toronto-based video artist, writer, theorist, and educator?a public intellectual who has pushed forward the debates about queer sexuality, Asian identity and the uneasy borderlands of culture and politics. The Kessler Award is given to a scholar who has, over a number of years, produced a substantive body of work that has had a significant influence on the field of LGBTQ Studies. The awardee, who is chosen by the CLAGS Board of Directors, receives a monetary award and gives CLAGS' annual Kessler Lecture. ? Richard Fung's 2015 Kessler lecture is titled Re:Orientations. In 1984, Fung made his first documentary,  Orientations: Lesbian and Gay Asians . He is currently in postproduction on a long-form film that reengages with seven of the 15 original participants three decades later. In this talk, clips from the documentary-in-progress will anchor reflections on transformations, unresolved questions and new urgencies for queer and trans identities and politics from the perspective of pan-Asian Canadian subjects.? Richard Fung  is a Trinidad-born, Toronto-based video artist, cultural critic and educator. His work comprises of a series of videos on subjects ranging from the role of the Asian male in gay pornography to colonialism in Canada and the Caribbean, immigration and refugee issues, social justice in Israel/Palestine, anti-black racism in policing, homophobia, AIDS and his own family history. His tapes and projections, which include  Chinese Characters ( 1986),  My Mother?s Place  (1990),  Sea in the Blood  (2000),  Jehad in Motion  (2007) and  Dal Puri Diaspora  (2012) , have been widely exhibited and collected internationally, and have been broadcast in Canada, the United States and Trinidad and Tobago. His essays, which include \"Looking for My Penis: The Eroticized Asian in Gay Video Porn,\" have been published in many journals and anthologies, and he is the co-author with Monika Kin Gagnon of  13: Conversations on Art and Cultural Race Politics  (2002). Richard is a  fellow at the Mark S. Bonham Centre for Sexual Diversity Studies at the University of Toronto,  a past Rockefeller Fellow at the Center for Media, Culture and History at New York University, and has received the Bell Canada Award for outstanding achievement in video art. He is a Professor in the Faculty of Art at OCAD University, teaching courses in Integrated Media and Art and Social Change.? All CLAGS events are free and open to the public, space permitting. An RSVP does not guarantee space to sold out events."
}