{
    "addr": "2 East 91st Street New York, NY 10128", 
    "title": "DesignPrep | Portfolio Prep", 
    "url": "http://www.eventbrite.com/e/designprep-portfolio-prep-tickets-18193831239?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-09-21T16:00:00-04:00", 
    "endtime": "2015-11-30T18:00:00-05:00", 
    "categories": [
        "Children \\u0026 Youth ", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Working on a portfolio for art and design school? Interested in studying design but don?t know where to start? Learn about the requirements and application guidelines and get advice and feedback on your portfolio from professional designers, college representatives, and current design students. DesignPrep is diving into the college application process with this 10-session workshop series that focuses on compiling, editing, and documenting your portfolio. In addition, workshops cover a variety of topics including: requesting recommendations, choosing a school, writing a personal statement, and more. You are welcome to attend all 10 sessions, or join for specific topics of interest. Use digital badges to track your progress as you compile your portfolio, receive feedback, and complete your college applications. Programs are FREE and open to all New York City high school students.  Priority registration is given to students in grade 12. Day: Mondays, September 21 ? November 30 Time: 4pm ? 6pm Location: Cooper Hewitt, Smithsonian Design Museum 2 East 91st Street ? ? Cooper Hewitt?s DesignPrep is a series of FREE teen workshops, studio tours and college visits, which focus on all forms of design from fashion and architecture to product and graphic design. As part of the Cooper Hewitt, Smithsonian Design Museum, our programs promote design thinking and offer students from all backgrounds an opportunity to experience what it is like to work as a designer while developing college and career skills. Learn more at  CooperHewitt.org DesignPrep is made possible in part by the generous sponsorship of    Additional support is provided by the Altman Foundation, internal Smithsonian Institution funds from the Youth Access Grants program, Deutsche Bank, The New York Community Trust and its Hive Digital Media Learning Fund, the Richard and Jean Coyne Family Foundation, the School of Visual Arts, Warby Parker, and the Milton & Sally Avery Arts Foundation."
}