{
    "addr": "50 East 7th Street New York, NY 10003", 
    "title": "REVOLUTIONARY LOVE: Tools, Tactics, and Truth-Telling for Dismantling Racism", 
    "url": "http://www.eventbrite.com/e/revolutionary-love-tools-tactics-and-truth-telling-for-dismantling-racism-tickets-18044984033?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-04-15T12:00:00-04:00", 
    "endtime": "2016-04-17T20:00:00-04:00", 
    "desc": "Our nation is in a crisis. Though there is only one race ? the human race ? racism is a construct with lethal consequences. People die while in its custody. Racism has annihilated the souls of citizens and ripped out the heart of our nation. Recent surveys show that 60% of the people in our nation think race relations are in a significant decline, that our dream for justice and equality is dying on the vine. At the 10th annual Leading Edge Conference and the 6th annual Transform Network Gathering, we will learn and teach each other the best practical wisdom for movement-making, mingled with theoretical underpinnings and theological reflection. In plenaries, short talks, and small group conversations surrounded by music and art, we will create strategies for change. Activists, analysts, preachers, poets, prophets, teachers, trainers, writers, queer, and straight folk of all faiths ready to make a change: Come and bring your hopes, disappointments, and dreams. We must disrupt the narrative of white supremacy if we are to be free. We need tools, tactics, and truth-telling to dismantle racism.? Ours is  #PropheticGrief . Even in our anger and tears, we are ready to do something, to organize. This is a multi-faith, multi-racial movement. Those of us who are disgusted with the status quo are called to join the movement if we are to save our nation, save our world, and save our souls. Powered by the Middle Project, The Unitarian Universalist Association, Transform Network, and Auburn Seminary. If you are a student or an under-resourced activist, please pay the reduced rate. And if you have the resources, pay it forward for someone else. Let's get everyone to the table.   #RevolutionaryLove"
}