{
    "addr": "25 Ave A New York, NY 10009", 
    "title": "Elvis Perkins and Kinsey at Berlin", 
    "url": "https://www.eventbrite.com/e/elvis-perkins-and-kinsey-at-berlin-tickets-18893293349?aff=ebrowse", 
    "location": "", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "New York, NY Events", 
        "Performance", 
        "Music"
    ], 
    "desc": "Elvis Perkins is a critically acclaimed singer-songwriter who released his much lauded debut album,  Ash Wednesday , in 2007. The highly anticipated follow up,  Elvis Perkins in Dearland , came out in 2009. Perkins? third studio album and first full-length release in six years,  I AUBADE  was recorded largely on his own between 2012 and 2013 in a variety of locations, including his home in Hudson, NY, hotel rooms across America, friends? places in Dallas and Los Angeles, even a stationary mobile home called the ?Wilderness? of California.? Though clearly crafted as a defiantly autonomous work,  I AUBADE  does see Perkins joined in part by a number of friends, including drummer Otto Hauser (Vashti Bunyan, Sharon Van Etten), multi-instrumentalists Nick Kinsey and Wyndham Boylan-Garnett (both members of Perkins? celebrated combo, Elvis Perkins In Dearland), folk multi-instrumentalist Frank Fairfield, singer Cornelia Livingston, and long time collaborator Becky Stark (Lavender Diamond).  \n ? \n Released earlier this year via his own MIR Records ? manufactured and distributed by INgrooves Music Group ?  I AUBADE  was preceded by the first single, ?Hogus Pogus,? which immediately earned a full on rave review from  Entertainment Weekly . The track ?recalls the whimsically psychedelic sensation of oddball folk-pop auteurs like Kevin Ayers,? declared  EW.com , ?with a giddily off-kilter singsong melody and lyrics about a man who has a very literal change of heart and?becomes what Perkins describes as a ?better man? after receiving a?transplanted ticker from a pig.? In addition, ?Hogus Pogus? came accompanied by a strikingly surrealistic companion video, shot in 16mm black & white and color by director Ashley Connor (Angel Olsen, Jenny Lewis, Jenny Hval) and starring the aforementioned Arnaud Cornillon, himself the recipient of a successful bovine heart transplant. ?Hogus Pogus? is streaming now at  ElvisPerkinsVEVO . \n ? \n I AUBADE  has since accrued critical approbation from around the world, with the UK?s  The Observer  awarding the album four-out-of-five stars, praising it as ?spare and intimate, its imperfections and unusual instruments (sitar, xylophone) ensuring that Perkins sounds like no one else alive.?  ABC News  also awarded four stars, exalting Perkins as ?a master of these affecting ballads that recall the lullabies of yesteryear,? further lauding  I AUBADE  as ?a really strange, oddly beautiful, sonically imaginative collection?a calmingly psychedelic set of tracks which feels gently handcrafted with care.?  Paste  declared  I AUBADE  to be ?an album of relaxed arrangements for serenades best performed in the dawn? a welcome entry to (Perkins?) untraditional career.? ?Woozy and unhurried,? wrote  Drowned In Sound , ?( I AUBADE ) is packed with detail and unexpected moments?Perkins seems entirely at ease in these interstitial, twilit soundscapes ? perhaps more-so than ever before.?  MOJO  declared it ?astonishing how, despite (Perkins?) 32 instrumental credits and 20 guests,  (I AUBADE ) still sounds dustbowl-empty, as if these were missives from The Great Depression, time-wise and spiritually,? further extolling the album?s ?magnificently worn folk-country hues? and ?(Perkins?) gaunt Hank Williams-like voice.?  \n ? \n For more, please see  www.elvisperkinssound.net  and  www.facebook.com/ElvisPerkinsMusic ."
}