{
    "addr": "131 W 55th St New York, NY 10019", 
    "title": "Black Ivy Alumni League Alvin Ailey Tickets & Private Reception", 
    "url": "http://www.eventbrite.com/e/black-ivy-alumni-league-alvin-ailey-tickets-private-reception-tickets-7488330799?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-12T18:00:00-05:00", 
    "endtime": "2015-12-12T23:00:00-05:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Concert or Performance"
    ], 
    "desc": "You may have missed last year's performance but you won't want to do that this year. An amazing show, new dance pieces, and our own private pre-performance reception at New York City Center's special VIP Lounge with substantial hors d'oeuvres, an open wine bar and of course holiday spirit brought to you by YBAA, CBAA, ABPA CBS4A and BIAL! Purchase your tickets today. THIS EVENT ALWAYS SELLS OUT. The fantastic wine, hors d'oeuvres and networking reception is included in the ticket price and seats are limited! Tickets are: Center Orchestra   preferred seats, center, front of theater Center Mezzanine excellent seats center front mezzanine Orchestra far sides discounted seats at the sides of the theater (replaces orchestra pit seats) Wine & Hors d'Oeuvres Reception Only Join us before the show! These are great if you don't want show tickets or if you've already purchased your show tickets directly from City Center. The NY City Center Main Stage seating chart **Please note that due to the limited nature of the tickets, purchases are non-refundable.** This event ALWAYS sells out!   Get your tickets today for the best seats and to ensure you get to join us for this amazing show and our private reception. MAISHA WALKER   The Black Ivy Alumni League Princeton Alumna C'ARDISS GARDNER GLESER   Yale Black Alumni Association JOY WILLIAMS   Columbia Business School 4A ANDREA HENDERSON   Columbia Business School 4A JOSEPH L. ROBINSON II   Association of Black Princeton Alumni IFEOMA EBO   Cornell Black Alumni Association MICHELLE ALISE BROWN-GRANT   Cornell Black Alumni Association"
}