{
    "addr": "140 West 30th Street New York, NY 10001", 
    "title": "Fair Tuesday Holiday Pop Up @ Interface NYC", 
    "url": "https://www.eventbrite.com/e/fair-tuesday-holiday-pop-up-interface-nyc-tickets-19618192542?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-01T18:00:00-05:00", 
    "endtime": "2015-12-01T21:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Party", 
        "Community"
    ], 
    "desc": "#FairTuesday is an ethical shopping initiative. Buy one ethical item to change lives in a whole community!? \n Join us at the Fair Tuesday Holiday Pop Up at Interface NYC to start the holiday season! \n Where : INTERFACE NYC??? 140 W 30th St \n When : 6 pm to 9.30 pm \n Fair Trade Tables? \n Handcrafting Justice \n A.Bernadette \n Wine For the World \n The Flying Shuttle Shop by Amber Harkonen \n Friends of Fresh and Green Academy \n Wishwas  \n Ecolustre \n NYR Organic consultant Erin Galvin \n Kopali Organics Chocolate \n And many other Fair Trade brands... \n **Wine tasting will be by Stellar Organics and Wine for the World. \n Please show your support by posting a photo of yourself and teling us how you support #Fairtuesday. Please tag #fairtuesday and #nycfairtrade in your photos. \n FAIR TUESDAY? is an ethical shopping?movement?created in response to Black Friday and Cyber Monday. The goal of #FairTuesday is to inspire conscious consumerism and show how an everyday purchase can change lives in a whole community.?#FairTuesday features?fair trade, ethical, and eco-friendly brands all dedicated to creating positive, sustainable change .? www.fairtuesday.org \n NYC FAIR TRADE COALITION ? is an all volunteer grassroots organization educating consumers on the value and importance of fair trade and promoting fair trade businesses in NYC.? http://nycfairtradecoalition.org \n FAQs \n ? The name on the registration/ticket doesn't match the attendee. Is that okay? \n Yes. Everybody is welcome to attend the event. We only ask for RSVPs so we can have enough space to accommodate you. We also need to be ready with our fair trade chocolate supply! \n How can I support #FairTuesday? \n If you are coming to our event, that is great! If, by any chance, you miss our event, please check out the www.fairtuesday.com website for Fair Tuesday shopping. ? \n We are also asking for photos supporting #FairTuesday. ?Please tag your photos #fairtuesday and #nycfairtrade."
}