{
    "addr": "1015 Folsom St San Francisco, CA 94103", 
    "title": "UZ + G JONES + PLASTICIAN / APPRECIATION at 1015 FOLSOM", 
    "url": "http://www.eventbrite.com/e/uz-g-jones-plastician-appreciation-at-1015-folsom-tickets-19126187943?aff=ebrowse", 
    "location": "San Francisco, CA", 
    "starttime": "2015-11-20T22:00:00-08:00", 
    "endtime": "2015-11-21T03:30:00-08:00", 
    "desc": "The mysterious UZ surfaced in 2012 with his amazing Trap Shit series. Immediately gaining attention and praise from tastemakers and top record labels, he dropped records on OWSLA, Mad Decent, Jeffrees, BNR, Mau5trap, and SMOG, all within months of his first releases. Though the details of his personal identity are unknown, his productions and style have a life of their own. His sounds are minimal, yet powerful, with a menacing intensity, maturity, and restraint. A consummate performer, the last 3 years has seen UZ perform on 6 continents and play such notable festivals as EDC, Hard, Sonar, and Stereosonic. He is more than a sound, or a mask, and can only be described as one thing: ?Z Santa Cruz producer G Jones has captivated audiences all across North America and Europe with his playful and expansive take on broken beat dance music. His live show weaves an ever expanding stockpile of heavy knocking hip hop beats, cross- genre sound experiments, and expansive melodic riffs in a way that illuminates and drives the dance floor. With his irreverent attitude toward unimaginative EDM, this young producer pushes the envelope and blurs the lines between musical styles while maintaining a meticulous balance of minimal space and heavy bass.   G Jones blew the roof off of the end of last year with a huge official remix of Bassnectar - Don?t Hate the 808, and the release of his own highly anticipated collaboration EP Diamonds alongside legendary unground producer The Widdler. These remarkable collaborations all came on the heels of G Jones? own two enormous and critically acclaimed EPs:Ring the Alarm (available on Saturate Records) and Eyes EP(available on Robox Neotech). Each of these offerings have earned a comfortable home in dj sets in the past year. His instantly recognizable, audacious energy enhancers represent a fresh brand of premium West Coast bass music that has been embraced by a remarkable variety of ecstatic audiences and dance floor enthusiasts in a range of venues from clubs to arenas extending well beyond the areas of Northern California from where they originated in just the short time since G Jones began releasing his creations just a short time ago.   His live performances and recorded offerings weave a collection of trans-genre experimentation with an brand of infectiously rhythmic and monstrous sub bass in a way that dominates on the dance floor while simultaneously managing to capture the approving head-nods of even the most discerning musical aficionados. His playfully energetic style is instantly recognizable through his signature combination of musically conscious spacial experimentation that is always effortlessly juxtaposed with formidable doses of party throbbing bass, pulverized vocals, and some unpredictable element that morphs and explodes into an irresistible party anthem that leaves listeners with their finger poised over the repeat button as soon as the sound stops. G Jones continues to garner the attention and support of some of the most highly acclaimed producers active today; with his beats appearing on mixes from Pretty Lights, Zeds Dead and DJ Shadow on BBC?s ?Diplo and Friends? program, to Bassnectar and beyond. This support has quickly translated into ongoing and developing collaboration projects that fans will surely be clamoring to experience in the coming year. Plastician is a genuine one-off. An innovator in both dubstep & grime, he was one of the first producers to bridge the two genres: & he was one of the original group of Croydon producers ? alongside Skream & Benga. He?s had a show on Rinse since early 2003, having been invited to join after his tracks started making an impact on both grime & dark garage dancefloors. ?At the time no-one knew what to call what I was making, a kind of a grime sound for the dubstep audience. I was playing the Croydon stuff, mixed into this new take on stripped-back grime, which you still hear today with people like Joker.? On his Rinse show you?re likely to hear anything from grime ? ?there?s been a resurgence, right now I?m probably playing as much grime as I used to play back in 2005? ? to dubstep, & similar sub-driven mutations such as trap. ?For me the trap thing is a lot closer to what I was into in the early days,? he explains. ?It?s kind of a hybrid of rap & electronica, a bit like grime was, or like what we were doing back in the days when garage was turning into the dark stuff.? There are many things in life to stop and appreciate. On   we gather to appreciate people and music with a night of unmatched feels. Don?t miss this special celebration showcasing music at the forefront of creativity. Help create this ?one to remember?, as these audio heavyweights push the parameters of today?s sounds. We will be completely transforming the space and bringing tons of vibes to create a unique experience for the evening. FEATURES-  Enhanced visual atmosphere / Transformed space / Live Ariel & Stage performances / Additional Lighting & operation / Live visuals & projection mapping / Thick vibes / Complete night of perfect music / 3 separate areas of sounds / Enchanted Bass area / Positive Welcoming Atmosphere / Live Painting / Stunning Original Vendors / More!+++"
}