{
    "addr": "732 8th Avenue New York, NY 10036", 
    "title": "NAAAP-NY Open House Event", 
    "url": "http://www.eventbrite.com/e/naaap-ny-open-house-event-tickets-19691612142?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-03T18:30:00-05:00", 
    "endtime": "2015-12-03T20:30:00-05:00", 
    "categories": [
        "Non Profit \\u0026 NGOs", 
        "Meeting or Networking Event"
    ], 
    "desc": "Thinking about getting involved in the Asian community, and want to know where to start?  Looking for networking opportunities with like-minded professionals in the New York area?  Want to participate in meaningful causes such as a Scholarship program to help others?  How about gaining professional & volunteer experience to add value to your resume and personal development? ? The National Association of Asian American Professionals (NAAAP) is a non-profit organization that cultivates and empowers Asian & Pacific Islander leaders through professional development, community service, and networking. As the largest and fastest growing API professionals association, NAAAP continues to provide its members with the tools and resources to further career advancements and to empower Asians and Pacific Islanders to become great leaders as well as valuable employees. ? Come and find out what NAAAP NY can do for you! We are seeking 2016 leadership team members who are ready to step up for the challenge. The open positions are: ? In addition, you will learn about the membership benefits and get to meet our board members. Do not miss out on this fantastic opportunity to be a part of the fastest growing Asian American Association! ? Date: Thursday, December 3 Time: 6:30PM Location: Playwright Celtic Pub and Restaurant, 732 8th Ave New York NY 10036 ? Program: 6:30PM-7:15PM Registration & Networking Light fare will be provided, first 50 attendees will receive one drink ticket 7:15PM-7:45PM Message from the Board of Directors 7:45PM onward ? Networking continued ? This event is free and open to everyone, so be sure to invite your friends and colleagues! RSVP is required by Wednesday, December 2."
}