{
    "addr": "1201 South Figueroa Street Los Angeles, CA 90015", 
    "title": "LA Cookie Con and Sweets Show 2016", 
    "url": "http://www.eventbrite.com/e/la-cookie-con-and-sweets-show-2016-tickets-18540251391?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "", 
    "endtime": "", 
    "desc": "We were blown away by the amazing response to our 2015 show! In 2016, we're delivering even more exhibitors, more demos and hands-on classes with full audiovisual support, more sugar art to marvel at, and much more shopping for bakers, decorators and foodies. We also have 3x the space, a 2-day schedule, and early entry for VIPs, professionals, and press.? What isn't changing: our incredible lineup of celebrity guests, endless extravaganza of delicious free samples and family-friendly atmosphere! You don't want to miss LA Cookie Con and Sweets Show. Our list of retailers grows sweeter every day. Come check out the best in ingredients, tools and decor from sponsors Amoretti, Kake Kreations, BakersBodega, Heilala Vanilla, Divine Specialties, Americana Ingredients and exhibitors from all over the world including Simi Cakes & Confections, All Your Baking Kneads, Fiesta Cake Supplies, Caljava, FondX Rolled Fondant and more. Professional baker or creator? Our sponsors Formosa Flexible Packaging America, Americana Ingredients, Paasche Airbrush Company and Divine Specialties are on hand to help you grow your business, too!? Yes, you may transfer your paid ticket to someone else after purchase. Complimentary tickets given to celebrity guests, contest winners, etc. are non-transferrable.? Yes ? please use this link for instructions:   ?There is also a 'Contact Us' button at the bottom if you need help!? We're only checking IDs for complimentary passes given to press and special guests, so if you buy multiple tickets you can leave your name on each one if you're not sure who you're bringing. However, each ticket can be scanned at registration only once, so make sure you only share the ticket with its rightful owner.? SATURDAY, FEBRUARY 6 ? VIP/Pro/Press 10 am - 5 pm, General Admission 11 am - 5 pm SUNDAY, FEBRUARY 7 - VIP/Pro/Press 10 am - 4 pm, General Admission 11 am - 4 pm After our VIP Weekend Passes sell out, we may release 1-day VIP Passes ? but the price will be the same, so the Weekend Passes currently available are the best deal."
}