{
    "addr": "28 West 24th Street New York, NY 10010", 
    "title": "Captivate New York City: 3rd Edition", 
    "url": "http://www.eventbrite.com/e/captivate-new-york-city-3rd-edition-tickets-18854603627?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-15T18:00:00-05:00", 
    "endtime": "2015-12-15T21:00:00-05:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Meeting or Networking Event"
    ], 
    "desc": "The German Accelerator New York (GANY) would like to invite you to the third edition of our pitching and networking event on the East Coast,? Captivate . ? ?? Captivate? features German startups that have recently completed and graduated from the German Accelerator?s three-month acceleration and immersion program. The focus of the evening will be on the delivery of venture pitches in front of a panel of distinguished prestigious judges who offer immediate feedback. Additionally, audience members will be able to vote, in real time, in order to select the winner of the evening's Pitch Award.?Attendees are provided ample opportunities to expand their professional network through breakout discussions while engaging first-hand with Germany's thriving startup environment.? Pitching? Companies: ? favendo ?helps brick-and-mortar retailers increase sales through a powerful system providing indoor location-based services to shoppers and in-depth analytics for retailers.? ? Nightadvisor ?empowers venue managers? to intelligently create and manage automated ad campaigns with just one simple log in.? Being both, a B2B tool for venue managers and a location-based B2C nightlife platform for users, Nightadvisor's customers benefit from extensive data that strongly increase their marketing efficiency and gives them a deeper understanding of their target audience. ? ? ? Who should attend: ? Agenda : 6:00 pm - 6:30 pm: ?? Registration ? & ? Networking 6:30 pm - 6:45 pm: ? ? GA ? Introduction / Welcoming 6:45 pm - 8:10 pm : ? ?  Company ? Pitches 8:10 pm - 8:15 pm : ? ?? Audience ? Voting 8:15 pm - 8:35 pm: ? ? Q&A with Companies 8:35 pm - 9:00 pm: ? ?? Winner Announcement and Networking ? The German Accelerator graciously thanks its strategic partners: ? The German Accelerator graciously thanks its event partner: Rise New York is a collaborative co-working community shaping the future of commerce and fintech by helping startups and entrepreneurs connect, co-create, and scale innovation. In partnership with Barclays, we listen, nurture, and oxygenate through our international network of Rise hubs. Rise New York also houses a world-class event space and is home to the U.S. cohort of the Barclays Accelerator, powered by Techstars. In collaboration with:"
}