{
    "addr": "4543 Crown Ave La Cañada Flintridge, CA 91011", 
    "title": "Flintridge Prep Admissions Open House 2015", 
    "url": "http://www.eventbrite.com/e/flintridge-prep-admissions-open-house-2015-registration-19152571858?aff=ehomecard", 
    "location": "La Cañada Flintridge, CA", 
    "starttime": "2015-12-06T14:00:00-08:00", 
    "endtime": "2015-12-06T16:00:00-08:00", 
    "desc": "Flintridge Preparatory School's Admissions Open House gives you an opportunity to explore Prep's classrooms, art studios and athletics facilities.??There will be special presentations about middle school and high school programs. Headmaster Peter Bachmann will speak and answer questions at 2:15 and 3:15 in Norris Auditorium. Early registration ends Friday, December 4, at 12:00 PM. After that time, please register at the door. FAQs What are my parking options? Flintridge Prep's address is 4543 Crown Avenue in La Canada Flintridge.  T here are two entrances to the Open House. The main entrance is through Ahmanson Plaza, located at the corner of Crown Avenue and Foothill Boulevard.?The main parking lot is located directly across the street. Overflow parking is available at St. Bede School and at St. Francis High School. The second entrance is adjacent to the Crawford Family Gymnasium and gives quick access to athletics and arts facilities as you make your way to Ahmanson Plaza. Enter the parking lot at the corner of Foothill Boulevard and Hampton Road. You may also park on Hampton Road, but please don?t park in front of our neighbors? houses. Safety officers will be present to help direct you. Where can I contact the organizer with any questions? Contact Dana Valentino by phone (818-949-5514) or email (admissions@flintridgeprep.org) with questions about?our Open House and our admissions process. Do I have to bring my printed ticket to the event? You don't need to bring a ticket. Simply provide your student's last name at one of our two entrances. What is the Open House schedule? Our Open House is designed to allow you to view the campus at your own pace. We suggest that you begin or end with one of Mr. Bachmann's two sessions in Norris Auditorium (at either?2:15 or 3:15).?? Faculty presentations will also run concurrently throughout the afternoon, where you can find out about middle school and high school programs,?community service and leadership opportunities, athletics and other extracurricular activities. Your family is free to attend as many of these presentations as you like or to explore the campus at your leisure, meeting with faculty, parents, students, and coaches."
}