{
    "addr": "59 Orchard Street. 59 Orchard Street. New York, NY 10002", 
    "title": "Private Gallery Wine Social With Ice Breakers & Open Wine Bar", 
    "url": "http://www.eventbrite.com/e/private-gallery-wine-social-with-ice-breakers-open-wine-bar-tickets-4324596986?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Food \\u0026 Drink", 
        "Party or Social Gathering"
    ], 
    "desc": "Join  AndThatsWhyYoureSingle.com  members along with guests from other Manhattan networking groups for an intimate gathering at  Foley Gallery.  Included in admission: What to expect: Now you can meet people face to face before setting up that first date. Remember what that was like? Dress is trendy/upscale. No, guys, suits are not required. But when you see how fashionable the ladies look, you'll be glad if you dressed to impress. Ladies, you can wear anything from your little black dress to what you wore to work that day. Light music will play and new friends will be made. Show up with your room mate, your life mate, your co-workers..or show up alone.   There are no refunds for last-minute cancellations (less than 3 days in advance of the event) or no-shows. ? ? ? The Organizer RSVPD with X amount of people. What does that mean? That number represents the RSVPS (not registrations) that have come in through our other pages listed below. It is NOT the total number of people pre-paid. The typical number of people per event is 50-70.       What should I wear? Dress to impress.? No jeans, sneakers or athletic wear, please. Can I see photos of other attendees? Most people do not RSVP on meetup for privacy reasons. They only pre-pay and therefore do not share their photo. Where are all the RSVPs? About 50% of the registrations come through Eventbrite and our  main events website . They are not Meetup members. Many people prefer not to post their Meetup profile or photo for privacy reasons. What's The Refund Policy? Our policy is that all registrations are final. We can not offer refunds or transfers to last minute cancellations. However, if you notify us at least 3 days in advance, we can give you a credit to another event."
}