{
    "addr": "1109 5th Ave New York, NY 10128", 
    "title": "Dress Up, Dreidel Down Hanukkah Disco Party!", 
    "url": "http://www.eventbrite.com/e/dress-up-dreidel-down-hanukkah-disco-party-tickets-18315495139?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-13T15:00:00-05:00", 
    "endtime": "2015-12-13T17:00:00-05:00", 
    "desc": "Dress to impress at the Jewish Museum's very first Hanukkah Disco! Make your red carpet entrance, catch the daytime dance fever and kick off the last night of Hanukkah with latkes, mocktails, DJ, art, and more! For grandparents, parents, and children ages 2?tweens (children under 2 are free). Featuring 9-year old DJ Alden of CirKiz Plus: Walk the Red Carpet, Glitter Tattoo New York, Todd Neufeld's Twisted Balloon Company, and Family Photos FAQs: Where can I contact the organizer with any questions? For further information, contact Ariel Aicher at 212.423.3264 or  aaicher@thejm.org . Is my registration/ticket transferrable? Yes. Please e-mail  aaicher@thejm.org ?or call 212.423.3264 to ensure that your tickets will be held under the correct name at the door.? Do I have to bring my printed ticket to the event? No. Your name will be on a guest list at the door. You do not need to bring your reservation to the event.? What is the refund policy? All ticket sales are final and help to support the Museum?s education programs and exhibitions. We cannot provide any refunds.? Is my gift tax-deductible?? The estimated values of goods and services are: $25 per Party ticket; $35 per Family Membership; $15 per Family Concert ticket. The balance of your payment is tax deductible within the limits prescribed by law. What is a Family Membership? One-year Family Membership includes: free admission to the Museum for two adults and their accompanying children under 18, discounts on family programs, invitations to members-only exhibition viewings, and much more! For full list of benefits, please visit  TheJewishMuseum.org/Support#Memberships ."
}