{
    "addr": "53 Washington Square South New York, NY 10012", 
    "title": "A Presentation of Jorge Castañeda's Autobiography, \"Amarres Perros\"", 
    "url": "http://www.eventbrite.com/e/a-presentation-of-jorge-castanedas-autobiography-amarres-perros-registration-19497089319?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-07T18:00:00-05:00", 
    "endtime": "2015-12-07T20:30:00-05:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "Join the Center for Latin American Studies (CLACS) and the New York University Mexican Student Association (NYU-MEXSA) for a presentation of Jorge Casta?eda's autobiography \"Amarres Perros.\" This book presentation will feature an insightful conversation on politics, foreign policy, Mexico and more, between NYU's Global Distinguished Professor of Politics and Latin American and Caribbean Studies, Jorge Casta?eda, and Patricio Navia, Master Teacher of Liberal Studies. Their conversation will be followed by a reception, and book signing. Jorge G. Casta?eda Jorge Germ?n Casta?eda Gutman?(born May 24th, 1953) is a prominent Mexican public intellectual. He served as Secretary of Foreign Affairs for the Mexican government between 2000 and 2003, and later sought the Mexican presidency in a controversial campaign he ran as an independent. Jorge holds a B.A. from Princeton University (1973) and Ph.D. in Economic History from the University of Paris-1 (1978). He has written more that fifteen books on Mexican and Latin American politics, some of which include ?Utopia Unarmed: The Latin American Left after the Cold War? (1993), ?Compa?ero: The Life and Death of Ch??Guevara? (1997), ?Ma?ana?Forever? Mexico and the Mexicans? (2011). Jorge taught at the National Autonomous University of Mexico between 1978 and 2004, and since 1997 holds the tile of Global Distinguished Professor of Politics and Latin American and Caribbean Studies at New York University. Patricio Navia Patricio Daniel Navia Lucero (born May 19th, 1970) is a Chilean academic and public intellectual. Patricio holds a B.A. from the University of Illinois at Chicago (1992), an M.A. in Political Science from the University of Chicago (1994) and a Ph.D. in Politics from New York University (2003). He has written and co-edited eleven books and his academic papers have been published in journals such as Latin American Research Review, Contemporary Politics, Journal of Politics in Latin America, Journal of Legislative Studies, among others. Patricio is currently a Master Teacher of Liberal Studies at New York University and Full Time Professor of Political Science at Universidad Diego Portales (Chile). This event is free and open to the public. ID required for entry. Books will be available at the event."
}