{
    "addr": "1 Racetrack Drive East Rutherford, NJ 07073", 
    "title": "NJ Sneaker Expo @ the Meadowlands", 
    "url": "http://www.eventbrite.com/e/nj-sneaker-expo-the-meadowlands-tickets-18428271456?aff=ebrowse", 
    "location": "East Rutherford, NJ", 
    "starttime": "2015-11-22T12:00:00-05:00", 
    "endtime": "2015-11-22T18:00:00-05:00", 
    "desc": "Tri State's Fastest Growing Buy Sell & Trade Experience Invades The Meadowlands! Sunday November 22 @ Victory Meadowlands ? ABOUT THE SNEAKER EXPO SNEAKER EXPO? is the Tri State Area's ? fastest growing buy, sell, trade and network Event for footwear and apparel enthusiasts. ?A focus on the experience for both buyer and seller has led to exponential growth with each passing event. ?All patrons will have access to the hottest kicks, gear and accessories from Top Notch Vendors local to the area. ?Whether you are looking to check out some crazy displays or buy, sell and trade with the masses, the swap heat provides the connection for attendees of all ages. VENDOR INFORMATION ? SNEAKER EXPO ?success is deeply rooted in the quality of our vendors that choose to bring their brand to our show. ?We take great pride in generating brand awareness for our vendors and offer any support through promotions, giveaways and sponsorship. In priding ourselves upon building long lasting relationships, we have? assembled the best vendors, representing Kicks, Fashion, Art and Accessories, all under one roof and easily accessible to the public! VENDOR TERMS & CONDITIONS SNEAKER EXPO ?provides Vendors with premium space to sell, trade and showcase their merchandise in unlimited quantities to sneaker and fashion aficionados on a grand scale. Each vendor will be entitled to One 6 foot table, 2 Chairs and 1 designated parking space Vendor admission includes 3 people per table, each additional person is $30. Spaces are rented on a first come first serve basis and do not become guaranteed until payment is received. Vendors may setup between the hours of 9AM ? 11AM on 11/22 . ?  Table placement will be available on a First Come First Served Basis, unless you are a designated sponsor. SNEAKER EXPO? will not assume responsibility or liability for any damage, loss, theft or injury that may occur to the exhibitor or the exhibitor?s belongings. Counterfeit merchandise is STRICTLY PROHIBITED, and you will be subject to immediate dismissal with NO REFUNDS. Vendors are NOT allowed to sell food or drink of any kind. GENERAL TERMS AND CONDITIONS ? All Tickets and Vendor Table(s) are non-refundable.?   ALL SALES ARE FINAL ? All exits are final after 5PM ? SNEAKER EXPO ?will not assume responsibility or liability for any damage, loss, theft or injury that may occur to a patron or their belongings SNEAKER EXPO ? is not responsible for any sales or trades between a buyer and seller Raffles & Giveaways  - All winners, Must be Present at the time of drawing to claim your prize."
}