{
    "addr": "2 Metrotech Center. 8th floor. Brooklyn, NY 11201", 
    "title": "Watch the Skies Invades NYC", 
    "url": "http://www.eventbrite.com/e/watch-the-skies-invades-nyc-tickets-18884524120?aff=ebrowse", 
    "location": "Brooklyn, NY", 
    "starttime": "2015-12-12T11:00:00-05:00", 
    "endtime": "2015-12-12T18:00:00-05:00", 
    "desc": "Part RPG and part board game, Watch the Skies brings together 60 players who will play on teams as various nations, journalists and the alien visitors. ? ? The journalists will be trying to report the truth using special... methods and compete to receive the coveted Pulitzer Prize. ?Pay close attention to journalists; their articles will have huge effects on the game! ? And the aliens... well, you'll have to play the game to see what they're up to. ? The game will last approximately 6 hours.? Bring a lunch and some water.? All game materials will be provided by the MegaGame Society, except costumes, which are not required but are encouraged! ? For those of you that watched the Shut Up and Sit Down episode: over the past year we have completely reworked every aspect of the game (working with the original game creator, Jim Wallman of Megagame Makers).? Don?t worry, you?ll have a unique experience that cannot be spoiled by past videos! ? ? ? Tickets will go on sale to the general public October 19th at 12pm EST. ?Make sure to get here then to get your tickets! ? Nope!? The alien motivations/plot/mechanics have changed so feel free to watch any of the? ?(if fact please do - they're fantastic) ? Of course!? Your team should decide on a team name before buying a ticket.? When you buy your ticket you will be asked if you are part of a team, if you are click yes and enter your team name when prompted. ? Nope! ?We'll be finalizing teams in the coming month. ?After finalizing teams we will send out the differnt roles and allow you and your team to make decisions of who will play which roles. ?We will be sending out team and role specific materials three to four weeks before the actual game. ? You can buy up to 5 tickets in an order (a full human nation team).? This is a good way to get tickets for your entire team if you're worried all of your team won't be able to be online to buy tickets.? ? The breakdown is: So a maximum of 54 players total can play. ? We recommend?using the excellent NYC subway system. ?The closest stops are about 5 minutes walking from NYU Game Center and are A, C, F, N, R at Jay Street Metrotech 2, 3, 4, 5 at Borough Hall Q at Dekalb ? Every dollar goes back into the game and pays for printing, the space, laminating, miniatures, eventbrite fees and any other costs that come up. ? ? Up to 5 weeks before the event we will issue you a full refund. ?After that all sales are final!"
}