{
    "addr": "Madison ave. New York, NY 10036", 
    "title": "NYC Real Estate Investor Workshop", 
    "url": "http://www.eventbrite.com/e/nyc-real-estate-investor-workshop-tickets-13953682841?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-03T18:30:00-05:00", 
    "endtime": "2015-12-03T20:30:00-05:00", 
    "categories": [
        "Real Estate", 
        "Seminar or Talk"
    ], 
    "desc": "Would you like to meet a group of local successful Real Estate investors who are reaping the benefits of a once in a life time buyers market?   At this meeting we will discuss why there are more millionaires created through real estate than all other industries combined. Right now we're in a once in a lifetime Real Estate buyers market which is helping to fuel our expansion. The combination of record low mortgage rates and underpriced housing values is why our group is making a killing in this market. Even the \"world's greatest Investor\" Warren Buffet is advising people to buy real estate. You will have the opportunity to: *Network with a group of successful Real Estate Investors. *Learn how rental properties are one of the best tax saving strategies out there. *Discuss the biggest money making opportunities in today's market: Short Sales, Lease Options, Fix and Flips, Foreclosures, Seller Financed Notes, Multi-Family Dwellings and much more. *Learn how to be your own boss. *Find out how you can earn while you learn Real Estate Investing. *Learn how to build massive wealth with strategies such as Fix and Flips and passive wealth with rental properties. *And so much more.   Each meeting is different as we will show you different deals we've completed recently. We will also show you how you can be included in the deals we have going forward.? Some of our members invest part time for residual income while others have been able to   FIRE THEIR BOSS   to invest full time. If you are interested in learning how to make consistent $30,000 or more per deal then RSVP! We have a wide network of Real Estate Investors local to the NY Metro Area that will show you how."
}