{
    "addr": "New York, NY 10001", 
    "title": "OAUGNYC 2015 Meeting", 
    "url": "http://www.eventbrite.com/e/oaugnyc-2015-meeting-tickets-17986369716?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-14T08:15:00-05:00", 
    "endtime": "2015-12-14T19:00:00-05:00", 
    "categories": [
        "Finance", 
        "Meeting or Networking Event"
    ], 
    "desc": "Attention all OAUGNYC E-Business Suite and EPM/BI supporters. Mark your calendar for the next Oracle user group event. Planning is under way for the 2015 OAUGNYC Meeting in partnership with the NYC Hyperion and Oracle EBS/HCM user communities. Registration: ?Registration is now open!! Registration Questions: ? Contact? rj@oaugnyc.org Sponsorhip Opportunities: ? Contact? robin@oaugnyc.org Spread the word among your colleagues about our user group and this meeting. Visit the? OAUGNYC membership page ?to join the group. Membership is free to all. Please be sure to follow us on Facebook, LinkedIn, and Twitter for reminders and updates. ?? ?? Meeting Agenda: ?The Meeting Agenda is now available!! ? ? EBS Track I EPM/BI Track II MIXED Track Location:   PennTop  Center Location:   PennTop  North Location:  Madison 8:15?9:15 Registration / Networking Breakfast / Exhibits Location:   PennTop  South 9:15?9:30 Welcome  Location:   PennTop  North OAUGNYC Board  9:30?10:25 Session:  Experience of Integrating  Taxware  with Oracle EBS R12.2 and above Session:  Hyperion Upgrade Tips & Tricks Session:  Everything you need to know about Cloud ERP Migrations/Reporting Presenter:  Rajesh Singh, Principal Consultant (Apps Associates LLC) Presenter:   Daniel Villani, Manager (EY) and Joseph Tuite, ?  Sr. Manager, Ent Wide Reporting, Corporate Applications, Analytics and Services (Quest Diagnostics) Presenter:   Sreekanth   Bodagala , Senior Consultant ?  and  Arun  Kumar ?  S  Rathod , Sr. Principal Consultant (Apps Associates LLC) 10:25?10:40 Networking Break / Exhibits Location:   PennTop  South 10:40?11:35 Session:  Are you a Breach-o- Phobe ? Securing data in your Oracle EBS environment Session:  Delivering an Enterprise-Wide Standard Chart of Accounts with Oracle DRM Session:  R12.2.x: Technical Overview, Deployment, Administration and Online Patching Presenter:  Rajesh  Parthasarathy , Founder/CEO and John  Sosnowski , VP Sales (MENTIS Software) Presenter:  Gary  Crisci , ? (GE) Presenter:  Sushil  Motwani , Senior Principal Technical Account Manager (Oracle) 11:35?12:25 Keynote Location:   PennTop  North Topic:  The Effortless Experience: Conquering the New Battleground for Customer Loyalty Presenter:  Lara Ponomareff, Practice Leader (CEB) 12:25?1:25 Networking Lunch / Exhibits Location:   PennTop  South Lunch Sponsor: Innovus Partners 1:25?2:20 Session:  Web services using standard Oracle EBS Session:  Turning your Excel Business Process Workflows into an Automated Business Intelligence Application Session:  Intercompany Accounting in Cloud Financials - Functionality Explained Presenter:   Divya   Kantem , Principle Consultant (Apps Associates LLC) Presenter:  Kevin O?Rourke, Director, Practice Leader, BI Solutions ( TriCore  Solutions) and Donna  Mackin , Director, Business System Services (UGI) Presenter:  Thomas  Simkiss , CFO ( BizTech ) 2:20?2:35 Networking Break / Exhibits Location:   PennTop  South 2:35?3:30 Session:  All you need to know about OPM configurations and conversions Session:  Best Practices in BI: ?  Let Your Business Processes Drive Successful BI Analytics Session:  A Guide to Planning & Budgeting Cloud Service (PBCS) Presenter:   Thirupathi  Kelli, Principal Consultant (Apps Associates LLC) Presenter:  Kevin O?Rourke, Director, Practice Leader, BI Solutions ( TriCore  Solutions) Presenter:  Pete Cammisa, ?  (Innovus Partners) 3:30?3:50 Closing Comments / Prize Giveaways 4:15?7:00 HAPPY HOUR - ODTUG/OAUGNYC Collaborative Event? ? ? Disclaimer: Meeting agenda subject to change prior to event date at discretion of OAUGNYC Board."
}