{
    "addr": " 60 Centre Street New York, NY 10007, US", 
    "title": "NY - IRS AFSP 2016", 
    "url": "http://www.eventbrite.com/e/ny-irs-afsp-2016-registration-17173844431?aff=ebrowse", 
    "location": "", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Education", 
        "Class, Training, or Workshop"
    ], 
    "desc": "400 38th St. Ste 201B Union City, NJ 07087 Genral : (201) 869-9700 ? ? ? ? ? ? ? ? Approved by NJ Dept of Education and Work Force ? Approved by IRS Continuing Education Provider ? Approved by NASBA, CPE Provider for CPAs ? ? ? ========================================================================= ? We are the only few schools around New York Metro area offering the live classes to meet the AFSP? ? The Internal Revenue Service announced today that guidance will soon be issued outlining a new voluntary program designed to encourage education and filing season readiness for paid tax return preparers. The program will be in place to help taxpayers during the 2016 filing season. The Annual Filing Season Program will allow unenrolled return preparers to obtain a record of completion when they voluntarily complete a required amount of continuing education (CE), including a course in basic tax filing issues and updates, ethics and other federal tax law courses. Tax return preparers who elect to participate in the program and receive a record of completion from the IRS will be included in a database on IRS.gov that will be available by January 2015 to help taxpayers determine return preparer qualifications. The database will also contain information about practitioners with recognized credentials and higher levels of qualification and practice rights. These include attorneys, certified public accountants (CPAs), enrolled agents, enrolled retirement plan agents (ERPAs) and enrolled actuaries who are registered with the IRS. ? ? IRS APPROVED CONTINUING EDUCATION PROVIDER ? ? NJ Department of Education and Labor Work Force Development Approved the program ? ? You can verify our school at IRS website under \"TaxSmarter.com Academy in Union City, NJ where our main school campus is located. ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?  ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? IRS APPROVED CONTINUING EDUCATION PROVIDER ? ? NJ Department of Education and Labor Work Force Development Approved the program ? You can verify our school at IRS website under \"TaxSmarter.com Academy in Union City, NJ where our main school campus is located. ? ? http://www.IRS.GOV/TAXPROS/CE ? ? FAQs ? Where can I contact the organizer with any questions? Contact us at:? Email : TaxSmarter@gmail.com Phone: 201-869-9700 ? Where the classes will be held in NY? ? Fordham Univ, Bronx NY  Hunter College, Manhattan, NY Queens College, Queens, NY Webinar - Gotowebinar.com/ Live group online method Self Study Online - Avial via online Test Bank? ? Can I update my registration information? You can edit, update, cancel at your own or contact us and we will gladly update any information. ? Do I have to bring my printed ticket to the event? Yes, handing in the ticket makes check in faster. ? What is cancellation polocy? Refund will be granted 100% 24 hours prior to the event. ? Is parking available? There is a municipal parking or paid parking or only street parking avail.?? ? What is the payment policy? Once you register, you will receive an email for payment options. ? ? ? Testimonials ? http://www.youtube.com/watch?v=Md8ZZEBRElA  (English) ? ?? http://www.youtube.com/watch?v=HMcG7K2fBoA ?(Spanish) ? ? Former IRS Agent offers AFSP Continuing Education Credit Courses in NJ.   http://www.linkedin.com/in/austinsong ? Seats are limited and normally fill up quickly, so please book today and secure a seat. ? Register now!? Seats are limited. Call  201-869-9700  or email:? TaxSmarter@gmail.com  for more information ? The course is taught by: ? Austin Song , former IRS agent, holds a master degree in Taxation at the University of Washington.   http://www.linkedin.com/in/austinsong"
}