{
    "addr": "643 Park Avenue New York, NY 10065", 
    "title": "2016 Winter Antiques Show • January 22-31, 2016", 
    "url": "http://www.eventbrite.com/e/2016-winter-antiques-show-january-22-31-2016-tickets-2447765332?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-01-22T12:00:00-05:00", 
    "endtime": "2016-01-31T18:00:00-05:00", 
    "categories": [
        "Home \\u0026 Garden"
    ], 
    "desc": "The Winter Antiques Show marks its 62nd year as the most prestigious art, antiques, and design fair in America, featuring the ?best of the best? from Antiquity through the present. Held at the historic Park Avenue Armory in New York City, the Show provides curators, new and established collectors, dealers, and design professionals with opportunities to view and purchase exceptional pieces? showcased by 73 exhibitors. Each object exhibited at the Winter Antiques Show is vetted for authenticity, date, and condition by a committee of 160 experts from the United States and Europe. The strict vetting regulations and the vettors' expertise ensure that buyers can purchase with confidence.? The Winter Antiques Show is an annual benefit for East Side House Settlement, a community resource in the South Bronx that celebrates its 125th anniversary in 2016. East Side House's programs focus on education and technology as gateways out of poverty and as the keys to economic opportunity. All revenues from the show's general admissions and the net proceeds from the preview parties and other events go East Side House and contribute substantially to its private philanthropic budget. No part of sales made by exhibitors is received by East Side House. Restaurants There is a cafe on the Show floor catered by Canard. Wheelchair Access Wheelchair access is via the Lexington Avenue entrance. Baby Strollers Because of large crowds at the Show on the weekends, baby strollers are not permitted on weekends. This regulation protects the child's safety.? Checked Bags For security reasons, the public is required to check all bags, backpacks, large purses, shopping bags, briefcases, tote bags, and any other item deemed too large by Security."
}