{
    "addr": "64 Morningside Drive New York, NY 10027", 
    "title": "The Transformation of the Indonesian Economy in Challenging Times", 
    "url": "http://www.eventbrite.com/e/the-transformation-of-the-indonesian-economy-in-challenging-times-tickets-19609999035?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-30T12:30:00-05:00", 
    "endtime": "2015-11-30T14:00:00-05:00", 
    "desc": "The Weatherhead East Asian Institute, the APEC Study Center, and the Columbia University School of International and Public Affairs are pleased to present the program,?The Transformation of the Indonesian Economy in Challenging Times? featuring  , Manging Director and Chief Operating Officer, World Bank and former Minister of Finance, Indonesia;  , Former Minister of Trade, and of Tourism and Creative Economy, Indonesia and Adjust Professor, Columbia University; with comments from ? , Professor of International and Public Affairs, Columbia University. ? As Managing Director and Chief Operating Officer, Sri Mulyani Indrawati is responsible for the institution?s operations in all regions. She also oversees the new global practices and cross-cutting solution areas which bring together the best expertise from across the Bank Group and from partners to help tackle the most complex development challenges. In addition, she oversees other administrative vice presidencies and functions, including the Integrity Vice Presidency, Sanctions Board Secretariat and the Office of Evaluation and Suspension. Ms. Indrawati joined the World Bank in June 2010. Previously she served as Indonesia?s minister of finance in addition to being the coordinating minister of economic affairs. She led the Indonesian National Development Planning Agency prior to her position as Finance Minister. Her earlier positions include Executive Director at the International Monetary Fund, faculty member at the University of Indonesia and Visiting Professor at the Andrew Young School of Public Policy at Georgia State University. Ms. Indrawati holds a Ph.D. in economics from the University of Illinois and a B.A. in economics from the University of Indonesia. Professor Mari Pangestu served as Indonesia?s Minister of Trade from 2004 to 2011, and as Minister of Tourism and Creative Economy from 2011 until October 2014. As Minister of Trade she led all the international trade negotiations and cooperation for Indonesia. As Minister of Tourism and Creative Economy, apart from the tourism portfolio, she was in charge of developing the newly created strategy for developing the Creative Economy in Indonesia. She obtained her Bachelor and Master degrees in Economics and Doctor HC degrees from the Australian National University (ANU), and her PhD from the University of California, Davis, in 1986 where she specialised in macroeconomics, and international trade. In 2013 she was awarded a Doctor of Letters honoris causa, College of Business and Economics, Australian National University on the grounds of outstanding contributions in the service of society, and the Bintang Mahaputra, the highest public service award by the President of Indonesia. Prior to being a minister she was one of Indonesia?s well-known economists attached to Indonesia?s leading think thank Centre for Strategic and International Studies as well as teaching at the Faculty of Economics, University of Indonesia. She has done academic research and policy studies in the areas of international trade, financial sector, macro-economics and reforms. She was and continues to be active with the second track fora such as Pacific Economy Cooperation Council (PECC) and other international leadership fora such as Davos World Economic Forum (including being on various Global Agenda Councils), China Boao Forum for Asia, and the Asian Economists Panel. Professor Pangestu worked with Jeffrey Sahcs on the UN Secretary General Millennium Development Goals (MDGs) Review (2003-2005), was the WTO Group-33 Chairperson (2005-2011), nominated as a candidate for the WTO Director General (2013). In December 2014, she was awarded the ?lifetime achievement in leadership? award during the World Chinese Enterprise Forum in Chongqing China. Currently she is a Professor of International Economics at the University of Indonesia and on the Board of Directors, Centre for Strategic and International Studies, Jakarta. She currently serves on the Leadership Council of the UN Sustainable Development Solutions Network (SDSN); panel of the UN WHO health initiative, Equal Access Initiative (chaired by Pascal Lamy); distinguished fellow Asia Global Institute, University of Hong Kong; board member to Australia Indonesia Council; continues to be on the editorial board of Bulletin of Indonesian Economic Studies, ANU and member of Women International Council on Women?s Business Leadership (Chaired by Hilary Clinton). As for the private sector, Mari Pangestu is a Commissioner on the Board of Astra International; sits on the International Advisory Board of Sumitomo Mitsui Banking Corporation and McLarty Associates, Washington DC; Board Member of International Chamber of Commerce (ICC), Paris and is also active as an advisor to various other social and business organizations. Takatoshi Ito joined the faculty of SIPA as a professor of international and public affairs in January 2015. An internationally renowned economist, Ito is an expert on international finance, macroeconomics, and the Japanese economy who served from 2006 to 2008 as a member of the Prime Minister?s Council on Economic and Fiscal Policy. He also held senior positions in the Japanese Ministry of Finance and at the International Monetary Fund. Ito served as dean of the University of Tokyo?s Graduate School of Public Policy for the past two years and as professor at Japan?s National Graduate Institute for Policy Studies. He has served as a visiting professor at both Columbia and Harvard and taught at other institutions. He earned his PhD in economics at Harvard University. Ito has had distinguished academic and research appointments such as president of the Japanese Economic Association in 2004; fellow of the Econometric Society, since 1992; research associate at the National Bureau of Economic Research since 1985; and faculty fellow at the Centre for Economic Policy Research, since 2006. He was editor-in-chief of Journal of the Japanese and International Economies, and is co-editor of Asian Economic Policy Review. In an unusual move for a Japanese academic, Ito was also appointed in the official sectors, as senior advisor in the Research Department, International Monetary Fund (1994-97) and as deputy vice minister for international affairs at the Ministry of Finance, Japan (1999-2001). He served as a member of the Prime Minister?s Council on Economic and Fiscal Policy (2006-2008). In 2010, he was a co-author of a commissioned study of the Bank of Thailand?s 10th year review of its inflation targeting regime. He frequently contributes op-ed columns and articles to the Financial Times and Nihon Keizai Shinbun. He is an author of many books including The Japanese Economy (MIT Press, 1992), The Political Economy of the Japanese Monetary Policy (1997) and Financial Policy and Central Banking in Japan (2000) (both with T. Cargill and M. Hutchison, MIT Press), An Independent and Accountable IMF (with J. De Gregorio, B. Eichengreen, and C. Wyplosz, 1999). He is also the author of more than 130 academic (refereed) journal articles in journals such as Econometrica, American Economic Review, and Journal of Monetary Economics and chapters in books on international finance, monetary policy, and the Japanese economy. His research interests includes capital flows and currency crises, microstructures of foreign exchange rates, and inflation targeting. He was awarded the National Medal with Purple Ribbon in June 2011 for his excellent academic achievement."
}