{
    "addr": "Columbia University New York, NY 10027", 
    "title": "Movie Screening: Climate - Make It Work!", 
    "url": "https://www.eventbrite.com/e/movie-screening-climate-make-it-work-tickets-19633106149?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-01T18:00:00-05:00", 
    "endtime": "2015-12-01T20:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Screening", 
        "Other"
    ], 
    "desc": "For 20 years, international climate negotiations have stalled on action to address the urgency of climate change. This powerlessness stems from a huge complexity of intersecting issues and the institutionalization of a certain negotiation procedure over the years. \n Paris Climat Make It Work is an initiative launched by Sciences Po and partner institutions in preparation for the upcoming Conference of the Parties international climate negotiations in Paris (COP21). Led by Laurence Tubiana, the Special Representative of France for the COP21, and French philosopher Bruno Latour, the initiative culminated in a gathering of 200 youth and students from around the world in May to partake in a public simulation of the COP that lasted for three days. \n Tying in elements of innovation and tradition, the project was created so that political action could meet artistic creativity. In addition to bringing the voices of the youth to the forefront of climate change issues, the project was also about experimenting in order to understand, to act and to transform. Following the students? three-day journey, the film is also scheduled to be screened around the world in Beijing, Tokyo and at the COP21 in Paris. \n \n Guest panelists: \n Michael B. Gerrard  ? ?Andrew Sabin Professor of Professional Practice, Columbia Law School \n Nora Philippe ? Producer of the film, Les films de l?air \n Jennifer Ching ? President of the Make It Work Simulation and SIPA student \n Michael Kowiak ? Participant representing Saudi Arabia and Columbia University graduate \n A documentary by Dvaid Bornstein, 51 minutes, 2015 \n Produced by Les films de l'air, coproduced by Les films de l'aiguemarine, with the support of Sciences Po, Th??tre Nanterre-Amandiers, MSLGROUP #Bethechance, IDDRI, Karlsruhe Art and Design School and PIerre Yovanovitch, under the patronage of UNESCO.? \n \n Watch the trailer at:? https://vimeo.com/ ondemand/climatemakeitwork/ 141452226 \n Facebook event page:? https://www.facebook.com/events/1709667985928430/ \n Follow us on Twitter! @COP21MIW \n More information on the Make It Work Simulation:? http:// www.cop21makeitwork.com/"
}