{
    "addr": "630 Second Avenue  New York, NY 10016 New York, NY", 
    "title": "Chanukah Party 2015", 
    "url": "https://www.eventbrite.com/e/chanukah-party-2015-tickets-19637939606?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-06T19:00:00-05:00", 
    "endtime": "2015-12-06T23:00:00-05:00", 
    "categories": [
        "New York, NY Events"
    ], 
    "desc": "Chanukah Party:?Sunday, December 6th  \n Dinner, Lecture, Live Music & Dancing? \n 7pm-11pm |?Location: 630 2nd Avenue \n $72 in Advanced, $82 at the door \n The eight days that make up Chanukah afford us an opportunity. An opportunity to identify and manifest the missing link between ourselves and the Light Force of the Creator.    The kabbalists explain that it is the vessel that is always the missing link. Simply having the knowledge of what type of Light is available on Chanukah ? what type of energy, what types of gifts and blessings are accessible through this cosmic opening ? builds our vessel, one that is sturdy and pure enough to receive the powerful Light at hand.    Simply put, the knowledge gives us the vessel. The Light open to us during Chanukah is known to kabbalists as the Endless Light. It is the Light of immortality, the Light of the removal of pain, suffering and death from this world. So powerful an energy is it that we cannot do anything to draw it; it is a gift. We receive this gift to the degree that we build up our vessel ? to the degree that we truly understand and appreciate the Endless Light of Chanukah. \n \n Nightly Candle Lighting? \n By lighting candles during this time, using kabbalistic meditations, and injecting the consciousness of sharing, we connect our souls to the energies prevalent in the cosmos during the eight days of Chanukah and plant the seed for miracles, big and small, to fill our entire year. Sunday 12/6 ? During Chanukah Party? Monday 12/7 - 8:00pm? Tuesday 12/8 - 6:45pm? Wednesday 12/9 ? 8:00pm? Thursday 12/10 - 6:30pm Friday 12/11 - 3:00pm? Saturday 12/12 -5:15pm Sunday 12/13 - 6:00pm"
}