{
    "addr": "4 Columbus Circle , New York 10019", 
    "title": "AFHny Holiday Party 2015", 
    "url": "http://www.eventbrite.com/e/afhny-holiday-party-2015-tickets-19599155602?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-01T18:30:00-05:00", 
    "endtime": "2015-12-01T21:30:00-05:00", 
    "categories": [
        "Charity \\u0026 Causes", 
        "Party or Social Gathering"
    ], 
    "desc": "This Giving? Tuesday, December 1st ,?AFHNY is celebrating social impact, great design and the gift of giving in New York City. We invite you to join us?as we drink to this year's accomplishments and prepare for an exciting 2016. Festivities will include?the much anticipated return of our annual firm vs. firm gingerbread house design competition, a gift raffle, seasonal refreshments and more. As always, but especially on Giving Tuesday, all funds donated for this event will be put towards AFHny's projects that provide positive social impact in New York City.? Help us continue our great work by donating today! ? Follow the conversations at: ? #givingtuesday ? #afhnygives ? Light fare and drinks to be served. ? We look forward to seeing you there! Who are we? AFHNY, a?staple?in the New York City community since 2003, is a volunteer-run collective that actualizes the potential of local communities through creative design and development solutions. We partner with design professionals with local non-profit organizations, schools, government agencies, and community groups with the hope to provide design equity for all. ? ? A huge thank you to our sponsors:? ? Steelcase:? Steelcase Inc. helps create great experiences - wherever work happens. Our brands offer a comprehensive portfolio of workplace furnishings, products and services, inspired by nearly 100 years of insight gained serving the world's leading organizations. ? And our Raffle Donors: Princeton Architectural Press DK | Penguin Random House Hallmark Lighting Rockwell Group MoMA Jaclo FLOR ? Raffle donation items still being accepted. Contact Adrielle at aslaugh@afhny.org."
}