{
    "addr": "130 East 59th Street New York, NY 10022", 
    "title": "Break up with Stress and Live a Happy, Productive and Mindful Life", 
    "url": "https://www.eventbrite.com/e/break-up-with-stress-and-live-a-happy-productive-and-mindful-life-tickets-19404637794?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-03T18:00:00-05:00", 
    "endtime": "2015-12-03T20:00:00-05:00", 
    "categories": [
        "New York, NY Events"
    ], 
    "desc": "Stress  is very damaging to both our brain and our body. It prevents us from reaching our creative potential and blocks our ability to better problem solve. It increases anxiety, depression and negative mood states. It can also be exhausting and interfere with our sleep patterns. \n The evidence shows that practicing mindfulness is our best defense against stress. Even better? Mindfulness also increases the richness in our life allowing us to enjoy the people and experiences we value most. \n Many large organizations are now implementing mindfulness training in their organizations. They are showing an increase in quality, collaborative teamwork, better employee health and significant lower overall costs. \n In this engaging workshop we will explore the  mind-body connection  to stress and learn ways to break out of the stress cycle. We will also review some data of the effectiveness of mindfulness in the workplace, the benefits to corporations and explore how mindfulness could help YOU be more focused, attentive, effective and happier in both work and in life. \n Speaker Biography: \n Maria Fanelli  is Director of Teachers for  eMindful , a company that delivers online mindfulness-based wellness curricula through live and interactive online classrooms to employees of major corporations, smaller businesses and individuals around the globe. Prior to this role,  Maria  was the Founder and President of Work and Life Management, a mindfulness training and consulting company, where she was a strong advocate of actualizing awareness and effectiveness in the workplace. Maria previously had a successful business career where she held several leadership positions at the University of Pennsylvania Health System. Her educational credentials include a bachelor?s degree from The Wharton School of Business, a master?s degree from The Villanova School of Business, and a master?s degree in Applied Meditation from The Won Institute of Graduate Studies. \n Thursday, December 3, 2015 \n Time:  6:00 - 8:00pm 6:00 to 6:30 - Registration & cocktails 6:30 to 7:30 - Discussion 7:30 to 8:00 - Audience Q&A \n Venue:  Conference Center, 130 E. 59th St., NY \n Price: $10/Member $10/Member guest (limit two) $20/Non-member alumni $30/Non-alumni No refunds will be given. Program is off the record. Ticket price does not include Eventbrite service fee. \n Organizers:  Celia Currin '72, Cindy Tran '04"
}