{
    "addr": "New York, NY ", 
    "title": "Board the Bus to NEW YORK CITY!", 
    "url": "http://www.eventbrite.com/e/board-the-bus-to-new-york-city-tickets-19610768336?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-12T07:15:00-05:00", 
    "endtime": "2015-12-12T22:00:00-05:00", 
    "categories": [
        "Travel", 
        "Camp, Trip, or Retreat"
    ], 
    "desc": "*****TICKETS GO ON SALE ON MONDAY, NOVEMBER 23RD AT 8AM***** BOARD THE BUS TO NEW YORK CITY! ? Sponsored by the Office of Student Programs, this trip will take you from the Blanchard Bus Stop on the Mount Holyoke campus to the Big Apple - New York City! You will have approximately 8 hours to explore the city - see famous landmarks such as the Statue of Liberty and the Empire State Building, catch a show on Broadway, Ice Skate at Rockefeller Plaza, or see the Lights of Time Square! ?The bus will be departing from the Blanchard Bus stop PROMPTLY at 8AM on Saturday, December 12th. Our trip coordinator will be checking attendees in starting at 7:15AM so please be early! It is your responsibility to make the bus on time. The bus will be dropping you off at 53rd and Broadway at approximately 11AM and picking you up in the same location starting at 6:30PM. It will be departing from 53rd and Broadway PROMPTLY at 7PM. The bus cannot wait for anyone and if you miss the bus you will be responsible for finding your own ride back to campus, lodging, etc. ALL attendees will be asked to sign a liability waiver prior to boarding the bus. You cannot board the bus without signing the waiver. We will have copies for attendees to sign on the day of the trip, but if you would like to review the waiver prior to signing up for the trip, it can be? found here .?This trip is intended for a recreational day trip to the city and is not intended for a one-way trip.  No refunds will be given under any circumstance. If you have further questions regarding this trip, please contact the Office of Student Programs at studentprograms@mtholyoke.edu or (413) 538-2478."
}