{
    "addr": "172 Norfolk Street New York , New York 10002", 
    "title": "Women's Travel Fest 2016", 
    "url": "http://www.eventbrite.com/e/womens-travel-fest-2016-tickets-19024226975?aff=ebrowse", 
    "location": "New York , New York", 
    "starttime": "2016-03-05T09:30:00-05:00", 
    "endtime": "2016-03-05T18:00:00-05:00", 
    "desc": "The Women's Travel Fest is a two-day event that aims to inspire, empower and connect women in travel. Been thinking about traveling but feel intimidated? Want to get passionate about finding your place in the world? Hoping to meet other awesome, empowered female travelers? This is the festival for you! The Women's Travel Fest has SOLD OUT the past two years in a row. Don't miss your chance to attend!? We are thrilled to return to Angel Orensanz Foundation in New York City. This venue was the home of our inaugural event and it is simply magical.? Here are 5 solid reasons why this is the event of the year for women who love to travel.? Your Ticket Also Gets You:? Free lunch Free open bar after party Free awesome swag bag Access to giveaways!? You don't want to miss this!?  Allows you access to our pre-party and both days of the festival. Early bird sales run from Oct. 28- Nov. 30. Price will increase to general admission on Dec. 1 at 12:01 am. : Sales begin Dec. 1 at 12:01 a.m. Allows you access to pre-party and both days of the festival.? : Sales begin Dec. 1 at 12:01 a.m. Allows access to event on Saturday, March 5th at Angel Orensanz only.? : For those who would only like to attend our workshops on Sunday, March 6th. This ticket does not allow you entrance to the main event on March 5th at Angel Orensanz.? : allow you access to our Day 2 workshops exclusively. Purchasing this ticket alone will NOT allow you access to our Day 1 main-day event. Likewise, having a Day 1 ticket will not allow you entrance to the workshops. If you would like to attend our Day 2 workshops, you MUST purchase either a 2-day full pass ticket, or an indivdual workshop ticket.? There is a small Eventbrite processing fee for all ticket types. Have questions about The Women's Travel Fest?"
}