{
    "addr": "103 3rd Avenue. Corner of 3rd Avenue & 13th Street. New York, NY 10003", 
    "title": "NYC Meet Plan Go Meetup - Met Planned Went", 
    "url": "http://www.eventbrite.com/e/nyc-meet-plan-go-meetup-met-planned-went-tickets-19219312481?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-01T18:30:00-05:00", 
    "endtime": "2015-12-01T21:00:00-05:00", 
    "desc": "We are excited to be ending our year talking to 3 groups of travelers who all attended Meet Plan Go events in the past and actually went and took a career break and have since returned back home to NYC. We will be discussing what it was like to come back after being gone, what hurdles they faced, and how they all coped with wanting to be out back on the road. It will be an evening where we celebrate those who WENT! And for the people who are dreaming and planning their career break for 2016 or beyond - this is a great opportunity to talk to those who went and get advice and inspiration. ? ? ?  are NYC transplants from rural Ohio who left their 9 to 5 jobs to embark on an extended career break around the world less than a year after getting married. Aside from the first stop, their yearlong trip was planned entirely on the fly and led them through over 20 countries in Africa, Europe, Asia, and North America. Their itinerary included climbing to the summit of Mt. Meru & Mt. Kilimanjaro in Tanzania, running 5 half/full marathons in different countries, the world?s highest bungee jump in South Africa, boating through the Mekong Delta, and volunteering at orphanages, elephant sanctuaries and animal rescue shelters. They included the U.S. in their trip, driving an 8,000 mile lap around the country and taking 6 weeks to travel through the flatlands of the southwest, drive along California?s scenic coastline, explore Death Valley, and hike the Grand Canyon.    Upon closure of their trip, the couple spent several months with their family in Ohio and Jeff has since returned to a corporate finance position in NYC that he lined up while abroad. Brandie has continued life outside of the 9 to 5, taking courses to develop new skillsets, advising others on how to take their own career break, and evaluating her next career move. Jeff and Brandie continue to compete in local marathons and are envisioning another extended trip to check more destinations off the bucket list. Website:"
}