{
    "addr": "New York, NY", 
    "title": "NY - Sailing Adventure Vacation in the British Virgin Islands!", 
    "url": "http://www.eventbrite.com/e/ny-sailing-adventure-vacation-in-the-british-virgin-islands-tickets-18742936628?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-20T22:00:00-05:00", 
    "endtime": "2015-11-29T10:00:00-05:00", 
    "desc": "Hello Everyone, We will be sailing on a private yacht in some very warm teal blue water. Food and Drinks (yes alcohol) are included in the price you will pay. This is an *all inclusive trip. This is an adventure trip. Food will be provided but will not be cooked for you. We will cook and clean up after each other as a group. If you have very specific eating habbits you may not like this trip. Only cool people are allowed!!! Wink Emoticon! We will be sailing from Island to Island hanging out at local beach bars and restaurants and of course lots of other fun activities like swimming, snorkeling, ocean kayaking, scuba diving (this will cost extra and will have to arranged before hand by you), all kinds of sea life, and yes even relaxing on a beautiful yacht!!!! Each Cabin has a bed(s) for two so you will be sharing with someone. This is the boat we will be on: This Trip is from November 20th (Friday) to November 29th (Sunday) For Thanksgiving I will purchased an actual Turkey for everyone (we will have to figure out how to cook it)!! There is an oven on the boat.? Friends are more than welcome, I just need their contact info or have them pay through this website! Please be aware that space for this trip is limited so sign up ASAP! These trips are non-refundable but there is trip insurence for an extra ~$100.00 (details are in documents for trip insurence). - Fly out on November 20th (Friday) or earlier. We need you to be there a day early to make sure you are there that Saturday on time to board the Yacht. Sometimes flights are cheaper earlier in the week anyway. Remember that the flights may have a layover so double check that your arival time is before Saturday!! - Arrive on Yacht at Noon November 21st (Saturday). Please try not to be late. - Fly out on November 29th (Sunday). Monday might be cheaper. Fly back home. You will fly into the islands a day early (Friday) and stay in a hotel before the trip. You will have to book a hotel for one night before and after the sailing. You can also get in touch with people on this trip and find out where they will be staying and maybe share a room if you want to do that. Some of you will probably be flying into the American Virgin Islands and then crossing on a Ferry over to the British Virgin Islands. This can be done but is a long trek. The following day (Saturday) you will have to meet us at the dock AT NOON (try not to be late but if you are we will just have to keel haul you, no big deal!!! ;-) ). The location is Tortola, Hodges Creek Marina, at Maya Cove. Once we have all of our last minute provisions we will jump on the boat the following day Saturday and sleep on the boat there in the dock. Don't worry you will not be left behind! Smile emoticon! We have to sleep on the boat the first night at that dock because the following day is a 6-7 hour sail to our first Island! Most of this trip will be spent relaxing and ancored near beautiful islands and hot spots. Most sailing will be when we are traveling between islands during the day but there maybe some night sailing. We will be making our own decitions as a group on where to go but I will be making the final decitions based on weather, travel distence, and time. You can help to sail the boat and learn something or just sit and relax when we are under way but you maybe asked to take on one or two roles while you are on the Yacht.  ?  This is meant to be an expericne as if you are a boat owner and to experince what it is like to sail in the tropical islands with friends. Just think of it as camping but on a really nice Yacht! A friend and I both have owned boats of our own and will be doing most of the sailing so you will be safe as long as you follow our rules.? Fly into the Beef Island Airport (airport code EIS) which is our final destination. This airport is very close to the Yacht! Only 15 minute drive, maybe less. Remember, you want to be at the Dream Yacht Charter Marina by Saturday at noon sharp! Address: Tortola, Hodges Creek Marina, at Maya Cove. If other people want to meet and/or talk about sharing hotel rooms please contact me or reply to this email string! If you book a flight back on Sunday, make it later in the day! Seriously, travel time to the airport maybe a long one depending on where you are flying out from! On our sailing return we will arrive on the Saturday morning so you will have a full day to be on land before our flights home on Sunday. *Cost. Per Person: - Total = $2,000.00 US. *All inclusive. Per person. Due on October 15th. If you are interested you need to get me your email and phone number ASAP. The spaces on this trip are going fast!!! If you have any questions please email me at charleswhsu@gmail.com. Thanks! ? ? *F . Everything on the yacht is covered including Food, alcohol, and drinks. The spots are going fast! You will be asked to sign a weiver before the trip and if it is not signed you will not be allowed to come on the trip. If it is not signed and returned to me before October 15th your ticket will be non-refundable.? Charles"
}