{
    "addr": "79 Madison Ave (Between 28th & 29th St) . 79 Madison Ave (Between 28th & 29th St). New York, NY 10016", 
    "title": "Thanksgiving Eve Singles Happy Hour - Ages 35-55", 
    "url": "http://www.eventbrite.com/e/thanksgiving-eve-singles-happy-hour-ages-35-55-tickets-10118509735?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-25T18:30:00-05:00", 
    "endtime": "2016-04-20T22:30:00-04:00", 
    "categories": [
        "Community \\u0026 Culture", 
        "Party or Social Gathering"
    ], 
    "desc": "THIS IS A MULTI-MEETUP GROUP EVENT (ALSO A LOT OF SINGLES FROM OUTSIDE OF MEETUP WILL BE ATTENDING). THE RSVP LIST ON THIS PAGE IS A VERY SMALL PORTION OF ACTUAL ATTENDEES. ? Event runs from 6:30-9:30pm ? ? Join us after work this Thanksgiving Eve and mingle with over 100 mature singles. We realize that online dating can be tedious and all the bars in NYC are packed with 20 somethings. That's why we've created this great event filled with more mature singles. Our events have been called \"The Best Place To Meet Quality Singles In NYC\".  ? So what's a Click event?  Ever find yourself looking across the bar and saying, ?He?s cute, I wonder if he?s single? or ?She seems nice, but maybe she has a boyfriend\". Well, wonder no more! Everyone at a Click event is single and looking to meet someone. At every Click event we set up  fun ice breakers  to get the party going (during which you can win prizes!) You can participate or just relax and  mingle  at your own pace. ?  We get it... You want to meet someone but don't feel like hanging out in bars amongst a bunch of early 20 somethings or wasting time weeding through online dating profiles.  You've been there, done that  and want to find your mature match who is tired of all the childish games and ready for something real.  This event is perfect for you!  Everyone at a Click event is single and looking to meet someone. ? * Over 200 Single Professionals Attending!  * Drink Specials!  *? Icebreaker With Chances To Win Prizes!  * Music At Just The Right Volume For Mingling  * Typically 70% of Attendees Come Alone (30% bring friends)  * Suggested Age Range: Late 30's to 50's"
}