{
    "addr": "53 Washington Square South New York, NY 10012", 
    "title": "Indocumentales: \"Empire of Dreams (1880-1942)\"", 
    "url": "http://www.eventbrite.com/e/indocumentales-empire-of-dreams-1880-1942-registration-19119052601?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-11-23T18:30:00-05:00", 
    "endtime": "2015-11-23T20:30:00-05:00", 
    "desc": "CineCLACS, what moves you?, and Cinema Tropical present Empire of Dreams (1880-1942) of the PBS series Latino Americans.   Widespread immigration to the U.S. from Latin countries begins ? first with a small group from Cuba, then a larger one from Mexico. Both flee chaos and violence in their home country and are attracted by opportunities in the United States. In 1898, the U.S. helps liberate Cuba and Puerto Rico from Spain but then seizes Puerto Rico as its colony. The first Puerto Rican arrivals (now U.S. citizens) establish a network in New York. Juan Salvador Villase?or whose story is told by his son, Victor, flees the violence of the Mexican revolution of 1910, along with his mother and two sisters. We follow Juan Salvador's story; first through a grueling journey and poverty, then as a bootlegger, and finally as a successful businessman along with his wife and children in the United States. During the 1920s, immigration is encouraged with the expanding U.S. economy. Mexicans and Mexican Americans build a thriving community in Los Angeles and look forward to a bright future. But when the economic boom of that 1920s ends with the catastrophic Depression of the thirties, the pendulum swings. Immigrants encouraged to immigrate in the 20s are deported en masse in the 30s. Emilia Castaneda loses her home and her family when she and her father and brother are deported to Mexico, despite the fact that Emilia and her brother are U.S. citizens. Puerto Ricans, also caught in the depths of the Depression, rebel against U.S. rule on the Island, and eventually gain Commonwealth status from the U.S. Government. The film will be followed by a conversation with Juan Gonz?lez who is the co-host of Democracy Now, and 2015 Andr?s Bello Chair in Latin American Cultures and Civilizations at NYU's King Juan Carlos I of Spain Center, and the Executive Director of Legal Initiatives at the Mayor's Office of Immigrant Affairs, Maribel Hernandez Rivera. -"
}