{
    "addr": " 93 Bowery New York, NY 1002", 
    "title": "Immigration Options for International Students - New York", 
    "url": "http://www.eventbrite.com/e/immigration-options-for-international-students-new-york-tickets-19494598870?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-05T15:00:00-05:00", 
    "endtime": "2015-12-05T18:00:00-05:00", 
    "categories": [
        "Other", 
        "Meeting or Networking Event"
    ], 
    "desc": "Meet experienced, knowledgeable and helpful? Immigration Lawyers ?who will explain student options for getting green cards, including a way of getting a Green Card within one year. The immigration attorney will also discuss student visas and? H1Bs ?along with ideas for international students if they lose the H1B Lottery. The attorney is a Mandarin speaker. Complimentary hot green tea and fruits ?will be provided along with free information packets. The presentation will be followed by a? Question and Answer session . Have all of your immigration questions answered! Please forward a link to this page to your friends and ask them to register. They will thank you for it. Seating is limited so you must register to reserve your seat. Program ? Time Title 3:00 pm ? 3:30 pm Presenter Check-in & Students Registration 3:30 pm ? 3:40 pm Opening remarks & Introduction of Speakers and Guests 3:40 pm ? 4:15 pm Presentation on Immigration Options for International Students 4:15 pm ? 4:25 pm One-page form explanation 4:25 pm ? 4:50 pm EB5 opportunity presentation 4:50 pm ? 6:00 pm Q & A Meet the Speakers ? Nien-Tzu Kuo, Partner of TLA Law? Ms. Kuo is a Partner of TLA Law and practices in the areas of?immigration and ?corporate law. She received her Bachelor of Law degree from the ?National ?Taiwan?University?in 2002?and thereafter worked for?Lee & Li?in Taiwan from 2004 to 2007 before receiving her Master of Law degree from Columbia Law School?in New York in 2008. ?Ms. Kuo is admitted to practice law in Taiwan and New York. ?She is a member of the New York State Bar Association. ? Tao Lin,? Managing Partner ? Mr. Lin is the Managing Partner of TLA Law and practices in the areas of U.S. immigration and international transactions. He received his B.A. from the University of California, Los Angeles and a certificate from the Johns Hopkins University-Nanjing University Center. ?He then worked for? the? Perennial Law Office in Taiwan and Lewis D'Amato's Hong Kong Office before receiving his J.D. on a scholarship from the University of Pittsburgh Law School . ?? ? He joined Caesar & Napoli, a New York law firm in 1998 where he was the head of Immigration from 2004 to 2009. He also served as an advisor at the United Nations. ?Licensed to practice law in New York for nearly 20 years, he is?a?co-author of ?A Guide to U.S Immigration & Visas? ,? published by the Law Press, a leading law publisher in China, and is the Managing Attorney for NYU Law School's Chinese-language Pro Bono Program. ?He is also a panel member of the New York City Bar's Immigration Legal Referral Service. ?? ? ? Sid Bhatt,?Managing Director with NMS Capital Group LLC Sid Bhatt is a FINRA Registered Representative with NMS Capital Securities and Managing Director with NMS Capital Group LLC. Sid is also a Partner with the California based National Net Lease Company ? NNNet Advisors, Inc. He is licensed in South Carolina and North Carolina but works on Net Lease deals across US, Canada and Asia. He was awarded the Certified Commercial Investment Member (CCIM) designation in 2010 and he is among an elite group of just 9,000 professionals who hold the CCIM designation across North America and more than 30 countries. ? Cathy Cao, Managing Director of NMS Capital in New York City Cathy Cao has over a decade of professional experience in Corporate Finance, Capital Markets and Strategy with a focus on growth companies as well as private and public market for small to large-market capitalization companies. Cathy Cao currently serves as Managing Director of NMS Capital in New York City. Prior to that, Ms. Cao served as a senior level investment banker with Rodman and Renshaw, and Rockwell Capital where she was involved in mergers and acquisitions and public and private financing. She was also an Executive Financial Officer for Nasdaq listed global company with over $500 M market cap. She began her career on Wall Street at Groton Partners, a New York based private equity merchant bank led by Luis Rinaldini. She later left his position to help launch the investment banking platform at Knight Capital Group, the largest market maker on Nasdaq. Prior to her Wall Street career, Ms. Cao was a strategy and management consultant at Cap Gemini Ernst and Young (Big ?4? consulting), and a senior manager at Parametric Technologies (NASDAQ: PMTC). Ms. Cao received an MBA degree with honors from Columbia Business School. She also earned both a B.A. degree summa cum laude, and an M.S. degree with highest honor from the University of Tennessee at Knoxville. Among her memberships is the New York Society of Securities Analysts. ? Sam Udani, ILW.COM ,? Law publisher ? Mr. Sam Udani is the publisher of ILW.com and Immigration Daily, the largest and oldest online newspaper for immigration law. It is sent out by email each working day to 32,000+ subscribers include 10,000+ attorneys, paralegals, and corporate HR personnel, 10,000+ immigrants, hundreds of people in academia, think tanks and journalists, 1,000+ officials at US Department of Labor, US Department Homeland Security, and other executive branch agencies, dozens of people in courts throughout the country, many members of Congress and their staff in both parties and both Chambers on the Hill."
}