{
    "addr": "420 E. 81st St. Suite #1. Suite #1. New York, NY 10021", 
    "title": "EVOLVE! Live into your Purpose and Facilitate the Evolution of Others!", 
    "url": "https://www.eventbrite.com/e/evolve-live-into-your-purpose-and-facilitate-the-evolution-of-others-tickets-19319661628?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-05T14:00:00-05:00", 
    "endtime": "2015-12-05T17:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Business"
    ], 
    "desc": "JOIN THE EVOLUTIONARY REVOLUTION! \n If you're stuck and not evolving fast enough, it's only too late if you don't start now!! \n \n \n Do you want your life to mean something? \n \n \n Do you want to live up to your full potential? \n \n \n Are you concerned that you won't fulfill on your mission in this lifetime? ? \n \n \n Are you afraid of going to the grave with the song still in you?? \n \n \n Do you feel stuck in some area of your life?? \n \n \n \n This mind-blowing demonstration of Higher Brain Living? is for YOU if you answered \"YES\" to any of those question. ? \n \n Higher Brain Living?is a? breakthrough? in applied neuroscience that provides the? missing link ?in personal growth and development and that causes massive, rapid and sustainable transformation and evolution for human beings. \n \n The missing link is in the physiology of the brain:?100% of all incoming information is first processed by the? lower survival reptilian brain . The lower brain has one job: to keep you SAFE. ?And to the lower brain: \n \n SAMENESS = SAFETY \n \n \n \n How often do you find yourself compelled -- then repelled -- by making any of the following positive changes? \n \n \n starting the career of your dreams \n \n \n starting a new diet \n \n \n starting a workout routine? \n \n \n ending a unsupportive relationship/friendship \n \n \n \n The lower brain is a biological mechanism that will repel you from change. \n \n Higher Brain Living? is the antidote to the resistance of the lower brain. \n \n The  Higher Brain Living?  protocol shifts energy away from the lower brain and into the? higher brain ?-- the part of the brain that is? designed ?to make change! ? \n \n It is the physiological change in the brain that motivates us to evolve, to live into our purpose, and to contribute to others. ?The Higher Brain Living? system gives you strategies for? effortlessly ?implementing any change by making required changes in the brain. \n \n You already have the neurological structure that's designed \n \n to live into your purpose \n to make your dreams come true \n to live up to your potential! \n \n \n You just haven't been using the most evolved part of your brain! ? \n \n And now there is something you can do about it. \n \n Learn to access you higher brain! \n Find your purpose facilitating the evolution of others! \n Make your dreams come true! \n \n Register for this FREE, live demonstration today. ? \n ? \n \n Directions by Train : Take the 4,5,6 to 86th Street and walk to 420 E. 81st Street. Suite #1 \n Parking : \n \n Champion Parking 444 E. 81st St.? \n Quik Park, 401 E. 81st St."
}