{
    "addr": "80 Saint Marks Place. (just west of 1st Ave). New York, NY 10003", 
    "title": "Sam Eaton's The Quantum Eye - Mentalism and Magic Show", 
    "url": "https://www.eventbrite.com/e/sam-eatons-the-quantum-eye-mentalism-and-magic-show-tickets-19462041490?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-05T17:00:00-05:00", 
    "endtime": "2015-12-05T18:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Performance", 
        "Arts"
    ], 
    "desc": "OFFICIAL WEBSITE: ?TheQuantumEye.com \n GENERAL ADMISSION TICKET PRICE: ?$57 \n RESTRICTION: ?May not be visually entertaining for those under 7 years of age. No children under age 5. \n \n THE QUANTUM EYE is Sam Eaton's entertaining and fascinating exploration of mentalism, magic, perception and deception, where extraordinary ability and humor blend with audience participation to make for a unique performance every time. Join Sam on an interactive journey past the limits of possibility in a show that you will never forget. Sam Eaton has been dazzling New York audiences with his magic and mentalism show since 2006. The Quantum Eye has been awarded the world record as the longest-running one-man Off-Broadway magic show in New York. \n \n PRESS CLIPS: \n ?Amazing feats of memory, mental agility and apparent mental telepathy . . . Dazzling! Undeniably impressive!? ? New York Post \n \"Irresistibly enjoyable. Eaton deserves a full house every night.\" ? nytheatre .com \n \"Chillingly weird and so real you might want to have your cardiologist on hand, but still family friendly\" ? New York Press \n ?A smart, fast-paced mental magic show that is suitable for the entire family.? ? The Villager \n ?Sure, David Copperfield can walk through the Great Wall of China? but can he read your mind? Sam Eaton can.? ? Village Voice \n \"The Quantum Eye-Magic Deceptions is a fun filled, yet sophisticated magic show to enjoy in New York City.\" ? Citysearch New York \n ?Great fun for the entire family. Sam Eaton is a consummate showman and a modern day Houdini. I couldn't get enough.? ? Talk show legend Joe Franklin \n \"Sam Eaton was more than a mentalist; this man was a master performer.\" ? uncoolkids .com \n \"A lot of enjoyment to be had in the very engaging The Quantum Eye - it stays in one's mind long after the performance! A smart, fast-paced mental magic show that is suitable for the entire family.\" ? Epoch Times \n \"Mind-bending\" ? Long Island Pulse \"Theatergoers with a taste for the mind-boggling can take an intimate sojourn into the world of illusion\" ? Behind the Scenes: Theatre Blog \n \"If you're looking for entertainment that's off the beaten path, you'll find it here\" ? David Christopher, NewMagicSource.com \n \"Mind Blowing\" ? OnBroadwayNY"
}