{
    "addr": "115 West 18th Street New York, New York 10011", 
    "title": "Success Accelerator 2-Day Intensive Workshop (NEW YORK CITY, NY)", 
    "url": "http://www.eventbrite.com/e/success-accelerator-2-day-intensive-workshop-new-york-city-ny-tickets-19046650043?aff=ebrowse", 
    "location": "New York, United States", 
    "starttime": "2015-12-05T21:00:00-05:00", 
    "endtime": "2015-12-06T17:00:00-05:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Accelerate Your Success is an unforgettable, 2-day immersive workshop designed for both individuals and business owners who are looking to maximize their time and accelerate their performance, results and overall success of their businesses, careers and lives.? LEARN MORE In this 2-day workshop, Talonya will help you master the fundamentals of strategic, business and operations planning through a six point system that is easy to understand and implement into your businesses immediately.?The goal of this system is to help you clearly identify where you are headed while taking inventory of where you are and leveraging what resources you already have. Talonya will explain why this system is so essential for success and break down the potentially overwhelming practice into accessible steps that just make sense. REGISTER NOW You will walk away with a custom-designed plan for your business that you can start to implement immediately. Because the attendance of these workshops is limited, you gain one-on-one instructional support and consulting by one of the country's most passionate and gifted entrepreneurs. And Talonya's approach to teaching through high engagement and storytelling will inspire and entertain you.? $2497  per person? $997 ?per additional team member? 2-Day Intensive Workshop ($2497 value) Success Acceleration Mini-course ($149 value) Success Acceleration Chart ($47 value) 60-minute strategy ($197 value) Success Acceleration Plan Analysis after the event ($497 value)"
}