{
    "addr": "212 East 52nd St. 3rd Floor. New York, NY 10022", 
    "title": "PLS.trio - Late Night at Club Bonafide", 
    "url": "http://www.eventbrite.com/e/plstrio-late-night-at-club-bonafide-tickets-19648289563?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-05T23:00:00-05:00", 
    "endtime": "2015-12-06T02:00:00-05:00", 
    "categories": [
        "Blues \\u0026 Jazz", 
        "Concert or Performance"
    ], 
    "desc": "21+ admitted | Set begins after 11pm |  2 drink minimum for table service PLS.trio - pianist Pier Luigi Salami, bassist Martin D Fowler, and drummer Shawn Crowder - lies somewhere in between Northern European jazz and American contemporary jazz, bringing forth a highly energetic and deeply melodious mixture of modern jazz and electronic elements. Tapping musical sophistication and tech savvy to lead their artistic toolkit, the group's focus on melody carries the listener along on a journey drawn from experiences of blazing through city streets and car horns of the trio?s native New York, all the way to landscapes reminiscent of sunny, mid-western countryside fields. After the release of a self-titled EP in 2011, a European tour in 2012, and other performances around the world, the trio released their debut album East River in February 2015. With influences spanning from minimal and ambient music to hard-pumping dance music and bombastic rock styles, PLS.trio creates a blend which, while defying easy categorization, is compelling, distinctive, and oddly familiar. Highly acclaimed by press and critics, East River fully represents PLS.trio?s aesthetic mission?to redefine non-lyrical music to resonate with and speak to a wide variety of audiences, while preserving the narrative aspect of live improvised music.  \"Given the preponderance of piano trios, it is easier for the format to appear as a commodity than to articulate a point of differentiation. The PLS. trio has not only distinguished themselves but they may be one of the best in this category in many years. Taking a disciplined approach to alternating and blending improvisation and structure, East River is an auspicious and invigorating debut from a trio that has great potential.\" - K. Ackermann; allaboutjazz.com http://www.plstrio.com/"
}