{
    "addr": "TIME WARNER CENTER. 60 COLUMBUS CIRCLE, 10TH FLOOR. New York, NY ", 
    "title": "2016 Equinox High Performance Living Symposium", 
    "url": "http://www.eventbrite.com/e/2016-equinox-high-performance-living-symposium-tickets-18259926933?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Personal health", 
        "Conference"
    ], 
    "desc": "REIMAGINE YOUR APPROACH. REDEFINE PERFORMANCE.  A three-day summit of the brightest minds advancing the fields of Health, Sustainability and Technology as fundamental contributors to high-performance living. This unprecedented meeting of expertise will present interdependent breakthroughs that are leading the health and fitness industry into the future. Attend in person or stream it live through our online portal.     THE LEADERS  ? ?  The combined expertise of more than twenty of today?s most progressive thinkers will reframe a broader scope of influences on our health and performance.     THE INSIGHTS  Rethinking approaches to optimal health, exploring environmental and personal sustainability, and integrating digital technology to drive personal progress.     THE BENEFITS  ? ??  Compelling knowledge from a comprehensive assembly of experts will elevate your approach to personal health, physical performance and ongoing vitality.     THE SCHEDULE ? Healthy breakfast and lunch will be served on Friday and Saturday, with snacks served each day.     THE VENUE  10 ON THE PARK  60 COLUMBUS CIRCLE, NEW YORK, NY     PRESENTATIONS  Live event attendees will choose from four presentations each hour; seat availability will be first-come, first-served. Virtual attendees can choose from the feature presentations streaming live online.    Each day will culminate in an interdisciplinary panel discussion moderated by Equinox Vice President of Health and Human Performance. These panels will also be streamed for online attendees. All sales are final. Registration is non-refundable and non-transferable. ***Please note: ACE, ACSM, ISSA, NASM, NCSF, NSCA CEU provision currently being finalized. Stay tuned for details."
}