{
    "addr": "Brooklyn, New York", 
    "title": "Hybrid Minds Us Debut Tour", 
    "url": "http://www.eventbrite.com/e/hybrid-minds-us-debut-tour-tickets-18986490103?aff=ebrowse", 
    "location": "Brooklyn, New York", 
    "starttime": "2015-11-20T22:00:00-05:00", 
    "endtime": "2015-11-21T06:00:00-05:00", 
    "desc": "This November, Drown Productions brings you a liquid drum and bass legend that America will be welcoming for the very first time, ever in history. A US debut tour to finally play their exquisite, masterpiece of an album \"Mountains\", their 2012 EP?s ?Hybrid Minds? & ?Heartfelt?, along with a newly dropped EP \"Lifted\". Hybrid Minds [Spearhead, AudioPorn UK] is flying here for a US debut tour, it is their FIRST time here in the states. Thankfully Drown Productions has, over the last year, displayed wholehearted determination, stayed persistent, and created this reality with Cyber Groove Agency. A small four date tour has been created around our booking, leading to Hybrid Minds obtaining their visas. Two weekends?in November, being the 20th, 21st, 27th, and 28th get to see this liquid drum and bass phenomenon. First stop, where else other than NYC!!! Joining forces only four years ago, they've since grown into one of the top liquid drum and bass artists in the world today. Matt & Josh aka Hybrid Minds have taken the scene by storm with their unique brand of elegant uplifting Drum & Bass with their debut album Mountains becoming an instantaneous success back in December 2013. The duo also just released their Lifted EP earlier this year.? You're cordially invited to a multi-genre event made up of deep house, dubstep, jungle, jump up, liquid dnb, and hip hop. Punctiliously put together for a night you definitely will not forget. So, come join us in Brooklyn at The Kymberle Project. A full bar will be open to those of age. The The Tsunami Bass Experience ~??????~ crew will properly provide the sound, coming fully locked and loaded with their own very unique, top quality sound system. That being said, it features a hand crafted, custom built Danely designed subwoofers called LABHORNS. They deliver an incomparable kinesthetic experience when engineered properly. Tsunami Bass Sound System has spent years building and growing their system and its culture to provide the finest in bass culture appreciation facilitation. Prepare your ears to be undeniably delivered the finest tunes to leave you drowning you in bass. .:: Line Up ::. Hybrid Minds (Spearhead, Audio Porn UK) Liquid DNB Comprising of Josh White & Matt Lowe, Hybrid Minds represent a new musical force with their melodic, soulful Drum and Bass already making waves. A synergy between influences including trip-hop, acoustic, soul and DnB, Hybrid Minds draw on a myriad of influences to produce the smooth sound they are now known for. Although an innovative force in Liquid Drum and Bass, Matt & Josh are no strangers to bass music & had ran a record label together for many years which focused on the more dancefloor orientated side of the genre. However, after drifting towards the more melodic side of Drum and Bass, They decided to use their talent to make some smoother collaborations. After only a few joint efforts, Hybrid Minds immediately shot to the forefront of the Liquid scene, with many household names playing tracks from the newly formed duo. Their method of bouncing ideas off each other in the studio yielded immediate results with one of their first tracks ?The Place?, becoming one of the biggest tracks of 2011. This track features some of the elements that now make up Hybrid Minds? distinctive, soulful sound.? Since then, this fresh new two piece have gone from strength to strength, with their smooth, melodic brand of Liquid gaining them releases on some of the most respected labels on the scene. After huge hits including the stunning Lost EP on Audioporn which received over half a million views on UKF, the follow up Heartfelt EP on Austrian label Mainframe, a remix for Jakwob?s ?Blinding? and a string of singles on Spearhead, Allsorts and Fokuz, Hybrid Minds have become synonymous with the best Liquid DnB.Comprising of Josh White & Matt Lowe, Hybrid Minds represent a new musical force with their melodic, soulful Drum and Bass already making waves. A synergy between influences including trip-hop, acoustic, soul and DnB, Hybrid Minds draw on a myriad of influences to produce the smooth sound they are now known for.? DJ ODI (Digital Konfusion, Konkrete Jungle NYC) Jungle Bronx-born Carlos ?Odi? Castillo is not only one of the most highly-respected DJs in the stateside jungle scene, but in great part responsible for its stylistic evolution in NYC. He got his big break after high school, when promoting for the famous mid-90?s NASA rave parties grew into a steady DJing slot. Back then, the 90?s electronica wave was called ?breaks? or ?techno,? until Odi and some childhood friends who shared a lifestyle, culture and musical interest began pumping out electronic records with their own signature twist. Having grown up on 125th street in Harlem, Odi began to introduce the hip hop elements that helped create and push the jungle sound. It has been the defining style of NYC and the east coast in general since 1997, when the Digital Konfusion crew formed their own eponymous record label and began spinning at NYC?s most dedicated weekly jungle party: Konkrete Jungle. Eventually Odi caught the ears of TC IZLAM, the international spokesman for the respected Hip Hop society Zulu Nation. He was initiated in 2003, making him the first junglist to enter the organization. Odi and his record label have remained prolific ever since, DJing across the nation and producing for multiple other artists. Odi?s home base is now in North Carolina where he owns and runs a recording studio. JOE NICE ( DataSetClothing, SUB FM, GourmetBeats, True Soldiers Productions, DubWar NYC) HEAVY BASS Joe Nice is known the world over not just as one of the most genuine artists in the scene but also one of the most talented and dubplate filled DJs on the circuit. Representing Baltimore, Joe Nice is universally recognized as the ambassador of the dubstep sound in North America and has been instrumental in the growth and success of dubstep for over a decade. In other words, he?s been playing dubstep before it was called dubstep. He is North America's first and most respected dubstep DJ. You can never be completely sure what you're in for when you see Subset perform -- even he isn't too certain what to expect. Honing his craft over the past four years in the demanding and eclectic New York City scene, Subset has soaked up the variety of music NYC has to offer and developed his unique sound by finding ways to weave all of these loose threads together. From his weekly bass music party at Webster Hall (BASSment Saturdays) to festivals and clubs across the country and around the globe, Subset knows just what to play to set the perfect tone. Ill Aliens [Nicky Twist & DJ Mash] (BP2 NYC) Drum & Bass Nicky Twist Stoilas An avid turntablist, best known as a trend-setter and pioneer of Electro House in the NYC area, Nicky Twist began his journey in the late 1990?s touring up and down the East Coast, including a tour in 2002 across Canada. He has played almost every major club in NYC including the infamous Limelight, The Tunnel, Exit and many more. At this point, Twist has the credentials of being a producer and is putting out tracks with various major labels, both domestically and internationally. He has releases on Wonked Music, Peakhour Music, Plasmapool Records from Germany, Groove Therapy Records, and also has releases on his own label Bass Monster Music.Nicky Twist has also recorder music with Rob Gee, Sid from the band Slipknot and different members of Biohazard. Now venturing into his secret love for Drum and Bass, he has shown he is ready to be a dominant force in the DNB scene. Be on the lookout for future Drum and Bass releases from Nicky. DJ Mash BP?'s representative from Argentina DJ Mash aka Mush most known for his events in Cordoba. The most important of them is the creation of a cycle of Drum and Bass with Galactic concept called NEBULA which was the forerunner of this style in Cordoba Capital which is experiencing its fourth year , at various locations in Argentina, Chile and Bolivia As an artist he is characterized by djs sets which contain a variety of musical styles , applying smooth mixing techniques and clean thought out scratching . In 2007 he won first place in the Argentina scratch championship. His musical productions connects several branches in the down-tempo, 90 bmps and drum and bass that can be heard on soundcloud . Another project is Ka - Blam , cycle Glitch Hop, Grime and Dubstep. He has DJ'd for various bands and cabin with Latin American djs representatives of bass music and other important such as: Noisia, Black Sun Empire, The Upbeats, Gridlok, Wilkinson, Ak 1200, Odi, Shiftee, Shortee, Zardonic, Dj Rome, Dj Sebas, Headhunters and more. Miztah Lex ( Dub Chambers Records, Monstamind Boston) Drum & Bass One of the masterminds behind Elemental Compounds, Miztah Lex's track record goes on for miles. Not only has he played every major Drum & Bass night in the cities of Boston and LA (a huge accomplishment) but is one of the few Boston DnB DJ's who is frequently playing raves and clubs, & hip-hop reggae dnb jungle & ragga events all over the country. He has been making a huge impact on audiences nation-wide since 1998 starting in Boston, (graduating the school of hard knocks) then navigating through-out New-England, onto New York City and since then it's been history. Playing in places like Chicago, The Bay Area, San Diego, Florida, Utah, Los Angeles, Upstate NY, LBC, Maine, CT, NH, RI, MA, Orange County Washington DC, Baltimore, Miami and beyond!! Armed with a crate full of all the hottest Jungle/DnB/DubStep tunes & sets that include hard to find jams and Hip-Hop classics, his Hip-Hop background comes through in his rugged mixing style.? 2004-08 saw the rise of C&E RECORDS & ETC Recs which merged with Dub Chamber Records in 2010 to form Sub Chamber Records USA! I moved home from West Coast and now back on the Effect The Cause Records tings and Cause and Effect Records for the jungle. Spliffolian (? ?Boston) Dubstep I wouldn't miss this for the world. With NYC being the one and only east coast city they'll be playing, I would strong advise any fan to save the date, take off work, and plan your way to the Kymberle Project the night of November 20th. After these two weekends in the US, they will be back off to so many other parts of this world. Who knows when they will return back for the states? This event is going to be a deeply, heartfelt, soul awakening memory for all attending, and involved in this US debut tour. ?Our sound has moved on in some ways, we?re always trying to better ourselves without straying too far away from what we?re known for, we like to evolve ourselves rather than completely change. We?ve given this album our blood, sweat & tears, hopefully that will come through to the listeners.? - Matt of Hybrid Minds"
}