{
    "addr": "686 Park Avenue New York, NY 10021", 
    "title": "Italian Playwrights Project - discussion panel", 
    "url": "http://www.eventbrite.com/e/italian-playwrights-project-discussion-panel-tickets-19757511248?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-07T12:00:00-05:00", 
    "endtime": "2015-12-07T13:30:00-05:00", 
    "categories": [
        "Theatre", 
        "Conference"
    ], 
    "desc": "THE 2015/16  ITALIAN PLAYWRIGHTS PROJECT   MONDAY, DECEMBER 7, 2015 A day dedicated to new Italian plays and European theatre in New York in the new millennium. (NEW YORK, November 12, 2015) ? The Martin E. Segal Theatre Center, in collaboration with Italian Artistic Director Valeria Orani from 369gradi (Italy) and Umanism (NY), has co-curated a new Italian translation, performance, and publishing initiative. Four plays were selected from a pool of recent winners of some of the most prestigious playwriting awards in Italy, including The Ubu Award, The Riccione Award, and The Hystrio Award.  Supported by the Italian Cultural Institute of New York. Opening Day of 2015/16  Italian Playwrights Project An entire day dedicated to new Italian plays and European theatre in New York in the new millennium. Partner of the project is the Italian Institute of Culture of New York. AFTERNOON EVENT: 12:00 pm, December 7, 2015: Presenting European Theatre in New York in the New Millennium Roundtable at Istituto Italiano di Cultura, 686 Park Avenue, NYC 10065 ROUND-TABLE with producers, artistic directors and playwrights  with Giorgio Van Straten, Director of the Italian Cultural Institute NY; moderated by journalist Graziano Graziani, --? EVENING EVENT: 6:30 pm, December 7, 2015:   Featuring excerpted readings:    Ce Ne Andiamo per non darvi altre preoccupazioni  ( We'll be off, to spare you further worry ) by Daria Deflorian & Antonio Tagliarini. Translated by Janice Capuana;    Il Guaritore (The Healer)  by Michele Santeramo.   Translated by Ana Candida De Carvalho Carneiro and Raquel Almazan;    I Vicini? (The Neighbors)  by Fausto Paravidino.   Translated by Jane House    Origine Del Mondo (The Origin of the World)  by Lucia Calamaro. Translated by Jane House.   All playwrights, except Michele Santeramo and Daria Deflorian, will be present. more about the project  www.umanism.com"
}