{
    "addr": "25 Broadway. 9th floor, room 9H. New York, NY 10004", 
    "title": "Build Great Teams with the McCarthy Core Protocols: A Pay-What-You-Can Course", 
    "url": "http://www.eventbrite.com/e/build-great-teams-with-the-mccarthy-core-protocols-a-pay-what-you-can-course-tickets-19700338242?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-07T13:00:00-05:00", 
    "endtime": "2015-12-07T16:30:00-05:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Seminar or Talk"
    ], 
    "desc": "What?does that mean? That means your work team? can ?get 10x more done, do it with 10x more quality, 10x faster, or with 10x less resources.? In other words,? you ? can ?be  great . Your team? can ?be  great . Want to live in greatness? This workshop is your guide. The Core Protocols show?you?how to discover and obtain?what?you?want, on your own, with your friends and family, and with the people?you?work with. Follow these easy recipes to understand and articulate your personal alignment, to connect and align with others, to share vision together, and to make the abundant goodness of the universe yours.? The Core Protocols are the work of Jim and Michele McCarthy. Over the last 20 years, the McCarthys studied hundreds of teams and thousands of students in a laboratory setting, giving each team a work assignment and deadline of one week to deliver a great product. The McCarthys observed the teams and factored out their success patterns. They encoded these success patterns--behavior patterns of successful teams?as 11 repeatable ?protocols,\" easy recipes that we? can ?all follow, so we and our teams? can ?reproducibly deliver great products on time every time. This 30 second video summarizes the experience. Facilitator : Richard Kasperowski, author of? The Core Protocols: A Guide to Greatness Cost of this course: Total: $665 Estimated number of paid tickets: 7 Cost per paid ticket: $95 All Pay-What-You-Can courses have the option to pay $0. You may pay for the costs of the course ($95) or you can pay $0. Note: To keep costs low, no refreshments will be provided. Consider bringing a water bottle and snack. Questions? Contact Richard Kasperowski at 617-466-9754 or r@kasperowski.com (Location: near 150 Broadway, New York, NY 10038. Exact location TBD.)"
}