{
    "addr": "394 Broadway New York, NY 10013", 
    "title": "Slow Down to Start UP: Mindful Business in a 2.0 World", 
    "url": "http://www.eventbrite.com/e/slow-down-to-start-up-mindful-business-in-a-20-world-tickets-19177905632?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-07T16:00:00-05:00", 
    "endtime": "2015-12-07T18:00:00-05:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Even in today's constant state of  Volatility, Uncertainty, Complexity and Ambiguity , it's still possible to make mindful business decisions -- when you have the right tools and support.  Why nor?take?a moment to reflect on your priorities and progress -- before forging ahead to the next task on your to-do list? As a Social Impact?Innovator / Entrepreneur, you have the unique opportunity to create a transformative organization / business that addresses key issues facing our world. ?Join fellow innovators on Monday, Dec. 7 at 4:00 pm  to?learn practical ways to incorporate mindful and sustainable?business practices, so you can?achieve greater social impact and improved collective well-being.?In large- and small-group discussions and activities, you will examine your startup /?idea / business?in 4 critical areas:  When your WHY is BIG enough, you will find your HOW. Colette Ellis  is an author, coach and transformational speaker on mindfulness, motivation, and workplace stress. She is contributing author to? Transform Your Life With One Call: America's Top Life Coaches Reveal What You Need to Know ?in which she shares the benefits of executive coaching and debunks common coaching myths. Her book  Focus on Your Vision  helps readers clarify priorities and optimize their work-life balance.  As founder of  InStep Consulting , Colette has traveled the globe facilitating professional training for innovators from countries including Australia, Botswana, Bulgaria, Chile, Lithuania, Mexico, Poland, and Vietnam. Clients transform their lives and realize results faster via her insightful coaching and interactive seminars on wellness, leadership, and sustainability. On behalf of her firm, Colette is participating in the  Best for NYC ?Challenge , a city-wide campaign to equip businesses to measure and improve their impact on workers, community, and the environment.  Colette coordinated the second  Lean Startup Machine  bootcamp workshop for entrepreneurs and innovators in Sydney, Australia. Colette is a certified instructor of 7 Habits of Highly Effective People?, FOCUS: Achieving Your Highest Priorities, and Coping with Work & Family Stress?. As a co-host for  Brooklyn Savvy TV , she facilitates substantive conversations about issues that impact women in Brooklyn and beyond. A featured  eHow.com  contributor on Workplace Morale, her tips and advice also have appeared in  Real Simple  Magazine  and online at  Small Business Chronicle  and CBSNews.com. Impact Bazaar  is a marketplace at Impact Hub NYC where innovators and entrepreneurs can access and offer premium resources to accelerate their ideas?and impact.?One space bringing together the best organizations supporting the impact innovation ecosystem and the community of innovators working in New York City."
}