{
    "addr": "11 Times Square New York, NY 10019", 
    "title": "Info Session: 8 Week Game Development Courses", 
    "url": "http://www.eventbrite.com/e/info-session-8-week-game-development-courses-tickets-19473816710?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-02T18:00:00-05:00", 
    "endtime": "2015-12-02T21:00:00-05:00", 
    "desc": "crafts extraordinary games while pioneering new trends. Mixing brave new ideas with hyper polished appeal, Kurt produces mainstream experiences that consistently push boundaries. He is the founder and CEO of Simple Machine, a game studio responsible for creating the gorgeous hits Smove, Circadia, LEX, Hoots and the experimental narrative project The Outcast. His latest game, Pop the Lock, reached #1 among all free apps on iOS in the United States, a position it held for a full week. He was selected to participate in the Starbucks App of the Week campaign, has presented at GDC?s Experimental Gameplay Workshop, was awarded Best Spectacle at the Come Out & Play festival, and has been nominated by the IGF for Best Mobile. He is located in NYC and is a graduate of Parsons MFA Desgin and Technology program.  is an all-in-one game designer. He is SnowHydra Games, and is set on releasing Zarvot, which was selected as part of the Pax 10, for Wii U and Xbox One. He is incredibly diverse and has touched every part of interactive software development, from 3D modeling and sprite art to backbone programming. With ample experience teaching middle school kids basic game design and coding at NYC public schools, Sam is able to convey his talents and experience in an easily digestible and encouraging format.  has wide array of experience designing games having worked on everything from card games to live-action games for hundreds of players to educational games for engineering classes to 30-player local multiplayer games. He works as the Director of Platform and Game Development at the ESC Game Theater, a new local multiplayer game platform, and founded The Completely Surrounded, a consulting firm devoted to creating big games for all people. He serves as a long-standing Come Out & Play Festival organizer, an annual festival of street games, and helped start the family-friendly track of the event. He also teaches coding and game design to kids, runs Local Folks Multiplayer, and occasionally sleeps."
}