{
    "addr": "227 East 24th Street New York, NY 10010", 
    "title": "Circling Labs with The Connection Movement", 
    "url": "http://www.eventbrite.com/e/circling-labs-with-the-connection-movement-tickets-19198902434?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-07T19:30:00-05:00", 
    "endtime": "2015-12-07T21:30:00-05:00", 
    "categories": [], 
    "desc": "Wake up to whole new relational spaces and touch into parts of yourself that bring a deep nourishment and inspiration. REGISTER: https://circling.eventbrite.com/ The evening will begin promptly at 7:30 pm and end at 9:30 pm. ?On specific nights, beginners are invited to join us at 6:30 pm for an introductory session. ?See the weekly schedule at the bottom of this invitation. Please be punctual and check-in prior to 7:30 pm in order to support the flow of the evening. Late arrivers may need to wait until the second circle to join if the first circle has already begun. Each Community Circling Practice Night will be facilitated by a trained Circling Facilitator. Participation is limited  Registering guarantees your spot NOTE: if you are new to Circling you must attend an intro session before participating in a Circling Lab. Intro sessions are offered one Monday each month from 6:30-7:20 and the last Monday of each month at our Community Circling Nights during the 7:30-10:30 pm event Upcoming dates are listed below! What?s it like to experience Circling? http://www.youtube.com/watch?v=KmIhCf06Osg What are the benefits of Circling? Circling is a fresh way to develop presence and richer connections with those around you. It can provide fundamental and often unseen insights that, once seen, create new and exciting opportunities. It provides a doorway into flow experiences and breathes life into sometimes vague spiritual concepts and ideas. Through Circling individuals can start to develop trust in a deeper intelligence in themselves and others. Part of what makes it special is that, although it is based on complex ideas, it is simple and empowering to take part in. We believe it to be one of the richest tools for human development in the world today because it works on so many levels. What is Circling? Circling is a practice where the attention of a small group is skillfully focused on an individual. This person gets to feel the impact of being supportively seen by others while also experiencing their honest in the moment feelings. The process revolves around connection, understanding and a deep authenticity between people. It involves bringing a greater awareness and appreciation into our connections with others and can be considered a relational meditation because of this. It is a paradigm-shifting practice that is supported by wide ranging research in how adults learn and develop. For more about information about Circling visit AuthenticWorld.com or www.circlingeurope.com In order to secure a spot, you must pay in advance on Eventbrite. $20 per session or $55 for 3-sessions in one month or?$70 ?for 4 sessions in one month ?NOTE: ?Monthly passes ?a) do not include Community Night and b) do not roll over to the following month https://circling.eventbrite.com/ Walk-in registrations may be accepted if seats are available. Walk-in registrations: $25 Questions about Circling and Authentic Relating NYC? Contact Amy at authenticrelatingnyc@gmail.com LOCATION: Reflections Center for Conscious Living 227 E 24th Street (between 3rd and 2nd) NY, NY 10010  ? October 26: ?COMMUNITY CIRCLING NIGHT - ?Beginners and Experienced Circlers ?7:30-10:30 ? ?? ?Be sure to join us for the large Community Circling Night where our community comes together for a robust night of circling with multiple facilitators and amazing group presence exercises. These nights include intro for newcomers. Register here: https://communitycircling.eventbrite.com/ November 2 : ?Beginners 6:30-9:30, ?Experienced Circlers 7:30-9:30 November 9:???? Experienced Circlers Only ?7:30 pm November 16: ? ? Beginners 6:30-9:30, ?Experienced Circlers 7:30-9:30 November 23: ? ?Experienced Circlers Only ? 7 pm November 30: ? ?COMMUNITY CIRCLING NIGHT - ?Beginners and Experienced Circlers ? 7:30 to 10:30 ?? Be sure to join us for the large Community Circling Night where our community comes together for a robust night of circling with multiple facilitators and amazing group presence exercises. These nights include intro for newcomers. Register here: https://communitycircling.eventbrite.com/ -------"
}