{
    "addr": "65 East 89th Street New York, NY 10128", 
    "title": "Dec 7 CHADD Presents Ms. Bonnie Schinagle: Harnessing the Power of the Law", 
    "url": "https://www.eventbrite.com/e/dec-7-chadd-presents-ms-bonnie-schinagle-harnessing-the-power-of-the-law-tickets-19575788711?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-07T18:00:00-05:00", 
    "endtime": "2015-12-07T19:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Family & Education"
    ], 
    "desc": "CHADD of New York is proud to present : \n Harnessing the Power of the Law \n Presented by Bonnie Spiro Schinagle, Esq., Special Education Attorney \n Monday, December 7, 2015 \n Parents of children with learning differences or other special needs are confronted by a barrage of foreign terminology. Effective advocacy is difficult when you don?t have familiarity with the laws and the necessary basic vocabulary to protect you or your child. This presentation will teach you what you need to know about the legal rights and protections available to school-aged children with learning differences or other special needs. Empowered with the knowledge of basic terminology, you will be able to harness the power of the law for you and for your child. \n In this presentation, you will learn: \n \n ?Key legal terms \n ?How to communicate with your school and with your district ? even if your child attends private school \n ?How to lay the framework for a private school tuition reimbursement claim. \n \n Join us for an exciting evening where you will learn about your legal rights and those of your school-aged child. \n Bonnie Spiro Schinagle, Esq.? earned her law degree at Benjamin N. Cardozo School of Law and spent many years litigating in state and federal courts.? Like you, Bonnie is a parent who found herself perplexed when negotiating the special education maze. ?Bonnie earned a post-doctoral degree at Cardozo, focusing on the laws protecting non-typical children in school. Her articles have appeared in scholarly journals, and her scholarship has been recognized by noted national authorities in the field. Bonnie represents and guides families in the New York metropolitan area. She is admitted to the bar in New York and Connecticut. \n Target audience :? Parents of school aged children with learning differences or special needs. \n Date & Time : December 7, 2015 5:55PM? (Doors close soon after) to 7:30PM \n Where :? 65 East 89th Street, Manhattan?? (The Parish Office of St Thomas More, between Madison and Park Avenues) \n Meetings are free, with a $10 donation requested. Please leave the kids at home. No food, please."
}