{
    "addr": "300 W 44th St. New York, New York 10036", 
    "title": "Debtwire Emerging Markets Investors Summit", 
    "url": "http://www.eventbrite.com/e/debtwire-emerging-markets-investors-summit-tickets-18726730154?aff=ebrowse", 
    "location": "New York, United States", 
    "starttime": "2015-12-08T08:30:00-05:00", 
    "endtime": "2015-12-08T18:30:00-05:00", 
    "categories": [], 
    "desc": "As the emerging markets (EM) landscape continues to evolve, opportunities and challenges are plentiful for investors and advisors alike as they navigate a diverse range of regional and strategic distressed investment options. Against this backdrop  Debtwire  will host an inaugural forum in New York on the origination and investment in global EM corporate credit. Agenda 8:30  Registration and coffee 9:00  Welcome 9:10  Keynote address? by the  Honorable Kevin J. Carey , United States Bankruptcy Judge, District of Delaware 9:30  Emerging Markets: A look back at 2015 and ahead to the opportunities in 2016 As the EM landscape continues to evolve, opportunities and challenges are plentiful for investors and advisors alike as they navigate a diverse range of regional and strategic distressed investment options. This panel of market experts will debate and discuss the outlook for fixed income investment across emerging markets as well as review performance over the past year. 10:30  Coffee break 11:00  CEEMEA Spotlight: The impact of commodities in Russia & Ukraine As commodity prices weaken, our panelists will debate the key correlating issues facing debtors as well as the wider macroeconomic impact across Ukraine and Russia. 12:15  Lunch and networking 1:30  Afternoon keynote  by? Stephen Foster , Partner and Global Head of Restructuring & Insolvency, Hogan Lovells 2:00  Latin America Latin America has experienced much economic turbulence over the past couple of years. This panel will discuss the region?s standing as a target for EM investment and the key issues facing investors and market participants. 3:00  Coffee break 3:30  Asia-Pacific Amid structural adjustments in China, a fall in commodity prices, and plunge in local currencies, companies in the Asia-Pacific region are increasingly under stress. Our panelists will share their insight on the peculiarities, challenges and opportunities faced by investors in the region. 4:30  Closing remarks 4:45  Post-event cocktail reception and networking 6:30  Event concludes View the event page View all upcoming events ? Lead strategic partner: Strategic parther: Media partners:"
}