{
    "addr": "330 7th Avenue New York, NY 10001", 
    "title": "Pet Business Consultation & Intensive Day!", 
    "url": "http://www.eventbrite.com/e/pet-business-consultation-intensive-day-tickets-19361920024?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T09:00:00-05:00", 
    "endtime": "2015-12-08T14:00:00-05:00", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Are you a pet product manufacturer or pet business owner ready to take your business to the next level?? Are you a solo-petrepreneur in the pet industry needing some insights and guidance for your business? Join Nancy Hassel, Founder and President of American Pet Professionals, and Dana Humphrey, Founder and President of Whitegate PR, Inc., for a one-day in-depth Pet Business Intensive Course in New York City to inspire, strategize and prepare you and your business for a more profitable and successful 2016 Tuesday, December 8th, 2015 9:00am ? 2:00pm? National Opera Center? 330 7th Ave New York City, NY  10001  ? 2 short blocks from Penn Station ? Price $697 per person ($50 off for American Pet Professionals Members)? **Very Limited seating as this is an intensive course for only those serious about growing their pet business!? RSVP Today to get your spot. ?No refunds. When you RSVP you will be sent a 3-part questionnaire before the event to fill out and bring with you. ? Schedule:? 9:00 - 9:30AM: Coffee and Welcome? 9:30 - 10:30AM: How To Be Your Own Best Brand Ambassador? Topics covered will include: How to talk to customer and Sell your products & services, Highlighting marketing distinctions, ?You? as your own brand, Don't be Shy/Taking it Personal? 10:30-11:30AM: Overcoming Business Pain Points? Topics covered include: Review your 3-part questionnaire 11:30-12:30PM: Media Training? 12:30-1:15PM: Networking and Lunch (catered lunch provided)? 1:15-2:00PM: 4-Week Action Plan/Homework Assignment & Wrap Up? Additional Takeaways and Value for Attendees:"
}