{
    "addr": "Corner of Sixth Avenue & Spring Street (God's Love We Deliver Soho Headquarters). Conference Room on Fifth Floor. New York, NY 10013", 
    "title": "Presenting With Power", 
    "url": "http://www.eventbrite.com/e/presenting-with-power-tickets-19144723383?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T09:00:00-05:00", 
    "endtime": "2015-12-09T09:00:00-05:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Presenting With Power In today?s business environment one meeting can make the difference between success and failure. It?s crucial to make your presentation as concise, compelling and entertaining as possible. While your audience may love your product or service, they?ll also be evaluating you on leadership, confidence and your ability to field tough questions on the fly. How you communicate is crucial to  passing these tests. This fun and challenging immersive workshop takes place in 2 four-hour sessions over 2 consecutive days, beginning at 9 a.m. and ending at 1 p.m. Participants master techniques enabling them to: ? Testimonials ?Amazing! I delivered my presentation in front of 450 people. It changed a public company?s global strategy, and my company was offered a huge strategic investment. ?You killed it? was my favorite response.? Chris Bruce, CEO | Sproutling \"Joe Dolce Communications trained our team to give pitches to investors and other audiences, and we were very pleased with the process. They fit an amazing amount of practice, tips and tricks, and useful feedback into two half days of work. We're extending the training to others in the office.\"  Josh Auerbach, Partner, CFO, Betaworks ?This training was key to helping me gain full confidence in my new position as CEO of Van Cleef & Arpels. I was coached about speaking to the public and to the media in the demanding US market. Joe has the experience, and more importantly, a remarkable capacity to guide and elevate without compromise.? Alain Bernard, CEO, Van Cleef & Arpels ?This workshop was fantastic - an absolute \"must\" for my attorney friends and aspiring politicos! I'm passing the word along.? Megan Morey, Deputy First Assistant Corporation Counsel, City of Jersey City ? ? Workshop Leaders ? Joe Dolce has trained CEOs and their teams in technology, fashion and media ?as well as non-profits. He honed his techniques working at the highest levels of media for 25 years, as Editor-in-Chief of Details and Star magazines; Features Editor at Vogue; Arts Editor at Harper?s Bazaar and a contributing editor at Gourmet and Playboy. He writes for the New York Times, New York magazine, and Departures among many other publications. Cheryl Lambert leads the presentation training and executive development divisions of JDC. She has trained executives at Facebook, Siemens, as well as individuals and groups in the financial, public relations, law, architecture, and public service sectors. Cheryl was Managing Director of Global Operations and Client Services & Enterprise Risk at DTCC, one of the world?s largest and most complex financial institutions for 25 years."
}