{
    "addr": "131 W 72nd Street. #3F. New York, NY 10023", 
    "title": "Music & Movement in Spanish", 
    "url": "http://www.eventbrite.com/e/music-movement-in-spanish-tickets-19666191107?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T10:30:00-05:00", 
    "endtime": "2015-12-15T11:30:00-05:00", 
    "categories": [
        "Children \\u0026 Youth ", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Class Description Music & Movement in Spanish is an experiential learning class with a unique and fun-filled approach to music, designed to combine two different learning experiences into one! Through music games and a wide repertoire of songs in Spanish, my tiny students will learn the basics of music and rhythm, singing and dancing to beautiful kids songs from Latin America. The experience of learning music and language through our bodies is extremely rewarding and powerful, and this class provides a multi-dimensional approach to music learning, which is a great opportunity of stimulating new minds while having fun! Teacher Profile Hi, my name is Jacinta. I am a guitarist, composer, singer and music teacher originally from Argentina, currently working in NYC. I am a graduate of Berklee College of Music, where I studied guitar performance and composition. I've been performing internationally and this year I released my first album of original music, which features a group of 16 musicians from 10 different countries. I am currently taking part in various productions throughout NYC including at Columbia University, the Consulate of Argentina in NYC, and other concerts of original music.?I've also been teaching music to kids for the last 8 years.?I love music, and I love sharing this beautiful experience with children. If you would like your kids to experience music from an early age, while stimulating their minds and learning Spanish, join me on this adventure! **This class is?an adult participation class for kids aged 1.5 to 3.5.?One parent or caregiver can participate with up to two children.**"
}