{
    "addr": "8th Floor Conference Center. 1271 6th Avenue. New York, NY 10020", 
    "title": "SHIFT // 2015 Programmatic Video & TV Advertising Summit", 
    "url": "http://www.eventbrite.com/e/shift-2015-programmatic-video-tv-advertising-summit-tickets-18105684590?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-01T07:30:00-05:00", 
    "endtime": "2015-12-01T18:30:00-05:00", 
    "desc": "SHIFT // 2015 Programmatic Video & TV Advertising Summit is a new one-day conference which will bring together senior industry leaders and influencers who have a stake in programmatic video & TV advertising?s success. SHIFT // 2015 is the  first conference laser-focused on programmatic video & TV advertising , which eMarketer forecasts will account for at least $4 billion of online video ad spending in 2016.  SHIFT // 2015 is proudly presented by VideoNuze, the leading online publication specializing in online video analysis and news. VideoNuze has hosted numerous conferences, with thousands of executive attendees experiencing unparalleled learning and networking. VideoNuze?s 5 th  annual Online Video Advertising Summit, held in NYC in June, 2015, drew over 450 attendees, 55 speakers and 21 sponsors.  The program at SHIFT // 2015 will be developed using best practices from VideoNuze?s prior conferences, thereby promising a top-notch day of learning and networking for attendees. The program will feature a mix of keynotes, panel discussions, research presentations, fireside chat interviews and technology demonstrations, all intended to advance executives? understanding of programmatic video & TV advertising and accelerate its success.  SHIFT // 2015 will be a must attend event for executives at publishers, distributors, agencies, advertisers, trading desks, networks/exchanges, technology providers/platforms, research and investment firms, journalists and anyone else seeking to learn from and connect with this vibrant community. Following are sample topics the SHIFT // 2015 program will cover:"
}