{
    "addr": "11 Times Square. 6th Floor, Radio City. New York, NY 10036", 
    "title": "IIBA NYC Chapter Holiday Networking Event", 
    "url": "http://www.eventbrite.com/e/iiba-nyc-chapter-holiday-networking-event-tickets-19697258029?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T18:00:00-05:00", 
    "endtime": "2015-12-08T20:00:00-05:00", 
    "categories": [
        "Science \\u0026 Technology", 
        "Meeting or Networking Event"
    ], 
    "desc": "When : Tuesday December 9th, 2014 from 6:00PM - 8:00PM. ? Where : Microsoft (11 Times Square, 6th Floor, Radio City) ? You are cordially invited to network with New York City's community of?Business Analysis? professionals and practitioners. Please join us for drinks, food, and a chance to meet ?with chapter members and industry peers. ? ?   Agenda ? 6:00 - 6:30 IIBA members / guests arrive. Welcoming remarks.? ? 6:30 - 8:00 Networking with IIBA members?and guests. ?  We hope to see you there! Cheers, IIBA New York City Chapter B ecome a Chapter Member for only? $25/year? and attend all our events for?FREE!? CHAPTER?MEMBERSHIP INFORMATION Note ? - you have to be an IIBA Member before you can sign up for Chapter Membership IIBA MEMBERSHIP INFORMATION ? ? ? Many thanks to our 2015 Chapter Sponsors: ? ? Silver Sponsor Microsoft Corporation, incorporated in 1981, develops, manufactures, licenses and supports a range of software products for computing devices. The Company?s software products include operating systems for servers, PCs and intelligent devices, server applications for distributed computing environments, information worker productivity applications, business solution applications, high-performance computing applications and software development tools. Microsoft understands the challenges faced by application development teams and continues to make investments to help organizations address these challenges. The Microsoft Visual Studio 2010 suite of solutions can drive value with all the stakeholders on your team, including business analysts, architects, testers, and executive management, allowing these roles to collaborate more effectively to deliver quality software on-time, on-scope, and on-budget . For more information, visit? http://www.microsoft.com/visualstudio/en-us/ . For free webinars and resources, check us? http://www.almcatalyst.com/ . ? Bronze Sponsor As the leader in project solutions and professional talent resourcing for contract and permanent positions, Experis matches professionals to rewarding IT, Finance, and Engineering opportunities with industry-leading organizations ? helping accelerate careers, while delivering better results for our clients. Experis is part of ManpowerGroup, the world leader in innovative workforce solutions.? ? ? Learn more at? Experis.us NYC Office details: 99 Park Ave, Suite 920 New York, NY 10016 212-471-3500 ? ? ? Bronze Sponsor University Support Services, LLC provides general business support services to educational universities. The company was incorporated in 2005 and is based in Great River, New York. University Support Services, LLC operates as a subsidiary of St. George's University. ?Bronze Sponsor ? Sponsorship Levels range from Platinum sponsorship to Event sponsorship. Sponsorship pricing/details are available upon request. For further questions, please contact? info@newyork.iiba.org ? ? CHAPTER INFORMATION: For more information on this or other events visit:? http://newyork.iiba.org/index.php/event/currentevents/eventlist"
}