{
    "addr": "1111 Preakness Avenue Wayne, NJ 07470", 
    "title": "1.16.16 HUMAN TRAFFICKING SUMMIT", 
    "url": "http://www.eventbrite.com/e/11616-human-trafficking-summit-tickets-18768428876?aff=ebrowse", 
    "location": "Wayne, NJ", 
    "starttime": "2016-01-16T08:30:00-05:00", 
    "endtime": "2016-01-16T12:30:00-05:00", 
    "desc": "\"Our GREATEST weapon to combat human trafficking is our citizens.\"--Senator Chiesa (Former NJ AG) The 1.16.16 HT Summit has something for everyone, and some very specific training for certain professions (we are working toward accomplishing accreditation for teaching and medical fields). ??It begins with the FBI HT101 training by Keyla Munoz--FBI Victim Specialist, and ends with the Survivors Speak Out panel of area survivors. ?Each attendee will be able to reserve 2 different breakout panel sessions explained below. ?Each session is repeated. ?Session Descriptions: -It's the Law : will feature experts of our federal and state HT laws (recommended for law enforcement, policy makers, professionals intersecting human trafficking, and the general public). -Community Mobilization & Abolition Advocates : will feature current and emerging abolition mobilization initiatives, and will dually serve as the final step in Abolition Advocates training (recommended for everyone). - Student Abolition Movements : will feature NJ student abolition movements that have impacted NJ, the USA, and the world (recommended for students, parents, teachers, school administrators, youth community leaders, and policy makers). - Student HT Prevention/Detection : this panel explores how ht presents in schools, how traffickers are targeting students in & out of schools, various curricula and awareness models available to schools, and explores how to keep young people safe (recommended for parents, teachers, PTO/PTA, coaches, students, youth community leaders, faith-based leaders, and school administrators). -Abolition in the Marketplace : will explore how consumers can drive market demand for slave-free goods and services, and how the marketplace is being used to bring awareness, prevention, and survivor care support (recommended for everyone). -Healthcare and Survivor Service Providers : will feature experts that can advise healthcare professionals in the techniques and policies for prevention, detection, and rescue of victims of human trafficking. ?This panel will also feature HT survivor service providers with some of the best rates of recovery in the nation (recommended for healthcare professionals, healthcare students, emergent survivor service providers, social workers, students of social work, counselors, counseling students, and professors in applicable fields). -Abolition in the Travel Industry : features intersecting industries of travel and human trafficking. ?Attendees will explore the signs for detection, the tools & procedures for reporting & rescue, and samples of pro-active ways these industries are engaging the issue (recommended for all, but especially for professionals in the hotel, airlines, cab, bus, train, cruise, and trucking industries)."
}