{
    "addr": "520 8th ave . 10th floor. New York, NY 10018", 
    "title": "12/8 Beginner Voice-Over Drop-In Class with Jason Sasportas (Stewart Talent)", 
    "url": "http://www.eventbrite.com/e/128-beginner-voice-over-drop-in-class-with-jason-sasportas-stewart-talent-tickets-19618801363?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T18:30:00-05:00", 
    "endtime": "2015-12-08T21:00:00-05:00", 
    "categories": [
        "Theatre", 
        "Class, Training, or Workshop"
    ], 
    "desc": "NOTE: This is a ?drop in spot to an ongoing, 5-week class. It's a great way to sample the class and see if you want to take the entire course next time. ? Can you think of a more effective way to learn the basics of voice-over than working with a top VO agent in a broadcast-quality VO studio? Neither can we! Class size is limited to 10 students, so you get more individual attention and time in the booth.  This class is intended specifically for beginners interested in learning voice-over technique while acclimating themselves to the voice-over business in NY. ?While the primary focus is on commercial, other areas of voice-over are workshopped, including promo, broadcast narration, audio books, animation and videogames. ?Students should expect to walk away with a strong foundation in this very specialized area of performance. About the Instructor Jason Sasportas ?is head of the voice-over department for Stewart Talent, a premier boutique agency in NY.? He has booked clients on numerous national network commercials including Subway, McDonald?s, Wendy?s, Stouffer?s,? Seroquel, Humira, Abilify, Nicorette, AARP, Liberty Mutual, Charles Schwabb, Walmart, CVS, HBOGo Online, Stouffer?s, Yoplait, Kitchen Aide, Nook & Fructis Garnier.? While commercials are his focus, Jason covers all areas of voice-over.? He has clients working regularly as audio book narrators and has booked talent on documentaries for A&E, National Geographic and The Weather Channel, in addition to various animation and videogame projects. In this class, Jason will walk you through the basics of V/O technique, and nailing your audition in the booth. Students will receive samples of their work every week via email. ? No refunds or credits"
}