{
    "addr": "402 E 8th St New York, NY 10009", 
    "title": "Free Drinks, Fast Science: Meet Your Microbiome", 
    "url": "http://www.eventbrite.com/e/free-drinks-fast-science-meet-your-microbiome-tickets-19728470386?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T18:30:00-05:00", 
    "endtime": "2015-12-08T21:30:00-05:00", 
    "categories": [
        "Science", 
        "Seminar or Talk"
    ], 
    "desc": "Free Drinks, Fast Science Speaker: Professor Martin Blaser 6:30-7  Welcome Reception 7-7:30  Talk by Professor Blaser 7:30-8  Tours of the BioBase Microbes > Human Only 1 in 10 of your cells are human. The vast majority of cells living in and on our bodies are microbial, and this is an ancient story. It is clear that we are living together with these microbes in ways that usually are mutually beneficial. As understanding has grown about our relationship with our microbes, collectively called the  human microbiome , there have been important new insights about their impact on both health and disease.  Join us as Professor Martin Blaser, a leading researcher of our microbiome, discusses how we benefit from sharing our bodies with trillions of microbes. He will also show how we are perturbing the delicate balance of the microbiome with antibiotics, antibacterials in our skin and mouth products, and Cesarean-sections, among other practices ? with consequences we are just beginning to appreciate.  Martin J. Blaser, M.D. , is the Muriel and George Singer Professor of Medicine, Professor of Microbiology, and Director of the Human Microbiome Program at the NYU School of Medicine. ?A physician and microbiologist, Dr. Blaser is interested in understanding the relationships we have with our persistently colonizing bacteria. He served as Chair of the Department of Medicine at NYU, President of the Infectious Diseases Society of America, Chair of the Board of Scientific Counselors of the National Cancer Institute, Chair of the Advisory Board for Clinical Research of the National Institutes of Health, and on the Scientific Advisory Board of the Doris Duke Charitable Foundation. He was elected to the National Academy of Medicine and the American Academy for Arts and Sciences. He holds 25 U.S. patents relating to his research, and has authored over 530 original articles. Recently, he wrote ?Missing Microbes?, a book targeted to general audiences. He now is serving as the Chair of the Presidential Advisory Council for Combating Antibiotic-Resistant Bacteria. JOIN US AFTER THE HAPPY HOUR FOR A HOLIDAY PARTY TO CELEBRATE THE SUCCESS OF BIOBUS AND BIOBASE PROGRAMS THIS YEAR!"
}