{
    "addr": "212 East 52nd St. 3rd Floor. New York, NY 10022", 
    "title": "Hal Galper's Youngbloods Quartet at Club Bonafide", 
    "url": "http://www.eventbrite.com/e/hal-galpers-youngbloods-quartet-at-club-bonafide-tickets-18721368116?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T19:00:00-05:00", 
    "endtime": "2015-12-09T02:00:00-05:00", 
    "categories": [
        "Blues \\u0026 Jazz", 
        "Concert or Performance"
    ], 
    "desc": "Doors at 6:00pm | 21+ admitted | 2 sets starting at 7:30pm 2 drink minimum for table service |? Happy Hour 6pm-7pm http://www.halgalper.com/ For 50 years Hal Galper is been a force on the jazz music scene. He?s toured with and recorded over 100 albums with a who?s who of the music?s greatest luminaries such as Cannonball Adderley, Chet Baker, Phil Woods, Stan Getz, Dizzy Gillespie, including 30 albums under his own name. Since 2006 Hal has been touring with his own trio having recorded a series of six innovative albums for Origin Records in their unique ?Rubato style.? An internationally recognized educator and founding member of the New School of Jazz he recently retired in 2014 from his 14 year stint on the faculty of SUNY Purchase where the Youngblood?s bassist Dean Torrey, drummer David Fazier and alto saxophonist Nathan Bellott came under his tutelage. The great Stan Getz once quoted to Hal \"it is our responsibility to hand down our knowledge and experience to the new generations of musicians.\" Hal started this new quartet with the Youngbloods for that very purpose. Says Hal,\"The Youngbloods Quartet is my attempt to preserve that tradition in the hope that this new generation of musicians can hand it down to their successors.\" Nathan Bellott: Based in Brooklyn, NY, saxophonist, woodwindist, composer and arranger Nathan Bellott was an honors graduate of the New School for Jazz andContemporary Music (2014) in NYC. ? Working with Hal was always a joy and now I have the opportunity to learn the old-school way, as a bandmate. He knows what he wants from the band but at the same time is completely open to suggestion, comment, and input from all of us. I'm having a blast playing with Hal, David and Dean.\" Dean Torrey: Bassist Dean Torrey studied at the University of North Texas for a year before transferring to SUNY Purchase. There, he studied under, Hal Galper and others for three years before graduating cum laude. In August of 2014 Torrey moved to New York, his current home, where he has quickly become an in-demand sideman. \"Playing with Hal, Nathan and David has been a dream come true. Hal was one of my most important musical mentors at school and it's thrilling to move that mentorship out of the academic and into a 'real-time' musical setting. Everybody in the band is one of my favorites to play with, Hal's music is frequently challenging, always rewarding, and I'm really looking forward to seeing how the life of these songs will develop in our hands.\" David Frazier: Brooklyn born Drummer David Frazier graduated from Purchase Conservatory with a Masters of Music degree in 2014. \"As I continue to learn about myself, music, and others, this quartet serves as a catalyst for new beginnings. I enjoyed my time studying with Hal, and greatly appreciate being able to work with him as a band mate. Hal comes from an era that my generation fails to realize is so important in this music, apprenticeship! The opportunity to play the tradition my own way alongside Hal, Nathan, and Dean is a humbling journey.\""
}