{
    "addr": "TBA (Manhattan) New York, New York", 
    "title": "Shake it all off! Active Meditation for Stress Release and Well-Being", 
    "url": "http://www.eventbrite.com/e/shake-it-all-off-active-meditation-for-stress-release-and-well-being-tickets-19413321768?aff=ebrowse", 
    "location": "New York, United States", 
    "starttime": "2015-12-08T19:00:00-05:00", 
    "endtime": "2015-12-08T20:30:00-05:00", 
    "categories": [
        "Personal health", 
        "Class, Training, or Workshop"
    ], 
    "desc": "How often do we take the time to really focus on releasing all the tension and stress that we accummulate in our body? Not very. Instead, we just keep on trucking, hoping it all will magically disappear. But we know that won't be the case unless we do something about it. Enter Osho's powerful?Kundalini meditation, a kind of active meditation specifically designed for modern life that helps us to release stress and unblock our energy. Comprised of 15 minutes of shaking, 15 minutes of dancing, 15 minutes of stillness (sitting or standing), and 15 minutes of silence (shavasana),? this meditation is a really amazing way to shake everything off, get past self-doubts and limiting beliefs. Because it's both invigorating and relaxing, it gets us out of our mind and reminds us of how incredibly good being an embodied being can feel like when we get out of our way. This practice creates a release of pent up emotions, tension and blockages in the body, and it's energizing, uplifting and calming at the same time.? It's often a really amazing way to make room for inspiration because once those doubts are removed, creativity flows like whoa! Join us every other Tuesday as we shake it all off, and leave it on the floor. Shake It All Off! Active Meditation for Tension Release and Well-Being Tuesdays, November 10 and 24, and December 8 and 22 Location TBA (Manhattan) $10 donation NOTE: in order to cover costs, this event requires at least 5 people to be signed up per date 24 hrs prior for it to happen. Please RSVP mindfully so I know what size room to book for us in advance. --------------------------------------------------------------------------------- \"After attending Melody?s ?Shake It Off? and ?Embodiment? workshops, not only was my personal way of relating to my physical, mental, and spiritual enhanced, but it motivated me to seek out entire aspects of the human condition that have supported my growth as a social worker deeply. Prior to working with Melody, I had been enamored with the mind and aspects of intelligence that caused me to completely disconnect from my body; I did not take care of it, and it did not take care of me. I feel so fortunate to have experientially learned with Melody?s guidance, that the body holds many of the keys to inner peace, whether for my self or my clients.\" Abbi K., New York, NY --------------------------------------------------------------------------------- MELODY KIERSZ Melody Kiersz wants you to stop trying to prove yourself worthy and start living the life that makes you happy. Melody holds a degree in Happiness from the prestigious? New York University , is a Certified Holistic Health Counselor graduated from the? Institute for Integrative Nutrition , a member of the? American Association of Drugless Practitioners , and a Certified Yoga Teacher through? Jungle Yoga Ashram . Melody is a deep listener and reads between the lines to guide you in discovering the ways you're holding yourself back from your true expression. She specializes in healing our relationship with our bodies, our selves and others, improving body image and self-esteem, increasing our ability to speak up, share, and allow ourselves to be seen and loved as we are. As the Founder of Naked Wellness, her goal is to guide you as you peel all those layers of resistance so you can turn yourself on for a life full of health, passion, power, freedom, joy and pleasure. Based in New York City, Melody offers in-person and long-distance private sessions, and is really passionate about everyone really getting that they are absolutely perfect exactly as they are. She can be reached at? Melody@NakedWellness.com ."
}