{
    "addr": "209 West 40th Street (gold Chinatex building). 5th Floor. New York, NY 10018", 
    "title": "Tuesday NYC Open Mic @ Funkadelic Studios - Music/Poetry/Comedy/Spoken Word", 
    "url": "http://www.eventbrite.com/e/tuesday-nyc-open-mic-funkadelic-studios-musicpoetrycomedyspoken-word-tickets-18973374875?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T19:00:00-05:00", 
    "endtime": "2015-12-08T23:00:00-05:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Concert or Performance"
    ], 
    "desc": "NYC's hottest open mic @ the very cool Funkadelic Studios smack in the middle of midtown. This is a very popular open mic. We STRONGLY suggest you purchase a ticket in advance to guarantee a performance slot. Make sure to purchase a ticket with your desired time slot window -7:30-8:30pm, 8:30-9:30pm, 9:30-10:30pm, 10:30-11:30pm.? Produced by the long-running Inspired Word open mic series, which has featured Grammy winners, American Idol finalists, Golden Globe Award winners, Emmy nominated actors, and HBO Def Poetry stars, this open mic is open to ALL types of performing artists - comedians, musicians, storytellers, singers, poets, fiction/nonfiction writers, playwrights, spoken word artists, performance artists, dancers. 30 slots, 7-minute time limit for poets, comedians, storytellers, 8 minutes for musicians.? A warm, supportive community of artists. Real crowds. And a great place to network. Full Backline: Yamaha Tour Custom drum kit Marshall JCM 900 Marshall JCM 800 Roland JC120 Fender Twin Reverb Ampeg SVT 350 Bass Amp ? With Hartke 1?15 and 4?10 Cabs PA System Alesis QS 8.1 Fully weighted 88 key keyboard ***** When : Every Tuesday Night Where: ?Funkadelic Studios http://funkadelicstudios.com/ Chinatex Building 209 West 40th Street (corner of 7th Avenue), 5th Floor Manhattan, NYC For any questions about the show, please do NOT call the venue directly, but feel free to call (917) 703-1512. If doors are locked, please press buzzer on side door panel. Doors open @ 7pm. Cover charge : $10 for solo performers or audience members online or @ the door.? EARLY BIRD SPECIAL : $6 for 1 performer or audience member if you purchase your ticket at least 3 days before the event. *Limited Availability/Non-Refundable/Non-Transferable*? You can pay online (to guarantee a slot) or at the door. *Specials for online purchases only* No age limit. ***** By subway, take the A/E/C/B/D/F/M/R/Q/N/1/2/3 to 42nd Street.? ***** Produced by Mike Geffner Presents The Inspired Word http://inspiredwordnyc.com ***** For almost 20 years,? Funkadelic ? Studios NYC ?has been the place for all types and levels of musicians to jam and practice their art. The New York rehearsal?space has seen it all, from a band?s first practice, to major label acts preparing for a European tour! ?Indie-folk, jazz, hip hop, rock, blues, country, electro, you name the genre, it?s been practiced at? Funkadelic."
}