{
    "addr": "18 West 18th Street New York, NY 10011", 
    "title": "Karen Kohler Masterful Performance - Stepping In & Stepping Out Workshops", 
    "url": "http://www.eventbrite.com/e/karen-kohler-masterful-performance-stepping-in-stepping-out-workshops-tickets-18787232117?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T19:30:00-05:00", 
    "endtime": "2015-12-08T21:30:00-05:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Attention Singers, Actors, Comedians, Poets,  and All Who Go Before People! ? Do you want to take greater risks? Learn to trust your voice and instincts?  Master the stage with confidence? Harness the power of your voice?  Tell your story more authentically and  connect more deeply to your material, your audience and yourself?  Come to my class, we can make that happen. ? This fall, award-winning, international cabaret artist Karen Kohler teaches her Masterful Performance series for the professional singer, actor, performance artist and public speaker seeking to access a greater freedom of expression in their stagecraft. In each 2-hour session, you will experience core concepts of the Kohler Method of stagecraft to help you forge a deeper connection to your songs/scripts as well as to yourself.   ? STEPPING IN - Dec 8 In this workshop, you will step inward, bringing your awareness to your body and the interior space in which your art resides.? As you experience inner alignment alongside external feedback, you will learn to trust yourself and empower your expression. We'll explore the following: - Life Drawing  and  the Palette of Selves  will help you draw from your own life experience to find a compelling story, character or event. - With  Characterization & Subtext, Coloring Words  and  Playing Opposites,  you will access a deeper connection to your song and script. - Your understanding of  Carriage and the Silhouette, Body Ease and Gesture  and the  Four Walls of Theater  will help you gain comfort in your body, both in motion and in stillness.  ? STEPPING OUT - Dec 9 In this workshop, you will turn outward,  bringing your many faculties together in service to your art.  We'll explore the following: - Self Direction  and the  Art of Surrender  will permit you to trust your essential voice and your natural instincts to inhabit the stage. - Fear as Fuel  helps you tame the inner critic, take risks and use your nerves as fuel to create powerful auditions and performances. - Your inborn  Faculties of Observation and Empathy  and Karen?s technique of  Tapping the Universals  will show you how you can access the power of connection to bring your audience to you. In addition to group exercises, there will be time for 4 people to present a 3-minute song or monologue for individual coaching. If we have more volunteers than time, we'll choose a representative sample of different performance types to best benefit the class. ? The Stepping In and Stepping Out workshops complement each other to help develop you as a well-rounded performer. We're starting a regular montly series in 2016 so feel free to attend Stepping In now and Stepping Out later, or vice versa. ? ? I learned how to make a song my own. ? Sibyl Offutt, singer (Chicago) I love the way you started the session with everybody working on self body consciousness, the moves, and the postures. With each of the participants I could see you working so closely that at times some broke into tears or burst into laughter. You helped us draw closer to each other. ? Supratik Bhattacharya, public speaker (New Delhi) The best part of working with Karen is her trust and faith in her performers which allowed us to blossom. I would recommend Karen wholeheartedly and without reservation - not just in the field of cabaret, but for any actor/singer who is trying to tell a story and wants to communicate to their utmost abilities. So all I can say is go for it, there is still so much to learn.? ? William Ludwig, actor (London ) ? ? ? ? ? Are there ID requirements or an age limit to enter the event? This class is for adult students with at least some performance experience. ? What can/can't I bring to the event? Please wear comfortable clothing. Please bring a monologue, piece of music, a poem or something that you want to play with and explore. ? Will a pianist be available to accompany me? For those people who will be presenting a piece before the class, a pianist will be available if you wish to be accompanied. If so, you must bring music that is in your key as you will have very limited time to communicate with the pianist. ? What is the refund policy? We're unable to offer refunds because we've reserved the space for you. If you can't attend a class, you can credit the value toward a private coaching session or another workshop. ? Where can I contact the organizer with further questions? Contact our assistant Ayis at Ayis.Duo@gmail.com with questions."
}