{
    "addr": "99 Macdougal Street New York, NY 10012", 
    "title": "NYC Comedy Night with The Tommy Lama", 
    "url": "http://www.eventbrite.com/e/nyc-comedy-night-with-the-tommy-lama-tickets-19506620828?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-08T20:00:00-05:00", 
    "endtime": "2015-12-08T23:00:00-05:00", 
    "categories": [], 
    "desc": "If laughter were the law, Tommy Savitt would throw the book at you. Quitting law school to become a comedian may not be considered the?best career choice, but for Tommy, it was the right one. Born in New?Jersey and raised in Brooklyn, Tommy has survived the school of hard?knocks to craft comedic routines that?leave ? audiences in fits of?laughter (for which he takes no legal responsibility). Tommy is a multi-award winning comedian whose slow and simple delivery?dishes out big laughs on just about any topic - from spiritual?guidance to business advice to stories of his time in the military. A working comedian for over 20 years, he has been seen on WGN?s,?TheBob & Tom Show, SI TV?s,?F unny is Funny, Comcast?s,? Boston ComedyFestival, National Lampoon,? Man Up Stand Up?on? ?MAVTV,? ? and on JLTV?s,?James and Sunda.? ?? As an actor he has many commercial and stage credits, including appearances in commercials for Adidas,?Monster.com, and Lowe?s?,??and starred as Horatio in?Love?s Labours Lost?at the Expanded Arts Theatre in New York City. His CD ?Who Wants Me Now!? is one of the top requested comedic segments on satellite radio.?They recognize me once they hear my voice,?? Savitt says of fans wholisten to his clips several times each week on Sirius/XM?s Blue CollarComedy satellite radio stations. ?Some people are flying or driving from other states to catch my show. I am truly blessed.?Tommy has been recognized in the comedy industry having won the Boston Comedy Festival in 2007 and the Seattle Comedy competition in 2008. He was also honored with Best in Comedy category at the 2009 LA Comedy Awards.?Having a heart as well as a funny bone, Tommy has dedicated much of his time?performing for our troops here and abroad. This has taken him to military bases in Afghanistan, Guantanamo Bay, Japan, South Korea, Bahrain, the United Kingdom, Germany, Belgium, the Netherlands, Curacao, Honduras, and Ecuador. He has even performed at the United States Embassy in Belarus. From blue collar comedy to his newly found ?Tommy Lama? persona, Tommy ?? Savitt is an entertaining and funny comedic act for performances at?events, casinos, festivals, fundraisers, night clubs, colleges,?theaters, and comedy venues across the country. Tommy?s act is clean,?corporate appropriate, and hilarious. His universal style will appeal?to everyone at your club or event."
}