{
    "addr": "135 West 29th Street. #603. New York, NY 10001", 
    "title": "Runners Visualization Workshop: Train Your Mind to Hit Peak Performance", 
    "url": "https://www.eventbrite.com/e/runners-visualization-workshop-train-your-mind-to-hit-peak-performance-tickets-19537409919?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-08T19:30:00-05:00", 
    "endtime": "2015-12-08T20:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Class", 
        "Sports & Fitness"
    ], 
    "desc": "Running is 90% mental, so why do we just train our bodies? \n \n Learn to harness the power of your mind and improve your running performance with mental training  from  The Yoga Collective  meditation and yoga instructor  Nicole D'Angelo  and  Runstreet  running Coach  Marnie Kunz . \n \n Each 1-hour workshop includes: \n \n \n Interactive exercises led by  Coach Marnie  to indentify problem thought patterns that hold you back in your running. The exercises will be tailored to each individual runner's unique goals and challenges. The second part of this segment will focus on how to change those thought patterns and replace them with an inner dialogue that will help you run stronger, faster, and enjoy your running more than ever. \n \n \n A guided relaxation led by meditation instructor  Nicole  designed to tap into your mind's subconscious, relaxed state.?Once you enter this zone, Nicole will lead you through a guided visualization exercise that will help you envision and execute your best running performance. Whether you have a specific race in mind you're training for or want to improve you running in general, this exercise will help you reach your highest potential. \n \n \n Visualization is most effective when practiced regularly, so after the workshop we will give each participant a take-home guide for how to practice the exercises at home. \n \n \n What you envision, you become.? Visualization is a tool long used by elite athletes to tap into the amazing power of the mind to allow the body to reach peak performance. Join us for this transformative workshop series to enjoy your running more, tap into your peak performance and strengthen your mind. We recommend coming to each session for maximum benefits as training the mind - like the body - takes dedication and continued practice."
}