{
    "addr": "Hilton New York Fashion District Chelsea, New York 10017", 
    "title": "Project Couture Fashion Magazine Model Casting Calls 2015 NYC", 
    "url": "http://www.eventbrite.com/e/project-couture-fashion-magazine-model-casting-calls-2015-nyc-tickets-16737229504?aff=ebrowse", 
    "location": "Hilton New York Fashion District Chelsea, New York", 
    "starttime": "2015-12-09T10:00:00-05:00", 
    "endtime": "2015-12-09T18:00:00-05:00", 
    "categories": [
        "Fashion", 
        "Attraction"
    ], 
    "desc": "PROJECT COUTURE FASHION MAGAZINE IS? NOW CASTING MODELS,? DESIGNERS, MAKEUP ARTISTS, HAIR STYLISTS,?FASHION STYLISTS, AND INTERNS FOR OUR INVITATION ONLY NEW YORK CITY MAGAZINE?PHOTO AND VIDEO SHOOT. ? ?FOR ALL OF YOU THAT ARE INTERESTED IN BEING A PART OF OUR INVITATION ONLY MAGAZINE PHOTO? AND VIDEO SHOOT AND BEING FEATURED IN AN UPCOMING ISSUE OF OUR MAGAZINE, YOU WILL HAVE TO SUBMIT A PHOTO PORTFOLIO AND A BIO WITH YOUR CONTACT INFORMATION TO REVIEW, IF WE DO NOT RECEIVE A PHOTO PORTFOLIO AND BIO FROM YOU BY EMAIL PRIOR TO THE EVENT DATE, YOU WILL NOT BE ADMITTED INTO THE AUDITION OR PHOTO SHOOT, SO PLEASE READ THE GUIDELINE CAREFULLY BELOW: The Worldwide Debut of Project Couture Fashion Magazine is now available online for those of you that have a love for modeling, fashion, beauty, and entertainment, this magazine is especially for you. ? Project Couture Magazine is brought to you by the International Beauty Movement, who also publishes Ripping Runways Magazine, Salon Savvy Magazine, Girl 9 Magazine, and Out Next Fashion Magazine. ? Please check out Project Couture Magazine at the links below: ? http://issuu.com/rippingrunways/docs/project_couture_magazine_2015_sprin/1 ? http://issuu.com/rippingrunways/docs/project_couture_magazine_2015_sprin_3e87cda1f7867b/1 ? ? The International Beauty Movement is casting female models ages 18-35, designers, makeup artists, hair stylists, that are interested in building their modeling portfolio and becoming a print model for our internationally known fashion and modeling magazines.  ? All models must have a professional recent photo portfolio that is no older than 12 months. ? To apply for consideration for this magazine photo shoot?as a feature model, hair stylist, designer, fashion stylist, or makeup artist, you will need to submit a professionally written bio with your contact information and 12 or more recent professional high resolution photos of your work if you are a hair stylist or makeup artist, if you are an aspiring fashion or print model, please submit 12 or more recent professional high resolution photos in formal dress clothing, casual clothing, swim wear, or lingerie, if you are a female lingerie or bikini model please submit 12 or more recent professional high resolution photos in lingerie, swimwear, or hot fitness wear, remember you must submit at least 12 or more of your hottest and most recent professional high resolution photos (that are no older than 12 months) with no writing on them, no logos, or photo signatures to qualify for this amazing magazine photo and video shoot. ? Submit photos and bio to:  internationalbeautymovement@aol.com ? All photos submitted by models will be evaluated on creative posing, makeup and hair styling, photo shoot location, and unique look. ? All photos submitted by makeup artists, designers, fashion stylists,?and hair stylists will be evaluated on unique look of your creative work. ? The more photos you submit, the better chance you will have of being selected to be a featured model in one of the 2015 upcoming issues of our magazine, so you will want to submit a lot of hot photos like most models worldwide are doing, which will gives us more of a variety to choose from when reviewing your photos.  ? ? We do not accept photos that are older than 12 months, we do not accept camera phone photos, we do not accept photos with more than one model in it, we do not accept photos posted on other websites, we do not accept low resolution photos, we do not accept photos with writing on them, logos, or photographer signatures, and we do not accept personal photos that are taken in your home, we do not accept photos that are collages or have effects, or have borders added to them, so please do not submit none of the above or your photos will not be considered. ? ? If you are interested in the opportunity of the year to break into the fashion industry as a model, designer, hair stylist, makeup artist, or fashion stylist, please visit our website to fill out an audition form at:  ? International Beauty Movement Web Site: http://internationalbeaut.wix.com/internationalbeauty ? You can read our hot fashion magazines at: ? ? Ripping Runways Online Magazine: ? http://issuu.com/rippingrunways/docs/2014_ripping_runways_magazine_fall_/1 http://issuu.com/rippingrunways/docs/2014_ripping_runways_magazine_summe http://issuu.com/rippingrunways/docs/2014_ripping_runways_magazine_chris_40e4844f2d2732/1 ? Girl 9 Online Magazine: ? http://issuu.com/rippingrunways/docs/2014_girl_9_magazine_summer_issue http://issuu.com/rippingrunways/docs/2014_girl_9_magazine_fall_issue/1 http://issuu.com/rippingrunways/docs/2014_girl_9_magazine_christmas_issu/1 ? ? Salon Savvy Online Magazine: http://issuu.com/rippingrunways/docs/salon_savvy_magazine_fall_2014_issu?e=6108760/9994327"
}