{
    "addr": "1 East 53rd Street New York, NY 10022", 
    "title": "Nonprofit Incorporation and Tax Exemption Workshop", 
    "url": "http://www.eventbrite.com/e/nonprofit-incorporation-and-tax-exemption-workshop-tickets-18611797387?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-09T14:00:00-05:00", 
    "endtime": "2015-12-09T17:00:00-05:00", 
    "categories": [
        "Non Profit \\u0026 NGOs", 
        "Class, Training, or Workshop"
    ], 
    "desc": "This workshop provides valuable information about starting a nonprofit organization. State issues to be covered include articles of incorporation, bylaws, and the first organization meeting. Federal issues include the Internal Revenue Code Section 501(c)(3) and corresponding regulations, application for employer identification number, IRS disclosure rules, unrelated business taxable income, charitable contributions, and restrictions on lobbying. This workshop will also touch on the legal and ethical duties for board members; donor requirements; the new Form 990; intellectual property issues specific to nonprofit tax-exempt organizations; insurance; and employment issues. The Fiscal Sponsorship model will be addressed as an alternative to forming a non-profit organization. *3.0 CLE available for attorneys. Membership Discount Code: Are you a VLA Member trying to register for this class? E-mail or call VLA to get your membership discount code! - registrations@vlany.org or 212.319.2787 x 10 Fees: $75 Full-Time Student / Artists Over Sixty (must present proof of full-time status with registration) $100 Arts Professional VLA Member $150 Arts Professional Non-Member $200 Legal Professional VLA Member $250 Legal Professional Non-Member (Additional individuals from the same start-up organization may register for an additional $50 each) VLA requires all applicants seeking Nonprofit Incorporation and Tax Exempt Status services through VLA to attend one of these workshops before a volunteer attorney can be assigned to them. All registration fees are non-refundable. Please note you are not registered until full payment is received. For more information on this program, please contact VLA at registrations@vlany.org or 212.319.2787 x 10. This program is funded in part by The Edmond de Rothschild Foundation Nonprofit Assistance Program. To apply for a full or partial CLE scholarship, please view our Financial Aid Policy Guidelines  here ."
}