{
    "addr": "1185 Ave of Americas New York, NY", 
    "title": "Professional Strategy Session: Learn To Maximize Corporate Meetings", 
    "url": "http://www.eventbrite.com/e/professional-strategy-session-learn-to-maximize-corporate-meetings-tickets-19241443676?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-09T18:00:00-05:00", 
    "endtime": "2015-12-09T21:00:00-05:00", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Have you ever attended a less-than-effective meeting at work? How about a meeting where you were cut off, or were intimidated to speak up in the first place? Famous for being hexed by disorganization, complaints, animosity and interruption, work-related meetings might not always seem to be worth your time. How wonderful it would be if each of these meetings ran smoothly and productively, possibly even led by YOU, prompting you to look forward to them. This could be a real-world scenario for you and your colleagues. Our Professional Strategy Sessions are designed to transform you into a thought leader capable of organizing, leading, and following up from interactive business meetings. DRIVEN?Specialist  Ginny Brown  will equip you with the skills to lead productive, respectful, timely meetings like a pro. You?ll learn how to maintain order and focus in your meetings, how to use diplomacy in the face of anger and domination, and even how to negotiate family squabbles at home. Sign up for our next session, and be the one who takes control of a paradigm shift in your workplace. You?ll earn the respect of others, while advancing your career. And don?t forget: Attending this event qualifies you for 1.5 CPE Credits! 6:00?6:30pm: Registration, Networking and Noshing 6:30pm?8pm: Main Program 8-9pm: Networking The Fine Print: Photographs and video will be taken at the event for use on the DRIVEN Professionals website and social media outlets as well as future marketing materials. By entering this event, you consent to DRIVEN Professionals potentially using your image and likeness. Newsletter Opt-In: When you sign up for this event, we are going to add you to the DRIVEN distribution list so you can stay informed about our exceptional upcoming events. If your inbox is too cluttered, you can easily unsubscribe at the bottom of the next newsletter."
}