{
    "addr": "49 Mercer Street New York, NY 10013", 
    "title": "Greekalicious cooking class", 
    "url": "http://www.eventbrite.com/e/greekalicious-cooking-class-tickets-18635725958?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-09T18:30:00-05:00", 
    "endtime": "2015-12-09T21:00:00-05:00", 
    "categories": [
        "Food \\u0026 Drink", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Taste of Greece ? travels and dishes from around Greece  You are all familiar with the rich blue and white images of the Greek Islands. Match the food to the imagery, with ingredients and dishes from Mykonos, Crete and Tinos. We will discover the key ingredients used on these islands and how they are used in sweet and savoury dishes. Dishes will include the salad of Tinos (fennel, pine nut, feta, sundried tomato and fresh herbs salad) (GF/Veg), the caramelized onion filo pies of Mykonos (Veg), cumin crusted deep fried fresh calamari, and orange, currant and saffron rizogalo (rice pudding) (Veg). ? Menus subject to change. Please advise us of any dietary requirements so that we can accommodate. Many of our dishes can be accommodated to be vegetarian, vegan friendly and gluten free.  ? Veg ? Vegetarian ? V ? Vegan ? GF ? Gluten Free ? Cost: $130.00 per person (includes taxes, booking fee, organic food, wine, recipes, hands on cooking, wisdom, fun and story-telling) ? At Greekalicious we care about you and your health.? ? We cook with ingredients that are respectful and loving to you and the environment. ? ? We use seasonal certified organic ingredients wherever possible and ingredients that are GMO-free. ? ? We use certified Greek organic extra virgin olive oil from Greece the origins of olive oil making in all our cooking and not the unhealthy cotton seed, canola, soy and vegetable oils that many other eating establishments use. ? ? We strive to be and to provide the best cooking classes when it comes to the use of quality ingredients, good energy and service.? ? ? Above all we practice an Ancient Greek tradition of cooking with ?agapi? (Unconditional Love) and harmony. We cook all our dishes adopting the healing Ancient Greek wisdoms and philosophies that lead to harmonious health and longevity."
}