{
    "addr": "110 E 28th St. 10th Floor. New York, NY 10016", 
    "title": "Product Management Course - Info Session", 
    "url": "http://www.eventbrite.com/e/product-management-course-info-session-tickets-19273720216?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-09T18:30:00-05:00", 
    "endtime": "2015-12-09T20:30:00-05:00", 
    "categories": [
        "Career", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Would you like to get a job as a Product Manager? Join us for this free open doors session to get an overview of our part-time product management course curriculum, meet the lead instructor and have the chance to ask any additional questions that you might have?about what it takes to become a product manager in New York City: All our classes are compatible with a regular work schedule and our campus is conveniently located in Manhattan. This is not your traditional lecture class. Expect a healthy mix of group work, one-?on-?ones with mentors, and a hands?-on experience building your own digital product from end to end. The instructors are professionals with real-world experience working at renowned tech Companies like Google and LinkedIn, and other technology startups. We have assembled a list of local hiring partners who are eagerly looking for our top Product School students. Timeline:? Takeaways: ? ? Rayyan Islam ?is VP of Product at Beacon and Investor at early-stage startups. He has worked with companies like Spotify, 406 Ventures, Lazard, and Deloitte to drive lasting impact and value to technology startups and enterprises. He is also the Product Management Instructor at Product School in New York. Where: ? WeWork is the platform for creators. We provide the workspace, community, and services you need to make a life, not just a living. To learn more about the WeWork locations in New York City, click here to book a tour or send an email to joinus@wework.com. Make sure to let them know you were referred by Product School."
}