{
    "addr": "3 Columbus Circle New York, NY 10019", 
    "title": "Swap The Biz NYC Exclusive Business Networking Referral Breakfast - 2nd Thurs", 
    "url": "http://www.eventbrite.com/e/swap-the-biz-nyc-exclusive-business-networking-referral-breakfast-2nd-thurs-tickets-17645660646?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T08:30:00-05:00", 
    "endtime": "2015-12-10T10:30:00-05:00", 
    "categories": [
        "Startups \\u0026 Small Business", 
        "Meeting or Networking Event"
    ], 
    "desc": "8:30AM - 10:30AM This is a special high end exclusive referral networking group for business owners, CEO's and professionals with an affluent reach. ?We are hosting at a beautiful Showroom. Event Format - Breakfast & Coffee. (Please note that this event is for concierge members & invited guests only, if you would like to receive an invite please email  Scott@SwapTheBiz.com ) Event Details 8:30AM - 9:00AM  9:00AM - 9:05AM? For  membership information, click here . If you want to request an invite to one of our membership only exclusive breakfast referral groups, email  Scott@SwapTheBiz.com  or call 212-683-2107. More Information Sponsors are welcome but opportunities are limited, please contact us at  Scott@SwapTheBiz.com  for pricing and to reserve your spot now. For the full event details call 212-683-2107 or visit  www.SwapTheBiz.com ? Check out what members are saying about Swap The Biz: \"Impressed with the energy of the people who joined the event. Scott was very involved in the evening's success.\" - Paul Gauthier \" Scott does a great job in helping companies and individuals network as effectively as possible. Thanks, Scott - Christopher Desantis \"High caliber event, glad to be a part of the group.\" - Mark Karten \" Swap the Biz offers a great opportunity to network and connect with other professionals. Scott's events make networking fun and profitable.\" - Don Gabor ? \"I give both events I attended an A++. Thank you for making being a part of this group such a good investment.\" - Lorraine Gonzalez"
}