{
    "addr": "242 West 45th Street New York, NY 10036", 
    "title": "The Color Purple Musical - New York Shopping Trip (Leaving Jacksonville, FL)", 
    "url": "http://www.eventbrite.com/e/the-color-purple-musical-new-york-shopping-trip-leaving-jacksonville-fl-tickets-17270496520?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T17:00:00-05:00", 
    "endtime": "2015-12-14T22:00:00-05:00", 
    "categories": [
        "Travel \\u0026 Outdoor", 
        "Tour"
    ], 
    "desc": "Broadway Here We Come!  Jennifer Hudson, the Powerhouse singer, Oscar and Grammy winner makes her Broadway debut starring as Shug Avery in \" The Color Purple Musical \"! An inspiring family saga that tells the unforgettable story of a woman who ?through love ? finds the strength to triumph over adversity and discover her unique voice in the world.?? The Christmas season is a magical time in NYC! Holiday Lights everywhere and some amazing shopping! It is with great pleasure we invite you to share your love of theatre and shopping by joining us on an entertaining motor coach excursion to New York, December 10 -14, 2015. Motor coach departs from Lowes (River City), Jacksonville, FL.??  Travel Package Includes  4 days 3 nights hotel accommodations ? Embassy Suites, Elizabeth, New Jersey  Free Cooked to Order Breakfast at Hotel  Complimentary Evening Reception with Beverages and Appetizers in hotel lobby  Round-Trip Deluxe Motor Coach Transportation (Wi-Fi & Outlets)  NYC Christmas Lights Sight-Seeing Tour  NYC & Jersey Gardens Holiday Shopping  A Free Day to Explore NYC on Your Own  One ticket for The Color Purple Musical  ? COST :  Double  $735pp,  Triple  $650pp  Quad  $615pp  $100 Reserves Your Seat ? Due Now  PAY SCHEDULE FOLLOWING DEPOSIT  First Payment Due July 1, 2015  Second Payment Due Aug 1, 2015  Third Payment Due Sept 1, 2015  Fourth Payment Due Oct 1, 2015  Remaining Balance Due Nov 1, 2015  ? All payments are Non-Refundable and may only be transferred person to person.  Acceptable Forms of Payment:  Cashier?s Check, Money Order and PayPal (add 2.9% + $0.30 per transaction for PayPal service fee.)  ? For details contact: Pansy Hawkins, (904) 534-6044 call or text, by email mojastar@aol.com.  LIVE YOUR LIFE, TRAVEL YOUR DREAMS!"
}