{
    "addr": "394 Broadway. 5th Floor. New York, New York 10013", 
    "title": "Tools to Understand Your Community & Clients", 
    "url": "https://www.eventbrite.com/e/tools-to-understand-your-community-clients-tickets-19069749133?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-10T10:00:00-05:00", 
    "endtime": "2015-12-10T12:00:00-05:00", 
    "categories": [
        "New York, United States Events", 
        "Class", 
        "Business"
    ], 
    "desc": "Join? Impact Bazaar ?&? TYTHEdesign ?s Kristina Drury on? Tuesday, October 27th ?from? 10A M to 12PM ?to gain? Tools to Understand Your Clients & Community . \n The most impactful companies and organizations know their customers' needs and their environments inside and out. If you've ever struggled to bring your clients to the center of your work or effectively assess your landscape without draining resources, this class is for you.?TYTHE will teach our go-to methods to learn about the people you serve or sell to, including who they are, what they're affected by, and who influences them. This engaging class offers a hands-on look at research tools to assess your own context and check your assumptions. \n Design thinking is a multidisciplinary, people-centered process that encourages empathy with your clients or community, experimentation with solutions, and design outcomes that match human needs. After years of integrating the design thinking methodology into our daily work,? TYTHEdesign ?has developed? Community Capacity Lab , a tailored class series focused on translating design theories across fields and sectors into real world, real work experience. We draw on case studies and interactive activities to share feasible and adaptable ways to bring innovation, creative thinking, and greater impact to your everyday work. ?? \n This class focuses on the people at the heart of yourk and is designed to be most beneficial for non-profits, city agencies, and service-based businesses. \n WHAT YOU'LL LEARN \n \n An introduction to the design thinking problem-solving approach \n A series of tools to understand your community, clients, and customers \n Tips and tricks for design research and ethnography \n \n \n Note: ?Class participants receive? free ?entrance to Impact Bazaar's workspace on the course date."
}