{
    "addr": "10 Columbus Circle. Floor 2. New York, NY 10019", 
    "title": "James Allen #DiamondDay with Whitney Port!", 
    "url": "https://www.eventbrite.com/e/james-allen-diamondday-with-whitney-port-tickets-19461741593?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-10T10:00:00-05:00", 
    "endtime": "2015-12-10T20:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Appearance", 
        "Fashion"
    ], 
    "desc": "Join  JamesAllen.com  &  Whitney Port  at the Shops at Columbus Circle on the 2nd floor of Time Warner Center for our  ONE DAY #DiamondDay Event! \n Pamper yourself with free manicures, shoe shine, mini wedding cakes, and more. Entrance is free and open to the public. Come early to enjoy the freebies and enter for a chance to win a 3 carat James Allen diamond. Special celebrity guest Whitney Port will do a meet & greet with 10 lucky #JAVIP Facebook contest winners (Rules of Entry below). \n http://www.j.mp/JamesAllenDiamondDay \n \n \n ~*~*~*~ #JAVIP Facebook Contest ~*~*~*~ \n \n Enter our Facebook contest for the chance to be a #JAVIP and meet @WhitneyEvePort in person! We're giving 10 lucky winners VIP access to the event which includes: \n Exploring our space before it opens to the public \n Meet and greet with Whitney Port (selfies included!) \n Special diamond nail jewel manicures (and/or shoe shine for the guys) \n Mini wedding cakes and coffee at the Carat Cafe - 1-on-1 consultation with a James Allen expert to design your own dream ring \n \n \n HOW TO ENTER:  \n 1. \"Like\" James Allen Jewelers Facebook page: www.facebook.com/JAMESALLENRINGS/ \n 2. Post on your own Facebook Timeline about why you love James Allen + use the hashtags #DiamondDay and #JAVIP  \n \n *Contest ends November 21st, 2015 at 11:59 PM PST - only posts created by this time will be eligible. Facebook account holders must be 18 years or older. James Allen will not be responsible for travel-related expenses -- the winners are responsible for getting to/from the event. Ten winners will be randomly selected. Winners will be announced on November 22nd. Selected winners must confirm their attendance by November 29th 11:59 PST. Winners must arrive at the event by 9:00 am to be guaranteed a chance to enter and meet Whitney Port."
}