{
    "addr": "40 Exchange Place. 3rd floor - ask at front desk for room for Joel Elfman - NLP/Hypnosis. New York, NY", 
    "title": "Irresistible Change: An Intro to NLP-Hypnosis", 
    "url": "http://www.eventbrite.com/e/irresistible-change-an-intro-to-nlp-hypnosis-tickets-15284999846?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T18:30:00-05:00", 
    "endtime": "2015-12-10T20:30:00-05:00", 
    "categories": [
        "Mental health", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Irresistible Change: Learn Hypnosis+NLP? ? ?(usually 2nd Thursday of every month) ? ?? Is there something you Want to Stop Doing & Can?t ?? Is there something you Want to Start & You Haven?t Yet ?? Is there a Way, a Time, a Place You Want to Feel Differently Let me show you how hypnosis & NLP (Neuro-Linguistic Programming) can help you, how you can help others. Each month we will explore some different elements of NLP & Hypnosis and we will often close with a group trance. Newcomers and experienced Practitioners are all welcome. Your Habits, Beliefs & Behaviors are Patterns Your habits, beliefs and behaviors are patterns your brain has created to provide pleasure and avoid pain as easily and efficiently as possible.? The problem is that some of those patterns were formed when you were younger or under stress and are no longer as good a solution as they once might have been.? You can change them easier then you think. Using Your Resources & Abilities Imagine using all the knowledge, experience, resources and abilities you have NOW, to create better choices.? Perhaps, you?ve seen stage hypnosis shows or read some novel, seem some movie featuring the power of hypnosis.? Well, fiction is fiction, and the folks on stage are specifically chosen by the hypnotist for there ability to be most suggestible.? You might not be as easily hypnotizable as those people, but everyone goes into trance, everyone has the ability to use their imagination and to make change. And if you take the extra time, you have as much ability as those folks on stage to completely change your attitudes, habits or beliefs to something that works magnificently better then what you have now. ? If you want to find out how powerfully you can go into trance or make change, Come Join Us! ? Register No w! ? The average person daydreams, 2,000X a day, each averaging 14 seconds.? Athletes, entrepreneurs, artists, creative, visionaries all use that ability to make pictures, sounds, sensations about what they want, and then they work to make it happen. ? If you want to find out to harness your ability to see, hear and feel differently.? Come Join Us! ? This is a hands-on class for those interested learning/experiencing/practicing some of the basic hypnosis, NLP, trance and other transformational skills so they might help themselves &/or others.? The skills of hypnosis & NLP are both practical and magical.? These skills are based on the way our brains naturally work.? And they are simple, organic and easy to learn. ================================= $35 - Regular Price $25 - Early Bird Price - available until 3 days before the event ================================= Imagine \"YOU\": ??Thinner ??More confident ??Less stressed ??Better focused Imagine You Achieving Your Goal Imagine You Living a Better Life If you felt, heard or caught a glimmer of these possibilities, you went into a moment of trance quickly, easily and effortlessly. That means these tools can work for you. If you've got a desire to make that vision a reality, to attain the life, the body and goals you want, then you can start to? Learn these skills NOW . If you want to see, hear and feel new ways to change your relationship, beliefs and habits,? Come Join Us!?? And learn how to use hypnosis+NLP to help yourself and others. If you like please bring a particular problem, belief or habit you would like to change and we'll explore how hypnosis+NLP might help. ? ? ? ? TItle of Class:?? Train Your Brains: An Intro to Hypnosis+NLP Description of Class: This is a hands-on class for those interested learning/experiencing some of the basic hypnosis, NLP, trance and other transformational skills so they might help themselves &/or others. Duration: ?2 hours What will you learn? ? This is a hands-on class.? Every class is different and we will focus on different aspects of Hypnosis+NLP.? And we?ll give plenty of time to practice these skills.? Examples of some of the things you will learn/practice/experience are: ? Experience How to: * easily and effortlessly hypnotize yourself * get rid of negative messages you tell yourself * go deeper into relaxation then you've ever been before * eliminate or reduce cravings, habits or beliefs * enjoy better health * change limiting blocks that have prevented you from reaching your goals * build amazing positive and resilient states of calm, confidence, happiness and more in yourself & others *improve rapport and communication ? ================================= $35 - Regular Price $25 - Early Bird Price - available until 3 days before the event ================================= Live Live - This event include cutting edge ideas and techniques and real world examples to help you let go of frustration and tension, and to create better balance between work and home. You will see live demonstrations, gain hands-on skills and practice everything you've learned. You'll gain a basic introduction to Hypnosis, NLP and other modalities that create easy and lasting change. And you'll have an interactive conversation and lessons about how these methodologies can benefit and improve your ability to change and become a better, more productive you. ? In Control - Experience that your mind and body are always in control during hypnosis and trance. You are always aware of what happens around you. And no one can make you do anything you wouldn?t ordinarily do on your own accord or that violates your values. All exercises and trance experiences are optional and voluntary. ? With Quality - This workshop is your best opportunity to work with an experienced hypnotist and get a taste of how hypnosis, NLP and other tools for personal change will help you achieve your goals. This will be absolutely the most least expensive and highest quality opportunity to learn how these skills can improve and benefit your life. ? *NLP (Neuro-Linguistic Programming) ?is often called the study of subjective reality, how each individual uniquely experiences, processes and communicates with the world around them. Once an individual's patterns are modeled, the tools of NLP are highly effective in creating change. Register No w! ? ? http://www.joelelfman.com Visit? my website ?to learn about? Clinical Research on Hypnosis and for answers to Frequently Asked Questions about NLP & Hypnosis"
}