{
    "addr": "123-01 Roosevelt Ave New York, NY 11368", 
    "title": "New York City's Bacon and Beer Classic 2016", 
    "url": "http://www.eventbrite.com/e/new-york-citys-bacon-and-beer-classic-2016-tickets-19688188903?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-04-22T19:00:00-04:00", 
    "endtime": "2016-04-23T22:00:00-04:00", 
    "categories": [
        "Food \\u0026 Drink", 
        "Festival or Fair"
    ], 
    "desc": "The? BACON AND BEER CLASSIC ?is returning to NYC for its 3rd annual takeover of Citi Field on Friday, April 22nd and Saturday, April 23rd! ? ? ? Explore the legendary home of the New York Mets, Citi Field Ballpark, while sipping hundreds of craft beer samples and munching mouth-watering bacon dishes, all created exclusively for the festival by the best local restaurants and eateries.? In addition to the delicious suds and grub, you'll experience great music, play interactive games, strike a pose at the photo booth, battle it out on the bungee run, brand yourself with bacon and beer-inspired tats, and ?leave having discovered a slew of new breweries and restaurants!? ? ? We have three ticket types available: ?*Tickets are non-refundable, but 100% transferrable to anyone over the age of 21.? ? One session available on Friday, April 22, 2016? Evening: 8-11pm Two sessions available on Saturday, April 23, 2016 Afternoon: 1-4pm Evening: 7-10pm If you decide to indulge in both sessions, you will need a ticket for each session to attend. *VIPs are granted admission to each session one hour earlier!* ? All attendees must be at least 21 years old. All Bacon and Beer Classic tickets are sold via Eventbrite. For more information, directions, and frequently asked questions about Bacon and Beer Classic, please visit our website:? www.baconandbeerclassic.com ??? facebook ??? twitter ??? instagram ? We're looking for? rockstar volunteers ?to help us make the 3rd Bacon and Beer Classic at? Citi Field ?a success!? Follow this link ?for more information and to sign up."
}