{
    "addr": "48 Wall Street. 15th Floor. New York, NY 10005", 
    "title": "NYC Hiring Mixer", 
    "url": "http://www.eventbrite.com/e/nyc-hiring-mixer-registration-18975235440?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T18:30:00-05:00", 
    "endtime": "2015-12-10T20:30:00-05:00", 
    "categories": [
        "Career", 
        "Meeting or Networking Event"
    ], 
    "desc": "If you are having trouble finding amazing, ambitious technical talent to bring onto your team, join us on for an opportunity to mingle with Dev Bootcamp career-seeking alumni in New York! Graduates will showcase their projects at their respective stations and you will have an opportunity to speak with candidates directly and vet some potential new team members for your team right then and there! Graduates will have their resumes at their stations also. Event Format 6:15-6:30  ?Enjoy snacks and drinks, mix and mingle with DBC graduates and staff. 6:30-6:45  ?Employer Introductions - take a minute or two to tell everyone about your wonderful company. 6:45-7:45 ? Speed interviews. Employers and devs take 5 minutes to learn about each other. When the gong rings, the employer moves to the next project. 7:45-8:30 ? Open format networking. ?Enjoy the refreshments and chat further with the Dev Bootcamp developer community! How to Prepare for the Mixer ? Be sure to bring plenty of business cards with you and feel free to bring others on your development/recruiting team with you. The morning of the event, you'll receive an email with the projects that'll be showcased at the mixer. Review these projects ahead of time so you are prepared and excited for the fantastic projects you'll be seeing later! ? With the projects document, you'll know our developers, but our developers may not know you! So introduce yourself!  Please be sure to  create a DevConnect profile  prior to the event  so that connecting with our graduates after the event is a more seamless process.  DevConnect is Dev Bootcamp?s  free online platform that allows recent graduates to search through our hiring employer partner network. With this event, we are bringing DevConnect to life by  offering a live networking event so you can meet our job-seeking alumni in-person. How cool! :) Photography by Dev Bootcamp and Brandi M. Ford, Rock Doves 2015 We do ask that companies attending are currently hiring, have at least three engineers on their team, and have the capacity to mentor junior developers.  No ? third-party recruiting companies, please."
}