{
    "addr": "111 West 20th Street New York, NY 10011", 
    "title": "King's County Distillery", 
    "url": "https://www.eventbrite.com/e/kings-county-distillery-tickets-19412299711?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-10T18:30:00-05:00", 
    "endtime": "2015-12-10T19:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Class", 
        "Food & Drink"
    ], 
    "desc": "Kings County Distillery is New York City?s oldest operating whiskey distillery, the first since prohibition. Founded in?2010, Kings County makes handmade moonshine and bourbon out of the 115-year-old?Paymaster?Building in the Brooklyn Navy Yard. ?They use New York grain and traditional distilling equipment to make distinctive whiskey.??Their whiskeys have won numerous awards from the American Distilling Institute, the American Craft Spirits?Association, and their bourbon was recently named #2 craft bourbon by Eric Asimov of the  New York Times .??They only distill whiskey for their label and never buy bulk whiskey from any other source.First located in a 325 square-foot room in East Williamsburg, Kings County began as the smallest commercial distillery in the country, with five 24-liter stainless steel stills making whiskey seven days a week, 16 hours a day. ?In 2012, they moved into the Paymaster Building in the historic Brooklyn Navy Yard, just steps from legendary site of the Brooklyn Whiskey Wars of the 1860s and the former distillery district of the waterfront. ?With traditional copper?whiskey stills fabricated in Scotland, wooden fermenters were built locally by Isseks Brothers, and a corn and barley patch at a small farm onsite, the distillery is a model of sustainable and traditional whiskey production and?one of the preeminent craft distilleries in the United States. ?They also offer tours and tastings every Saturday. \n (212) 229-WINE (9463) \n *in accordance with NY State law, this charge is for the educational publication provided at the event."
}