{
    "addr": "891 Amsterdam Avenue New York, NY 10025", 
    "title": "Travel and Voluntourism in Nepal", 
    "url": "https://www.eventbrite.com/e/travel-and-voluntourism-in-nepal-tickets-19665922303?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-10T19:00:00-05:00", 
    "endtime": "2015-12-10T21:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Travel & Outdoor"
    ], 
    "desc": "Travel and Voluntourism in Nepal \n Learn more about why you should make post-earthquake Nepal your next travel destination \n \n In the spring of 2015, Nepal suffered a devastating earthquake that took more than 8,000 lives. Much property and heritage was lost in the disaster, but so much more remains untouched. Despite widespread media coverage of the earthquake and its negative effects, this talk aims to reassure travelers that Nepalis and Nepal remain strong. Most of the ancient monuments, hiking trails, mountains and hills and rivers continue to persevere. ? \n Despite the devastation Nepal?s reliance on the tourism industry remains a primary source of its recovery. Through this informational talk and discussion, volunteer Emily Young will bring you stories from travellers that have firsthand experience with Nepal?s resilience. The talk will also share hard data to paint an accurate picture of when and where to make your trip.? You?ll receive tips on preparation, budgeting, and navigating the country?s many sites and destinations. \n This talk is for anyone thinking of coming to Nepal or anyone interested in simply learning more about this fascinating country. We will be collecting donations for an on-the-ground local charity that is having real impact in its community and welcome attendees to contribute what they can.? \n \n \n About Our Speaker \n \n Your speaker is Emily Young, a UK National, who spent 9 months working for a Nepali NGO in Kathmandu and more remote areas. Emily is formally a University lecturer in children?s physical activity and health and is currently Director of Education with a NY human trafficking not-for profit, Freedom Ladder. ?She currently spends her time between Sri Lanka and New York City, where she hopes to work with more nonprofits and spread her impact."
}