{
    "addr": "317 East Houston Street. (between Stanton and Clinton Streets). New York, NY 10002", 
    "title": "We Heart NYC Writers Night + Open Mic - Poetry/Prose/Spoken Word", 
    "url": "http://www.eventbrite.com/e/we-heart-nyc-writers-night-open-mic-poetryprosespoken-word-tickets-19131806749?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T20:00:00-05:00", 
    "endtime": "2015-12-10T23:00:00-05:00", 
    "categories": [
        "Literary Arts", 
        "Appearance or Signing"
    ], 
    "desc": "EVERY 2nd Thursday of the month! InspiredWordNYC  (creator/producer of the Queens Lit Fest) Presents  We Heart NYC Writers Night + Open Mic  at  The Parkside Lounge , one of the coolest performance spots in Manhattan's East Village. This is a celebration of emerging New York City writers of all types - poets, novelists, journalists, short story writers. Shows feature carefully selected writers of note, especially those who have recently released books as well as? a 15-slot open mic (6-minute time limit, for writers of all types and spoken word poets). Signed books will be available for purchase - a great chance to show local literary love. Please share this event on social networks with the hashtags #SupportLocalWritersNYC #BuyBooksNYC #BuyLiteraryPubsNYC #SupportEmergingWritersNYC. It's good karma. A percentage of the proceeds - and? 100% of the #SupportLocalWritersNYC DONATIONS - go to the featured writers. ***21+ age limit (please make sure to bring valid ID)*** ***** When: EVERY 2nd Thursday of the month Where:  The Parkside Lounge 317 East Houston Street (between Stanton and Clinton Streets) Manhattan, NY 10002 By subway, take the F to 2nd Avenue, walk up the 1st Avenue stairway, then walk east. Doors open for open mic sign-up @ 7:45pm. Slots will be given out on a first come, first serve basis.  Band goes on @ 8pm.? Feature show begins @ 8:30. ***** Cover Charge: $6 online (which allows you to bring an audience friend for free), $7 at the door. ***2 Drink Minimum (but drinks are super cheap and $2 non-alcoholic options are available)*** EARLY BIRD SPECIAL - Buy your ticket at least a week in advance and get in for only $5 and bring 2 audience friends for FREE (NOTE: Just ONE person in the 3-person group will have the opportunity to sign up for the open mic). LIMITED QUANTITY AVAILABLE. ***** Make sure to bring a printed out version of your ticket or tickets. Please Note: No TRANSFERS or REFUNDS will be granted, though you are welcome to find REPLACEMENTS for your tickets. ? ***** Hosted by  Megan DiBello . ***** Featured Writers for Dec. 10: ***** Produced by  Mike Geffner Presents The Inspired Word http://inspiredwordnyc.com"
}