{
    "addr": "Broadway and 63rd Street New York, NY 10023", 
    "title": "The 16th Annual Winter’s Eve at Lincoln Square", 
    "url": "https://www.eventbrite.com/e/the-16th-annual-winters-eve-at-lincoln-square-tickets-19279386163?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-11-30T17:30:00-05:00", 
    "endtime": "2015-11-30T21:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Festival", 
        "Holiday"
    ], 
    "desc": "On Monday, November 30, 2015 the? Lincoln Square Business Improvement District ?and presenting sponsor? Time Warner ? will host the Sixteenth?Annual Winter?s Eve at Lincoln Square ? New York?s largest holiday festival! Join legendary artists, up-and-coming musicians, dancers, street performers and more as we welcome the holiday season and light up the Upper West Side with an evening of music, food, dancing and fun for everyone. \n Lincoln Square?s sidewalks and public spaces will come alive with music, performers, processional groups, jugglers, stilt-walkers and more, making for a festive fun-filled evening along the streets of this dynamic Upper West Side neighborhood.  The celebration begins with the lighting of the Upper West Side Holiday Tree in Dante Park at Broadway & 63rd Street and continues along Broadway from Time Warner Center to 68th Street. \n This year, THE CHAPIN FAMILY, featuring Tom Chapin, the Steve Chapin Band, the Chapin Sisters, and Jen Chapin will headline the main stage at Dante Park (Broadway and 63 rd ? Street).? Other talent performing at Winter?s Eve includes: Nigunim Trio featuring Lorin Sklamberg,?Frank London & Uri Caine; Alicia Svigals? Klezmer Fiddle Express; Cynthia Sayer & Her Sparks Fly Quartet; The Brain Cloud; and many more, including a Tony Award? winning Broadway performer soon to be announced! \n Over 30 of Lincoln Square?s finest restaurants and eateries will offer food tastings at nominal cost ($1-$4) at three separate outdoor locations from 6:00 pm ? 8:30 pm. Dozens of local stores and neighborhood institutions will host activities and holiday cheer throughout the evening."
}