{
    "addr": "212 East 52nd St. 3rd Floor. New York, NY 10022", 
    "title": "iRESI with Carlos Averhoff Jr. - Late Night at Club Bonafide", 
    "url": "http://www.eventbrite.com/e/iresi-with-carlos-averhoff-jr-late-night-at-club-bonafide-tickets-19237047527?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T23:00:00-05:00", 
    "endtime": "2015-12-11T02:00:00-05:00", 
    "categories": [
        "Blues \\u0026 Jazz", 
        "Concert or Performance"
    ], 
    "desc": "21+ admitted | Set begins after 11pm |  2 drink minimum for table service  Carlos Averhoff, Jr - Sax, Santiago Bosch - Piano, Fabio Rojas - Drums, Edward Perez - Bass Carlos Averhoff Jr is a Latin Grammy nominated Cuban tenor saxophonist, contemporary Afro-Cuban Jazz composer and educator. All About Jazz names Carlos \"a dynamic fresh new voice on the saxophone? and Latin Jazz Network portrays his playing as ?quite extraordinarily expressive and beautiful,? further adding, ?Carlos Averhoff Jr is a musician who is renowned as a virtuoso soloist.? He presents his debut album iRESI. The music of Carlos Averhoff Jr?s & iRESI is visionary, unique, engaging and rich in tradition and elegantly. Combines the harmonies and rhythmic landscapes of Cuban music with the modern allure of contemporary avant - garde Jazz. Born in Havana, Cuba, Carlos first encounter with music was through his mother?s womb by the hands of his father, legendary saxophonist and member of Chucho Valdes?s Irakere, Carlos Averhoff, Sr. Classically trained in Cuba?s top music schools - Manuel Saumel Conservatory of Music, Amadeo Roldan School of Music and Havana?s Superior Institue of Art ? Carlos continued his education in the United States earning Suma cum Laude Honors at Berklee College of Music and a Master?s Degree with Honors from Boston?s prestigious New England Conservatory of Music. During his continuous academic pursuits, Carlos received numerous scholarly awards from the aforementioned institutions, among them the Charlie Parker Scholarship Award, the Woodwind Faculty Achievement Award, the North American Scholarship, and NEC?s meritorious awards. He took instruction from Jazz luminaries Jerry Bergonzi, George Garzone, Ed Tomassi, Frank Tiberi, Greg Osby, Bill Pierce, Terri Lyne Carrington, Jason Moran and Donny McCaslin, among other recognized Jazz teacher. Carlos has also collaborated in many aspects with respected drummers: Louis Hayes, Jimmy Cobb, Bob Moses; Cuban drummers Horacio El Negro Hernandez, pianists Jason Moran, Chucho Valdes, saxophonists Dave Liebman, Greg Osby, Bill Pierce, Paquito de Rivera; Cuban singers. In addition to Latin Grammy nominated recordings with Omara Portuondo and Buena Vista Social Club. http://www.carlosaverhoffjr.com"
}