{
    "addr": "Room 4 A, NYC EDC. 110 William Street. New York, NY 10038", 
    "title": "NYCEDC Nonprofit Capital Project Planning Workshop Series", 
    "url": "http://www.eventbrite.com/e/nycedc-nonprofit-capital-project-planning-workshop-series-tickets-19171721134?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-11T09:00:00-05:00", 
    "endtime": "2015-12-11T16:30:00-05:00", 
    "categories": [
        "Non Profit \\u0026 NGOs", 
        "Conference"
    ], 
    "desc": "NYCEDC is excited to host the 2015-16 series of?Nonprofit Capital Project Planning Workshops  ? The 2015-16?series of?two day workshops will?be presented by the consultant team of Penn Flood Consulting and Denham Wolf Real Estate Services and are designed to help non-profit leaders (Executive Directors and Board Members) gain an insight into construction planning and prepare their organizations?structurally and financially?as they undertake capital projects.  The workshop?will comprise of four modules: Organizational Strategic Planning and Board Engagement, Financial Oversight Planning & Fundraising, Construction Supervision, and the Capital Discretionary Funding Process.? ? Day 1?  Hosted by Penn Flood Consulting, Day 1 will help organizations focus on preparing and effectively planning for capital campaigns and will comprise of two modules: Module 1. Organizational Strategic Planning and Board Engagement  will address questions and concerns regarding strategic planning and board involvement during all phases of the project. Nonprofits will gain an understanding of the tools needed when undertaking a captial project.  Module 2.??Financial Oversight, Planning & Fundraising,  will?provide an overview of capital budgets and financial planning. This module will cover topics?such as fundraising for capital projects and managing cash flow to cover operating costs.  ? Day 2?  Hosted by Denham Wolf Real Estate Services, Penn Flood Consulting and NYCEDC, Day 2 will focus on assisting organizations with developing?business plans for post-construction costs and project sustainability. This module will lay groundwork for?organizations, lay?a road map of?the construction phase of the project,?explain basic construction terms,??the?roles and responsibilities of the project team and offer participant a basic understanding?of construction project management. ? The cost of registration is $150 per non-profit organization (two attendees). We encourage organizations to send?senior staff members and/or a board member. These workshops are restricted to employees and board members of non-profit organiztions. (Please contact faworkshops@edc.nyc?for any special requests prior to registration). ? Lunch will be served (please let us know in advance of any dietary restrictions).?? Registration for future workshops will be opened on an ongoing basis. Please note: The December workshop comprises of the ?Day 1: December 11 and Day 2: Day December 18.(9:00 AM to 4:30 PM).? January dates are now available. If you couldn't make it in November or December, here is your chance to sign up for our January session!? Please check our Eventbrite page for updates on upcoming workshops throughout fall 2015 and winter 2016!"
}