{
    "addr": "655 West 34th Street New York, NY 10001", 
    "title": "Small Business Expo 2016 - New York City", 
    "url": "http://www.eventbrite.com/e/small-business-expo-2016-new-york-city-registration-17927585892?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2016-06-09T09:30:00-04:00", 
    "endtime": "2016-06-09T16:00:00-04:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "Small Business Expo ?is THE largest & most anticipated business-to-business networking event, trade show & conference for business owners, entrepreneurs & decision-makers. ?If you are serious about your business, this Expo is a \"MUST ATTEND EVENT.\" ? FREE TO ATTEND! REGISTER TODAY. Your FREE badge gives you full access to the Exhibitor Hall &? 20+ Business Critical Workshops . ****WANT TO EXHIBIT?? Call us today at 212.404.2345*** ? Small Business Expo ?is the most anticipated networking event of the year for business professionals to learn about products & services to help their business exceed its goals, network with other industry professionals & attend informative and cutting-edge workshops & seminars. If you are a business owner, entrepreneur or someone that works for a small business you should attend this trade show & conference. ? WHY ATTEND? ? WANT TO EXHIBIT & SELL TO THOUSANDS OF BUSINESS OWNERS? If your product/service targets small business owners, exhibiting at this show is a must. Nowhere else can you reach thousands of business owners and make on-the-spot sales! ? Call us at 212.404.2345 or? VISIT OUR EXHIBITOR PAGE . FAQs Is there a dress code? Dress code is business casual. Is there an age limit to enter the event? Attendees must be 18 or older to attend Small Business Expo. What are my parking options at Javits Center? There is no on-site parking at the Javits Center. ?However, there are many parking garages in the vicinity. ?The average price for event day parking usually starts at around $50 per day and is subject to change depending on the Center's activity. ? CLICK HERE  for a listing of parking garages. Where can I contact the organizer with any questions? Please contact  clientservices@theshowproducers.com Can I update my registration information? Yes, you may do so onsite at Registration ?the day of the show. Do I have to bring my printed ticket to the event? No, you can print your badge onsite at Registration ?the day of the show. What is the refund policy? Per our company policy, there are NO refunds. The name on the registration doesn't match the attendee. Is that okay? Yes, you may update this information onsite at Registration the day of the show."
}