{
    "addr": "175 Varick street new york, NY 10014", 
    "title": "Makeup Master Class with Luigi Chamorro at NYC", 
    "url": "https://www.eventbrite.com/e/makeup-master-class-with-luigi-chamorro-at-nyc-tickets-19594158656?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-11T12:30:00-05:00", 
    "endtime": "2015-12-11T17:00:00-05:00", 
    "categories": [
        "new york, NY Events", 
        "Class", 
        "Fashion"
    ], 
    "desc": "MAD ( Fashion+art+desing) ? is now taking over NYC and as a first appearance in the city we want to bring you girls an exclusive Makeup Master Class by the hand of one of the best Makeup artists in Venezuela, and now internationally working in Miami, and Texas, ? Luigi Chamorro . New York City is his next stop and we have the pleasure to invite you to this event, main goal of the class is get you ready to look fabulous in this upcoming holidays. \n The event will be happening this two dates: \n 11th and 12th of December? \n Evening Agenda \n 12:30 pm ? - Presentation Luigi Chamorro at the Screening Room Theater, opening hour and networking (includes an evening cocktail per person) \n 1:00 pm ? - All about skin care: a 1 hour forum to discuss?skin care, beauty products and health related issues.?Lotions, eye creams, skin treatments, and more! A discussion area related to?skin care?and tips, just for you. \n 2:00 pm ? - Contouring and Strobing: We are going to teach your everything you need to know about it so you finally master your contouring skills, easy steps?to help sculpt and define your face angles. \n 3:00 pm ? - One whole hour with Luigi teaching you everything about daily makeup \n ***Short break and Snack: We will cater some food and fresh beverages for our students \n 4:00 pm ? - We want to tell you all the secrets about night makeup, so you are completely ready for these upcoming glamorous nights.? \n 5:00 pm ? - Closing. Ask any extra questions, extra tips. We will finalize our evening with the presentation of the certificates to the participants? \n FAQs \n Seating \n Seating is on a first come, first served basis. \n What are my transport/parking options getting to the event? \n Our location is in the heart of Soho, is an?office building in Manhattan?s vibrant and expanding Hudson Square submarket.??Easily accessed by major subway lines [C, A, 1]. If yor are driving find your parking spot ahead at ? ParkWhiz.com ? \n To know more about the space visit?http://www.yelp.com/biz/wework-soho-west-new-york \n Is my registration/ticket transferrable? \n Yes. If you are no longer able to attend and wish to transfer your ticket to another guest, please be sure to update the registration information on your Tickets page with the new guest's information. \n More info please don't hesitate to contact us to: mad.vzla@gmail.com"
}