{
    "addr": "226 W 52nd St New York, NY 10019", 
    "title": "New Year's Eve 2016 with a direct view of the Ball Drop (Times Square)", 
    "url": "http://www.eventbrite.com/e/new-years-eve-2016-with-a-direct-view-of-the-ball-drop-times-square-tickets-15861804083?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-31T21:00:00-08:00", 
    "endtime": "2016-01-01T03:00:00-08:00", 
    "categories": [
        "New Years Eve", 
        "Party or Social Gathering"
    ], 
    "desc": "The best New Years experience New York has to offer! ? CHECK OUR VIDEOS! ? ? ?? ? The newly-redesigned sophisticated and hip Novotel New York Times Square invites only a select few to experience the electricity of New York City. Come celebrate New Years in style on our private heated outdoor rooftop with the most amazing view of the Ball Drop. ? Event Details: (1) 18 and over (16 or older with an accompanying parent). You must be 21 or over to drink.  (2) Dress code: New Year's Eve Best - no jeans, caps or sneakers. Jackets required for men.  (3) Refund and cancellation policies: all sales are final and non-refundable.  (4) Complimentary access to upper section of the terrace for Novotel guests. ? OPTION 1 - PREMIUM WINDOW PRIVATE TABLE:? Your window table in a private area with direct views of the Ball Drop? Open bar (8.15PM-3AM) - Includes bottle of Dom Perignon Champagne at your table Hors d?oeuvres and sweets to go with our famous midnight Champagne toast Priority entry at 8.15PM  VIP access to the heated South Terrace with direct view of the Ball Drop  Large selection of fun party favors and Supernova blanket included ? OPTION 2 - PREMIUM PRIVATE TABLE:? Your table in a private area with direct views of the Ball Drop Open bar (8.30PM-3AM) - Includes bottle(s) of Champagne at your table Hors d?oeuvres and sweets to go with our famous midnight Champagne toast  Priority entry at 8.30PM VIP access to the heated South Terrace with direct view of the Ball Drop Large selection of fun party favors and Supernova blanket included ? OPTION 3 - MAIN FLOOR PRIVATE TABLE: Your table in a private area Open bar (8.45PM-3AM) - Includes bottle(s) of Champagne Hors d?oeuvres and sweets to go with our famous midnight Champagne toast Priority entry at 8.45PM VIP access to the heated South Terrace with direct view of the Ball Drop Large selection of fun party favors and Supernova blanket included ? OPTION 4 - INSIDE PARTY & DANCE FLOOR (NO TABLE): No table included Open bar (9PM-3AM) Hors d?oeuvres and sweets to go with our famous midnight Champagne toast Entry at 9PM VIP access to the heated East terrace with direct view of the Ball Drop Large selection of fun party favors included ? OPTION BOOTH - PRIVATE OUTDOOR HEATED BOOTH WITH TABLE: $10,000 per booth (up to 4 people) Unique private outoor booth with DIRECT VIEW of the ball drop Open bar (9PM-3AM) Hors d?oeuvres and sweets to go with our famous  midnight Champagne toast with a bottle of Dom Perignon Entry at 8.15PM VIP access to the heated South Terrace with direct view of the Ball Drop Large selection of fun party favors and Supernova blanket included ? GROUPS: ? For groups (10 guests or more) and for private spaces, please contact us ? OPERATING CHARGES: In the amount of 28.875% represents :? (1) 20% gratuities and service charges: 15% of the operating charge is provided to the service staff as a gratuity, t he remaining 5% is retained by the house and used to offset certain direct and indirect administrative and operational costs associated with the New Year's Eve Party.? (2)? 8.875% combined City and State tax ? FLOORPLAN: OPTIONS DETAILED: ? ? ? ? ? ? ? ? ? Refund and cancellation policies: ? all sales are final and non-refundable."
}