{
    "addr": "Pier 61 New York, New York 10011", 
    "title": "HLNY Holiday Party and Induction of 2016 Chapter Officers and Board Members", 
    "url": "http://www.eventbrite.com/e/hlny-holiday-party-and-induction-of-2016-chapter-officers-and-board-members-tickets-19308912477?aff=ebrowse", 
    "location": "New York, United States", 
    "starttime": "2015-12-01T18:00:00-05:00", 
    "endtime": "2015-12-01T21:00:00-05:00", 
    "categories": [
        "Non Profit \\u0026 NGOs", 
        "Seminar or Talk"
    ], 
    "desc": "HLNY Holiday Party and Induction of 2016 Chapter Officers & Board Members Please join us for the annual HLNY Holiday Party as we celebrate the season and formally introduce our newly elected board members.? ? 6:00pm:? Networking & Holiday Party ? ? DIRECTIONS: When arriving at Chelsea Piers, enter at Pier 61 and follow signs for Sky Rink and Sunset Terrace. If driving, park anywhere on Pier 61 for the closest spot. You will then come to an elevator that you should take to the 2nd floor of Sky Rink. Follow signs for Sunset Terrace.  More Info ? ? ? IMPORTANT NOTE :  Although this event is free, we ask that you notify us of any cancellation at least 48 hours prior to the event to ensure all our members have an opportunity to attend and so that we can plan appropriately to provide a wonderful event for all. ? ? **Due to limited seating for this event, please register early to reserve your spot.** Photo/Video Disclaimer Policy: ?By registering for this event, you agree to allow HLNY to use any photograph/video taken at the event, without the expressed written permission of those included within the photograph/video. HLNY may use the photograph/video in publications or other media material produced, used or contracted by HLNY including but not limited to: brochures, invitations, books, magazines, websites, etc.? Any person desiring not to have their photo taken or distributed must contact? us? of his/her intentions. HLNY may decide to remove the photo or conceal the identification of the individual in question. ? ? ? This and all our programs and events are made possible by the generosity of our 2015-2016 HLNY Corporate Sponsors?who are ardent supporters of the healthcare executive profession."
}