{
    "addr": "New York, NY 10017", 
    "title": "Visit the United Nations Headquarters in New York", 
    "url": "http://www.eventbrite.com/e/visit-the-united-nations-headquarters-in-new-york-tickets-19343088699?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-10T09:30:00-05:00", 
    "endtime": "2015-12-10T13:00:00-05:00", 
    "desc": "The   invites you to a Guided Tour and Briefing at the newly renovated Headquarters of the United Nations. This will be an exciting opportunity to discover and get a behind-the-scenes view of the Organization at work on its 70th anniversary. ? Guided Tours offer an engaging way to explore the United Nations Headquarters. You will be taken on a journey through the corridors of international diplomacy. You will learn about the history and structure of the United Nations and will visit the newly renovated General Assembly Hall, the Security Council Chamber, the Trusteeship Council Chamber, and the Economic and Social Council (ECOSOC) Chamber in the renovated Conference Building. Learn about how the United Nations addresses issues such as disarmament, peace and security, and human rights. Following the Guided Tour attendees will receive a briefing by a United Nations expert who will provide an in-depth look into the latest issues on the UN's agenda. The briefing will provide an understanding of and appreciation for the complex nature of the United Nations and the work that it does.   Join fellow alumni and guests after this event at 1:00 pm for a buffet lunch in the Delegates Dining Room. The buffet lunch is $38 per person excluding tax and tip payable at the dining room.? If you would like to make a reservation for lunch, please email Jack McLaughlin by November 30 at  .   9:30am - 12:45pm 9:30am - Check in at security 10:15 to 11:15 - Guided Tour 11:45 to 12:45 - Briefing Host to kings, queens, presidents, prime ministers, ambassadors, delegates, and other international dignitaries the Delegates Dining Room at the United Nations is an exceptional setting for a truly unforgettable ebvent. The Delegates Dining Room offers a unique, upscale dining experience with its award winning and globally inspired cuisine, accompanied by world-class service with breathtaking views of the East River and city skyline.  UN Headquarters, General Assembly Building, 46th Street and 1st Avenue, NY.  A government-issued ID is required for anyone 16 years of age and older. Public transportation is recommended. Visitor parking is not available at the United Nations. However, parking lots are available on nearby streets. $20/Member $20/Member guest (limit one) $30/Non-Member alumni $30/Non-Member alumni guest (limit one) $45/Non-Alumni  Jack (John P.) McLaughlin '65 If you have trouble registering, please contact Som at som@hbscny.org or 347-817-7896."
}