{
    "addr": "237 W 42 St New York, NY 10036", 
    "title": "Frank Sinatra Centennial Birthday Celebration with THE RAT PACK feat. SINATRA, SAMMY, DINO & MARILYN - 7:30PM Show", 
    "url": "http://www.eventbrite.com/e/frank-sinatra-centennial-birthday-celebration-with-the-rat-pack-feat-sinatra-sammy-dino-marilyn-tickets-19188321787?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-11T19:30:00-05:00", 
    "endtime": "2015-12-12T21:00:00-05:00", 
    "categories": [
        "Blues \\u0026 Jazz", 
        "Concert or Performance"
    ], 
    "desc": "In the early '60s, Frank Sinatra, Sammy Davis Jr., Dean Martin and Marilyn Monroe made history when they teamed up in Las Vegas. Their carefree antics on stage became legendary and earned them the nickname \"The Rat Pack.\" To this day, audiences can't get enough of these performers. Tonight, Sinatra and Friends bring the Rat Pack legend to life! The show runs for 90 minutes with no intermission and features classic Rat Pack favorites like \"That's Amore,\" \"New York, New York,\" \"Diamonds are a Girl's Best Friend,\" \"Mr. Bojangles,\" \"My Way,\" and many more. These outstanding performers will transport you back to a time of smoky Vegas lounges as you sing along to these timeless classics. When they take the stage, these performers capture not only the sound of Frank, Sammy and Dean, but their charisma, charm, and chemistry as well. It's pure magic - be a part of it! JESSE POSA (Frank Sinatra) Jesse Posa has recently appeared in Phillip Carlo's Off-Broadway production of East of Evil, starring Frank Vincent and Tony Sirico. He has performed as Frank Sinatra in various corporate events and private parties and also recently appeared as the legendary crooner on stage at Radio City Music Hall for the industrial launch of Tahitian Noni. LLOYD DIAMOND (Sammy Davis Jr.) Lloyd Diamond has appeared at the Comic Strip, Stand Up New York, Caroline's, the New York Comedy Club, and the Boston Comedy Club. He's appeared on the Comedy TKO segment on Showtime at the Apollo, Good Morning America's Make Us Laugh All Night Long Competition, and Chappelle's Show. He also recently appeared on Jane Hanson's New York on NBC. He recently portrayed Sammy Davis Jr. in Sandy Hackett's Las Vegas revue A Tribute to The Rat Pack. JOE PERCE (Dean Martin) Joe Perce was the 1987 CLEO Award Winner for Best Male Performer in a Commercial, advertising a Pontiac Trans Am. He has also appeared in dozens of other commercials. His credits include 25 years of improvisational comedy with such groups as The First Amendment, Chicago City Limits, Comedy Mind Spill, Comedy Olympics, and Assorted Nuts. He was voted the Best Improvisational Comic of 1989 by Backstage Magazine.? KRISTI COOMBS (Marilyn Monroe) Kristi Coombs began working in musical theatre at the age of seven, playing the role of Molly in the 1st National Touring Company of Annie. She was later elevated to the role of Annie in the 2nd National Touring Company. After touring around the country for four years, Kristi made her Broadway debut at the age of eleven, playing a young Norma Jean in \"Marilyn. An American Fable.\" Upon receiving her BFA from Montclair State University, Kristi began a career as an adult. She is honored to have worked for the Department of Defense performing for troops overseas, and continues to perform and choreograph for the USO of Metropolitan New York. Kristi is a familiar New York City entertainer whom you may have seen performing with The Cab Calloway Orchestra at The Rainbow Room, or in This Joint is Jumpin' and Frank and Friends, playing Marilyn Monroe at The Supper Club. Other credits include Kicks, Ready or Not, The Little Prince, Legends in Concert, A Christmas Carol, Flashback, HBO's popular Sex and the City, Lois on \"Guiding Light,\" and the Showtime Documentary film \"Life After Tomorrow.\" Miss Coombs also works behind the scenes as Assistant Program Director and Dance Department Head for Broadway Artists Alliance, a NYC musical theatre training program for promising young artists."
}