{
    "addr": "247 West 37th Street New York, NY 10018", 
    "title": "Destiny Pub Event: New York City", 
    "url": "http://www.eventbrite.com/e/destiny-pub-event-new-york-city-tickets-19472872887?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-11T21:00:00-05:00", 
    "endtime": "2015-12-12T00:00:00-05:00", 
    "categories": [
        "Gaming", 
        "Party or Social Gathering"
    ], 
    "desc": "Come join fellow? Destiny ?and Bungie fans in a night of camaraderie and competition!? Destiny Pub Event  is a free, unofficial, 21+ event starting at 9:00pm on Friday, December 11, 2015 at  Stitch Bar & Lounge  in New York City.? Destiny Pub Event  is a community-organized event that is uniquely characterized by hosting a variety of activities in addition to the usual socializing. Our event is not officially sponsored by Bungie. Planned activities include: Cryptarch's Quandary  - a packet of puzzles fireteams are to solve (e.g. word puzzles, ciphers, etc.). Puzzles are multifaceted and will require a healthy amount of brainwork.? Quiz of the Exile  - a  Trials of Osiris -themed pub quiz in which fireteams are asked a series of 20 questions based on the Destiny video game and grimoire. Teams will write their answers upon Passage Cards, which will be scored using a similar system to the in-game cards.? Other things ?-?There'll also be things like Destiny Pictionary, a survey, and a themed drink menu! Please contact  info@destinypubevent.com  for any questions or concerns. If you're interested in becoming a volunteer for Destiny Pub Event, please contact  nyc@destinypubevent.com !? Note about minors: ?A \"handful of minors\" (anyone under 21) are allowed into the event as long as they are accompanied by their parent. Please contact  nyc@destinypubevent.com  if you are a parent and plan on bringing your underage child. Links: Destiny Pub Event on Twitter ?-  Destiny Pub Event NYC Twitter Destiny Pub Event on Facebook ?-  Facebook Event Page"
}