{
    "addr": "35 West 4th Street New York, NY 10012", 
    "title": "CAST Presents The Motherf*cker with the Hat", 
    "url": "https://www.eventbrite.com/e/cast-presents-the-motherfcker-with-the-hat-tickets-19666023606?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-11T21:00:00-05:00", 
    "endtime": "2015-12-11T23:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Performance", 
        "Arts"
    ], 
    "desc": "The College of Arts and Science Theater is proud to present... \n The Motherf*cker with the Hat  by? Stephen Adly Guirgis \n The Motherf*cker with the Hat, is a dark comedy that takes audiences on a journey, as we see the life of a recovering addict unravel. We follow five individuals on their quest to find a way to connect with one another in the streets of New York City. USA TODAY calls this play, \"Funny indeed- not to mention surprising, disturbing and poignant...dark, rich comedy...By not putting characters or their dilemmas in neat boxes. Guirgis gives us, in HAT, a slice of hard life that's as provocative as it is absorbing.\" \n \n All performances will take place in 35 West 4th Street, room 779 at the following dates and times: \n Friday, December 11th at 9pm \n Saturday, December 12th at 8pm \n Sunday, December 13th at 8pm \n Please note, you will need an NYU ID or Government-issued ID to enter the building. \n You do not need to print your ticket for entry. Patrons not checked in by showtime will be subject to have their tickets released to the wait list. \n There will be a wait list at each performance starting half an hour prior to curtain. Unclaimed tickets will be released to the wait list on a first come, first serve basis.? \n Run time is approximately 1 hour 45 minutes with a 10 minute intermission. \n \n \n FEATURING:  Nick DeMasi,? Toni Gallardo,? Trevor Hayes,? Alexia Martin, and? Benjamin Puvalowski \n Director: Jessie Delgado \n Producer/Production Manager: Madeline Pursell \n Production Stage Manager: Allie Neeson \n Assistant Director:? Shawn Thibault \n Stage Manager:? Andres Osorio \n Lighting/Sound Designer:? Hadley Todoran \n Set Designers:? Sarah Kahn &? Cha Patra-Yanan \n Costume Designer/Property Master:? Olina Stathopoulou \n Makeup Supervisor: Alyssa Mora \n Marketing Director:? Cassidy Graham \n Graphic Design: John Bautista \n Production Assistants: Hannah Doctoroff & Judith Moy \n \n Follow us on Instagram:? mfwthinstas \n Add us on Snapchat: mfwth snaps \n Please email cast.club@nyu.edu with any questions or concerns! \n CAST (College of Arts and Science Theater) is a student-run club open to pupils from any NYU school and major. We are dedica ted to providing opportunities for students to get involved in any and all aspects of theater, be it performing, directing, designing, writing, etcetera! Our goal is to put on a variety of performances throughout the Fall and Spring semesters, from musical revues and one-act play festivals to productions of full-length plays and musicals. We'd love to have YOU take part in our next production, be it backstage, onstage, building us a stage, or what ever! We are all about having fun while achieving a high-quality show. \n CAST'S infamous motto: \"We take what we do seriously, but we don't take ourselves seriously.\" \n https://www.facebook.com/NYUCAST/ \n http://nyucast.blogspot.com/"
}