{
    "addr": "345 West 35th Street New York, NY 10001", 
    "title": "WISE Economic and Empowerment Symposium & REIA NYC Recognition Ceremony", 
    "url": "http://www.eventbrite.com/e/wise-economic-and-empowerment-symposium-reia-nyc-recognition-ceremony-tickets-15224811822?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-12T08:00:00-05:00", 
    "endtime": "2015-12-13T18:00:00-05:00", 
    "categories": [
        "Real Estate", 
        "Class, Training, or Workshop"
    ], 
    "desc": "WISE Economic and Empowerment Conference and? REIA NYC Recognition Ceremony Business, Mindset & Real Estate ? TOPICS ? How to set up your business right and fast track it to create $$$ ? How to build your business Power Team ? How to master your mindset and master your money ? How to analyze a deal and know you?ll make money ? How to bring in the private capital to fund business deals ? How to find the right buyer for your property ? How to manage attorneys and title companies and close ? How to systematize your business and do it over and over again ? How to identify Real Estate Markets and the market shifts ? How to qualify for limitless real estate with Investment Financing ? How to protect your wealth with Asset Protection ? Done-For-You Real Estate Models ? How to leverage your personal and business credit to create more opportunities ?How to find partners and form strategic partnerships for your Real Estate Game Plan HIGHLIGHTS DIDN''T MEET YOUR BUSINESS GOALS IN 2015? NO PROBLEM!!! Finish Strong - Create Your 2016 Blueprint? This will be a very strategic meeting for like-minded individuals who strive to improve their financial and real estate outlook for the New Year with focused mastermind discussions make the best possible and most informed real estate and investment decisions in 2016 and beyond. ? Create, Manage, Protect, and Grow Wealth in 2016 & Beyond ? Guest List Includes:? Attorneys, Investors, Realtors, Mortgage Brokers/Bankers, Business Owners, Title Companies, Insurance Brokers, Self-Direct IRA Professionals, Short Sale Specialists, Wholesalers, Hard Money & Private Money Lenders and YOU! Together we will get specific action steps to follow to allow us to Get Focused, Get Organized, Get Off the Fence and Get Going in 2016; Gain tips, tools & resources and Build a solid starting point for your investing business! Receive a Fast Track Real Estate and Business Blueprint as a gift from us and contracts to do these deals."
}