{
    "addr": "244 West 54th Street. Penthouse 1. New York, NY 10019", 
    "title": "Accent Talent Child Modeling Workshop", 
    "url": "http://www.eventbrite.com/e/accent-talent-child-modeling-workshop-tickets-16400014886?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-12T10:00:00-05:00", 
    "endtime": "2015-12-12T18:00:00-05:00", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "If you have ever even thought about wanting to get your child/teen into the exciting world of modeling and entertainment, ?THIS is where you need to be!? Charles Sanabria has built relationships with some of NY's top talent agencies and has years of experience managing his own children as well as others: ?? ? \"Charles has been wonderful to work with, both as an educated parent and as a highly recommended Photographer to my talent. His knowledge of the business has helped his children succeed and his expertise makes him a pleasure to deal with. Knowing what goes on behind the scenes is something all parents need to learn and understand in order to have a positive experience in this very competitive business. Knowing what questions to ask and how to find the best representation for YOU, is the key to success.? ? ? Kerri K. ~ Agent, Commericals/Print ? C.E.S.D Talent ?NY ? ? WORKSHOP PT. 1. 10:00 am to 11:30 am You will spend the first portion of the day learning everything you need to know to get started and get your child in including the following:? ? ?? Avoiding scam agencies and ?talent scouting? workshops ? Know the top agencies in your area are and how they work/what they?re looking for ? Understanding the business aspects of the modeling world ? How ?go-sees?, ?call backs? & castings are handled ? How to get the right photos for your child/teen and not be talked into pricey portfolios ? How to protect & invest your child/teen?s finances and understanding Coogan?s Law ? How to mange the stresses of getting your child/teen to go-sees and jobs ? Managing your child?s education & school work when jobs become frequent ? Go-see & casting / audition techniques & advice to get the jobs ? Understanding agency contracts ? Understanding SAG/AFTRA ? There will be a quick break between 11:30 am to 12:00 pm ? ? WORKSHOP PT. 2 ?12:00 pm to 6:00 pm? The second part of the day is where the fun begins and your child/teen gets in front of the camera for a professional photo. ?They'll be given the opportunity to understand how a go-see/casting works and what's it's like to be on a professional set. ?They'll learn posing for the camera and how to give their very best when being photographed in a fast paced casting environment! ?As a parent, you'll see what goes on behind the scenes and get a solid grasp on the whole process. ?(Photos will include full professional retouching and be ready for print and online use.)? ? ? * ? ?  Children from 1 year to 18 years? ?** ? ?Only 1 parent per child/teen.? *** ? ?Limited to 25 tix per workshop  ? ? ? ? (add'l tix to be carried over to second day workshop on 1st come basis)"
}