{
    "addr": "Central Park West New York, NY 10023", 
    "title": "CORE & BREATHING FOR RUNNERS BY FITNESS RUNS", 
    "url": "https://www.eventbrite.com/e/core-breathing-for-runners-by-fitness-runs-tickets-19513632801?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-12T09:30:00-05:00", 
    "endtime": "2015-12-12T11:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Class", 
        "Sports & Fitness"
    ], 
    "desc": "CORE & BREATHING FOR RUNNERS \n \n Having a strong core can improve your running posture, speed?and keep you injury free. It?s not all about sit ups. Actually?sit-ups can make you a worse runner. \n Your core muscles connect your trunk, pelvis and spine to each other and to the rest of your body, including your hips, legs and shoulder blades. This is why just doing sit-ups doesn?t make up a full core-training workout and won?t fully stabilize your core which is needed for runners. \n WHAT YOU WILL LEARN \n \n 4 most important core exercises for runners \n Learn how to activate your core while running \n Reduce lower back pain while running \n Increase your speed with a stronger core \n \n \n \n \n \n \n WHO SHOULD ATTEND: \n \n \n Any and all fitness enthusiasts who enjoy working out and burning calories and being healthier \n Beginner runners can learn good form from the start to avoid injuries in the future. \n Advance and seasoned runners can use it as a tune up. It's easy to pick up bad habits, having a professional give you advice and answer your questions can help you get to the next level. \n Run club members; Although your running with a group it only takes one member that you follow or copy to make you run incorrectly. \n \n \n Workshops, like our classes, are small?and more personalized making it?easier for you to learn and ask questions in a safe and supportive environment. You will get lots of personal attention and enjoy a rich learning experience at this workshop \n *Everyone will receive one FREE Fitness Runs class to test out your new learned skills (a value of $29) \n Hope to see you in class! \n Nathaniel Oliver"
}