{
    "addr": "1000 5th Ave New York, NY 10028", 
    "title": "Future Health NOW", 
    "url": "http://www.eventbrite.com/e/future-health-now-tickets-8507914401?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2031-05-06T09:00:00-04:00", 
    "endtime": "2031-05-06T21:00:00-04:00", 
    "categories": [
        "Other Entertainment", 
        "Fundraisers", 
        "Film, Media \\u0026 Entertainment", 
        "Other"
    ], 
    "desc": "Revive Primary Care and Agent of Change are excited to announce the most anticipated health event of the century---and you?re invited! Join us on May 6, 2031 as we celebrate America being crowned the world?s healthiest nation. Where We Stand in 2013 ? American healthcare is in crisis. We spend more than twice as much on healthcare as other nations, and yet we lag behind all the other industrialized countries in life expectancy and a range of other health indicators. And our future is even more alarming - we rank 44 th  in infant mortality, one in 50 children are diagnosed with autism, and one in six children have some developmental delay. ? So, what will it take for America to become the world's healthiest nation by 2031?? ? Significant change. ? Not just by government, not just by business, but by all of us working together towards a common goal, and what better goal than being the healthiest nation on Earth?? ? We don?t pretend to have all the answers. But we?re confident that by tapping into the innovation, excitement, and understanding of those dedicated to healthy change, we can work together to achieve this vision. ? Over the next 18 years, we will ask complex questions, work hard, and highlight the efforts of individuals, doctors, organizations, and disruptors making a positive impact in health, technology, and wellness. ? Set a new intention. Create a new tomorrow. Where to Start 1.  Reserve your ticket today .? 2. Share it with your friends on Facebook. Later in the year, we will open nominations for organizations and individuals whose work is improving our local, regional, and national health. ? ? About the Organizers ? Agent of Change unites passion with purpose to positively impact you. As event producers and campaign managers we harness the dynamic relationships between creative talent, media, tech, and inspired thought to spark a wave of enlightened disruption. Learn more at ? www.aocnetwork.com Revive Primary Care combines a nationwide team of integrative physicians and allied health practitioners with a digital education platform. Their mission is to redefine the words  primary  and  care  as they relate to medicine, and catalyze a health  Revivolution . Find out more at www.reviveprimarycare.com"
}