{
    "addr": "632 Broadway. Suite 304. New York, NY 10012", 
    "title": "*2-Day Special Event ADVANCED Lighting Workshop Dec. 12-13*", 
    "url": "http://www.eventbrite.com/e/2-day-special-event-advanced-lighting-workshop-dec-12-13-tickets-19188071037?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-12T11:00:00-05:00", 
    "endtime": "2015-12-13T15:00:00-05:00", 
    "categories": [
        "Film", 
        "Class, Training, or Workshop"
    ], 
    "desc": "LIGHT & SHADOW: ADVANCED CAMERA & LIGHTING WORKSHOP?December 12 - 13 ?The BEST CINEMATOGRAPHY WORKSHOP in NYC!\" -? Mark Slupinski, Commercial Photographer / Filmmaker Enjoyed our Intensive Lighting Workshop? Thirsty for more knowledge? Well then you?re in for a treat. On? December 12th and 13th ?we will be hosting a special edition ADVANCED Lighting Workshop that takes the next step in all areas of film lighting. If you haven?t taken our Intensive Workshop, don?t worry, this Advanced class is still perfect for you! Be a lighting expert from this point on! HANDS-ON PRACTICES ?over textbook theories to achieve? Simple, Creative and Efficient ?shooting techniques without tons of equipment, budget, crew or time. Lighting isn't supposed to be brain surgery, but many filmmakers still make common mistakes. If you?ve been to one of our previous workshops, you?ll know that our method uses an intimate class with lots of HANDS ON EXPERIENCE over textbook theories to achieve SIMPLE, CREATIVE and EFFICIENT shooting techniques without tons of equipment, budget, crew or time. ? Learn To Light: ??? ??? ??INTERVIEWS ?& DRAMA ?? ???? ??MULTIPLE ACTORS ??? ????? Lighting for MOVEMENT ??? ??? ??WINDOW Lighting ??? ??? ??Lighting with COLOR & SHADOW ??? ??? ??OUTDOOR: Handling SUN & SHADE (Weather Permitting) ?? ???? ? DARK SKIN TONE ?? ???? ? And many more... Only the SECOND TIME this year that we will be holding this workshop and it is filling up FAST so DON?T MISS OUT.?ELIMINATE the MISTAKES and LEARN all the TRICKS! Produce the quality of a blockbuster film at the budget of an Indie. All this and more at our Advanced Lighting Workshop from? December 12-13 . Open up the new year with some awesome lighting skills, because lighting should never be the reason that your film fails! Don?t forget to check out our 5-Day Digital Filmmaking Workshop (Lighting Workshop included in 1st 2 days): www.solarnyc.com/digitalfilmmakingworkshop/ WHEN:? Dec. 12 - 13 (Sat & Sun) 11am - 3pm WHO: Narrative/Documentary Filmmakers FEE: $425 Includes Studio and Equipment INFO :? http://solarnyc.com/lightingworkshop VIDEOS :? http://www.youtube.com/user/LightandShadowGroup#p/u/3/1125Ne5GSks \"A practical, hands-on course that provides VERY USEFUL TOOLS & TIPS!\" -? Eva Zelig, TV Producer, EMMY AWARD WINNER LIMITED SEATING. Join us! Light it Right! Solar Film/Video Productions 632 Broadway, Ste. 304 New York, NY 10012 212?473?3040 W 212?473?3091 F www.solarnyc.com/lightingworkshop solarvideofilm@gmail.com"
}