{
    "addr": "33 W 17th St. Floor 6. New York, New York 10011", 
    "title": "Change Your Critical Inner Voice: Improve mood, self-confidence, and body image + gift bag valued at $100!", 
    "url": "http://www.eventbrite.com/e/change-your-critical-inner-voice-improve-mood-self-confidence-and-body-image-gift-bag-valued-at-100-tickets-19619891624?aff=ebrowse", 
    "location": "New York, United States", 
    "starttime": "2015-12-12T11:30:00-05:00", 
    "endtime": "2015-12-12T14:00:00-05:00", 
    "categories": [
        "Health \\u0026 Wellness", 
        "Seminar or Talk"
    ], 
    "desc": "Have you been told you?re too hard on yourself? Do you struggle with feeling anxious, depressed, or underconfident? Are you a? professional ?when it comes to finding flaws in your work and appearance, and beating yourself up? You?re in good company! So many of us have learned the language of self-criticism, thinking it?s the only avenue to success. We might notice it makes us feel crappy a lot of the time, but we figure even if we wanted to change it, we couldn?t. We think we?re stuck with this critical inner voice for life. We think it?s the ?way we?re programmed.? But you know what? That?s simply not true. Liberation from your critical inner voice is possible, and it starts here. Join Megan Bruneau, M.A. RCC and Katherine Greiner, NASM, RYT, BFA, in experiencing a transformation in the relationship to yourself.? We'll spend the first portion of this 2.5 hr workshop with Megan. You'll learn research-supported techniques proven to be effective in treating depression, anxiety, perfectionism, poor body image, low self-confidence, procrastination, and more.? Then, we'll put what we've learned into practice in an invigorating, all-levels yoga class led by Katherine. We'll wrap things up with snacks and refreshments to celebrate your transformation and mingle with your fellow \"transformees.\" You?ll walk away from this workshop with greater self-awareness, increased personal agency, and tools and tips for a more enjoyable existence! NOTE: Please bring a yoga mat if you have one! *YOU'LL ALSO RECEIVE A GIFT BAG FROM OUR SPONSORS, VALUED AT $100!* Hurry! Space is limited to 20 participants"
}