{
    "addr": "231 Norman Avenue. #310. Brooklyn, New York 11222", 
    "title": "My First Studio Band Experience", 
    "url": "http://www.eventbrite.com/e/my-first-studio-band-experience-tickets-19624604721?aff=ebrowse", 
    "location": "Brooklyn, New York", 
    "starttime": "2015-12-12T14:00:00-05:00", 
    "endtime": "2015-12-19T15:00:00-05:00", 
    "categories": [
        "Children \\u0026 Youth ", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Class Description This 2-session class on two Saturdays is designed for children who have always dreamed of experiencing a professional recording studio. In this introductory lesson, young musicians will get to experience being part of a band as they learn and play together. Both teachers, Yonit and Jacinta, are professional multi-instrumentalist musicians and will walk your child through the role of each instrument in a band and in a recording studio. We will also teach the basics of playing in an ensemble context.? See the class schedule below for more information. * After this class, we will develop a kids band class at this studio for those who are interested. We will? evaluate and understand the level and interest of each child and?organize groups according to the musical interests and capabilities. Teacher Profile Jacinta Clusellas Hi, my name is Jacinta. I am a guitarist, composer, singer and music teacher originally from Argentina, currently working in NYC. I am a graduate of Berklee College of Music, where I studied guitar performance and composition. I've been performing internationally and this year I released my first album of original music, which features a group of 16 musicians from 10 different countries. I am currently taking part in various productions throughout NYC including at Columbia University, the Consulate of Argentina in NYC, and other concerts of original music. I've also been teaching music to kids for the last 8 years. I love music, and I love sharing this beautiful experience with children. If you would like your kids to experience music from an early age, while stimulating their minds and learning Spanish, join me on this adventure! Yonit Spiegelman Hi! I am Yonit Spiegelman, I am a bassist, composer, producer and educator originally from Israel. I?ve been in the music-education world for over seven years and had been teaching in Conservatories, privately, and at Berklee College of Music?s youth program ?Day Sessions?.? I have great performance record including performing with the best Israeli musicians and recordings for Israeli national radio stations and performing alongside amazing international musicians at both USA and Europe.? I am currently performing across the US East Coast with my own band 'Foreign Hues' ?as well as teaching in half a dozen educational institutes in NYC. I love teaching music to any child who shows interest, while revealing him/her to new and exciting genres, working on technique, creating a respectful creative environment to work with and many more, always respectful and sensitive to students needs and wants."
}