{
    "addr": "33 W 17th St. Floor 6. New York, New York 10011", 
    "title": "Reclaim Your Power Around Food: Master the skills you need for a healthy relationship to food and your body + gift bag valued at $100!", 
    "url": "http://www.eventbrite.com/e/reclaim-your-power-around-food-master-the-skills-you-need-for-a-healthy-relationship-to-food-and-tickets-19307741976?aff=ebrowse", 
    "location": "New York, United States", 
    "starttime": "2015-12-12T16:00:00-05:00", 
    "endtime": "2015-12-12T18:30:00-05:00", 
    "categories": [
        "Health \\u0026 Wellness", 
        "Seminar or Talk"
    ], 
    "desc": "91% of women are 53% of men are dissatisfied with their bodies, and for so many of us, a volatile relationship with food comes along with that. Our mood is heavily influenced by the number on the scale in the morning, and whether or not we make ?good? food choices throughout the day. We believe that if only we were to lose 10 lbs? then ?we?d be happy. Our relationships would be better. We?d be more respected at work. We try various detoxes and diets, hoping to change our bodies into an ?worthy? form. But inevitably, we binge, we ?slip up,? we fall off the wagon and into a place of shame. And our critical voice is there on our shoulder the whole way, judging our every move. Guess what? You? can ?free yourself from the body-image prison..and the irony? Many people actually? lose? weight in the process, because they no longer eat emotionally. Join Megan Bruneau, M.A. RCC for a safe, nonjudgmental opportunity to learn how to change your relationship to food and your body. Megan specializes in teaching people how to let go of destructive and self-sabotaging thoughts and behaviors?skills she?s learned through personal experience: after a lifelong struggle with eating disorders, depression, and anxiety, Megan stumbled upon self-compassion and found a freedom she didn?t think possible. In this intimate 2.5 hr workshop, you?ll learn research-supported techniques for breaking free of the anxiety, guilt, and shame around food and your body. You?ll walk away with improved self-awareness, greater self-acceptance, and tools for regaining your personal power around food! ? *PARTICIPANTS WILL RECEIVE A GIFT BAG VALUED AT $100!* Hurry! Space is limited to 15 participants"
}