{
    "addr": "2296 FREDERICK DOUGLASS BLVD New York, NY 10027", 
    "title": "FREE NEW YEARS EVE PARTY WITH FASHION SHOW", 
    "url": "http://www.eventbrite.com/e/free-new-years-eve-party-with-fashion-show-tickets-15879594294?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-31T19:30:00-05:00", 
    "endtime": "2016-01-01T01:00:00-05:00", 
    "categories": [
        "Fashion \\u0026 Beauty", 
        "Party or Social Gathering"
    ], 
    "desc": "This is our 4th annual FREE New Year?s Eve Party sponsored by Fashion Avenue News Magazine.? It will be held at the beautiful Aloft Hotel part of the W Fashion chain of hotels.? Join us for a night of Fashion & Fun on New Year?s Eve.? Where else can you go for FREE. ?There will be a Mini Fashion, pumping dance music from every era, fun, fun, fun.? Bring everyone, get your FREE tickets before we SELL OUT.? Come early and leave late, it's going to be a blast. Food and drinks are reasonable.? We will be joined by: Sofia Davis, Editor-in-Chief of Fashion Avenue News Magazine, Haviic Cosmetics, UBM Fashion Week Models, Keri Singleton Radio Show, Enspire Magazine, Quinton \"Master Baker Chef\" Bailey, Vera Moore Cosmetics, Designer Phil Harris, Ja'Dee Murphy, Kenya Smith of Motor Sports Designs, and many, many more.? It's a positive atmosphere where you can have fun and bring in the New Year right.? We have the Champagne sip at the stroke of midnight and the ball drop.? DON?T DRINK & DRIVE, reserve your hotel room NOW?? Aloft Harlem - 2296 Frederick Douglass Boulevard, New York, NY 10027 - Phone:(212) 749-4000 Dress Code:? UPSCALE ? Any Men in TUXEDOS can go to the FRONT OF THE LINE, no waiting.? No JEANS OF ANY TYPE, no matter what they cost. YOU MUST BE A MINIMUM OF 21 YEARS OLD TO ATTEND THIS EVENT, NO EXCEPTION THEY WILL CARD YOU AT THE DOOR.? NOT EVEN IF YOU HAVE YOUR PARENT WITH YOU.? We are the Friendliest Fashion People in the Fashion Industry, you will have a GRAND TIME!!!! In order to continue bringing you FREE New Year?s Eve events, we request you respect the 2 Drink Minimum please.? MUST BE 21+ TO ATTEND THIS EVENT Visit our website and see photos from last New Year?s. www.fashionavenuenews.com"
}