{
    "addr": "4 West 43rd Street New York, NY 10036", 
    "title": "2016 MISS LATIN UNIVERSE", 
    "url": "https://www.eventbrite.com/e/2016-miss-latin-universe-tickets-18995509079?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-12T15:30:00-05:00", 
    "endtime": "2015-12-12T21:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Attraction", 
        "Charity & Causes"
    ], 
    "desc": "MISS LATIN UNIVERSE/NUESTRA BELLEZA MUNDIAL?is a non-profit organization and a talent institution for young ladies who are trained to discover their talent. Whether their talent is to act or dance, the organization teaches these young, beautiful and talented girls how to walk the run-way, diction, etiquette and protocol and most importantly how to succeed in this challenging world.? \n ? \n MISS LATIN UNIVERSE/NUESTRA BELLEZA MUNDIAL?provides a networking environment, and bring families together of different cultural backgrounds that support this event. We strive to help the development of the Multicultural community by promoting professional local businesses and strengthening its ties to Corporate America as well as expanding the reach of diversity of consumers for Corporate America. \n ? \n Women compete with hope of advancing their careers, personal and humanitarian goals, and as women who seek to improve the lives of others. worldwide will broadcast the event on cable networks and internet streaming. Therefore, promoting our culture, and serve as the best link of Corporate America to reach the rapidly growing OUR community. \n ? \n Every year the organizers of MISS LATIN UNIVERSE?contribute to non-profit organizations, such as the American Cancer Association. This year they will host an event to contribute and support one of their sixteen year partnerships with renowned physician Dr. Almanzar. In this contribution, the organization will help Dr.Almanzar?s organization ?Operation Smile?, also known as ?Labio Leporino?.? \n FOLLOW US: \n \n Twitter?@reina_nuestra? \n Instagram?@reina_nuestra? \n Facebook?@Miss_Latin_World"
}