{
    "addr": "410 8th Ave. 2nd floor. New York, NY 10001", 
    "title": "Say What? NYC Second Saturday", 
    "url": "http://www.eventbrite.com/e/say-what-nyc-second-saturday-tickets-18275099314?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-12T18:00:00-05:00", 
    "endtime": "2015-12-12T20:00:00-05:00", 
    "categories": [
        "Comedy", 
        "Concert or Performance"
    ], 
    "desc": "Say What? NYC Comedy Improv began performing in NYC in July 2011. With 13 talented performers? and comedians in a rotating cast of 4-7 performers per show, each show is a fresh, fun experience. We play short-form comedy improv games as made popular by \"Whose Line Is It Anyway?\". We improv off of the audience suggestions. You may also see some dazzling new sketches a la the style of \"SNL\" and \"MadTV\". Come laugh your face off with our almost two hour long show!! The Blarney Stone serves up a mean, cheap drink... And the buffalo wings are to die for! You can't find something better to do on Saturday night!! ? FAQs When do doors open? How early can we show up? Doors open at 6:00pm. Our show will start at 6:30pm. You may show up earlier if you like, but you must wait downstairs in the bar. Please make sure you let the bartender/waitress know that you are here for the Say What? NYC show so they may accommodate?you better. ? Is seating assigned? May I sit anywhere? Seating if first come- first served. Please show up as soon as doors open to pick your favorite seat! Some of our seating is  communal.  Please let someone know if you need special accommodations. For our handicapped audience members, please email or call Say What? NYC in advance if possible, so we may pre-arrange for your comfort. ? Are there ID requirements or an age limit to enter the event? Our show is 18 to enter, 21+ to drink. Our show is audience based, and we encourage drinking- so please know that the show can sometimes get crazy! ? ? What are my transport/parking options getting to the event? We are right next to Penn Station and MSG. You can get to us by ACE trains, Amtrak and LIRR. Parking can be tricky sometimes due to Madison Square Gardens, but there are plenty of parking lots in the area. We like to find street parking on 8th ave between 25th and 31st streets. We are inside THE BLARNEY STONE- through the bar, up the back staircase to the 2nd floor. ? Are there any extra expenses? Our tickets are $10 per person. Each person has a two item minimum requirement to fill. The minimum can be met with food, drink or a combination of the two. Server gratuity will be included, so no need to bring a tip. ? What can/can't I bring to the event? Do not bring your own food/beverages. We encourage eating and drinking, so bring an appetite.? Bring your favorite current events or celebrity ideas. Also, anything you'd like to see a scene performed about. Lastly, bring your friends!! The better our audience, the better our show! ? Where can I contact the organizer with any questions? The best way is by emailing SayWhatNYCComedyImprov@gmail.com."
}