{
    "addr": "237 West 54th Street New York, NY 10019", 
    "title": "Battle In The Balkans: Fundraiser Dinner", 
    "url": "https://www.eventbrite.com/e/battle-in-the-balkans-fundraiser-dinner-tickets-19675584202?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-12T17:30:00-05:00", 
    "endtime": "2015-12-12T21:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Screening", 
        "Film & Media"
    ], 
    "desc": "Battle in the Balkans is a film that chronicles the Albanian National Team and their journey to their first ever qualification into a major tournament. The documentary captures moments with the team captain Lorik Cana, his team, and the Albanian people while on the road to the 2016 Euro Cup. Follow the Albanian National Team's rich history, national pride, and historic tensions as they rise in the world rankings on the way to the European Cup in 2016. \n After the disastrous match in Belgrade on October 14, 2014, Executive Producer Kreshnik Jonuzi saw an opportunity to tell a deeply engaging and emotional story of the Albanian National soccer team.?He shared the idea with Executive Producer Luftar Von Rama and the two got to work?immediately?on shaping the vision of the film. Luftar and Kreshnik brought on Zana Kaba to get started on budgeting, marketing and promoting the film.?The last piece to the puzzle was bringing in the Director, Charlie Askew. Charlie is a six time Emmy award winning director, who has created sports documentaries for the likes of HBO, NFL Films and ESPN. We have an amazing team and have come together because of our similar backgrounds, but most importantly because of our strong passion for making a compelling film.? \n Kreshnik, Luftar and Charlie flew to Albania and sat with the team every day the week before the rematch against Serbia. They filmed one-on-one interviews with the team, local media, town locals, coaches, political figures and more in order to capture content and build the bones of their film.? \n Less than 1 month after their first shoot, Luftar and Kreshnik produced the first trailer using their exclusive footage for Battle in the Balkans. The trailer was released wide on November 19 and has already garnered hundreds of thousands of views?and mentions across all media around the world. \n This trailer is the beginning of their marketing campaign and the team hopes to raise awareness of their upcoming film by inviting guests to learn more about the future of their film.?The support of the Albanian community thus far has been overwhelming and the Battle in the Balkans team hopes to continue to build their network and raise funds in order to continue production, film the team again this March, and follow them through the Euro Cup this June. \n The first event will be a seated dinner and presentation held on? December 12, 2015 ?at Empire Steak House in NYC. A special guest appearance will be made by one of the players from the Albanian National team, and immediately following the private dinner will be an after-party event that will be open to the general public. The goal of these events is to introduce the film, the production team, their plans on finishing the film. and continue to build relationships with fellow successful Albanians that will ultimately aid in the completion of this film that has never been done before in the Albanian community. \n We are proud to be working on an important story and we are looking forward to sharing it with our audience."
}