{
    "addr": "450 West 37th Street New York, NY 10018", 
    "title": "Composers Concordance - Eclectic Bands - The 5th Concert of the MultiBand Festival", 
    "url": "http://www.eventbrite.com/e/composers-concordance-eclectic-bands-the-5th-concert-of-the-multiband-festival-tickets-19669864093?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-12T20:00:00-05:00", 
    "endtime": "2015-12-12T23:00:00-05:00", 
    "categories": [
        "Music", 
        "Concert or Performance"
    ], 
    "desc": "On December 12th at 8pm at The DiMenna Center, Composers Concordance concludes its MultiBand Festival with the concert 'Eclectic Bands.' Three composer-led bands: Ido, Nine Live, and Sound Liberation will set up in the round to present a quick-tandem performance in which the audience will hear a diverse repertoire indeed, including a grand finale in which all three bands will perform together new arrangements of Irving Berlin's classic song 'Alexander's Ragtime Band.' Gene Pritsker's Sound Liberation, formed in NYC in 1996, has generated a loyal core following with performances at The Blue Note, Downtime, Estonian House, Joe's Pub, Knitting Factory, Cutting Room, Drom NYC, Flea Theater, and New Music Cafe, as well as festivals in Austria, Canada, and Italy. Their song 'No Truth' was featured in the motion picture 'The Wedding Bothers.' As John Ephland wrote in Downbeat: \"4 stars...unexpected twists and turns...The result may have you seeing visions...strains of jazz, contemporary classical music, minimalism, and even hip-hop and and African rhythms.\" Featuring Gene 'Noizepunk' Pritsker - composer, guitarist, & rapper; Chanda Rule - voice; Charles 'Das Krooner' Coleman - voice; Max Pollak - voice & tapdancer; Greg 'B-man' Baker - guitar, Mat Fieldes - bass; and Damien Bassman - drums.  http://www.soundliberation.net ? Nine Live is a brazen nonet led by Gotham denizens John Clark and Dan Cooper. Elements of blues, swing, funk, and contemporary improvisation meld with the classical avant garde in original compositions that are both erudite and great fun to hear. Titles already performed at The Cell Theatre, Gallery MC, and Shapeshifter Lab include 'Turbulence,' 'Platypus Blues,' 'Gefilte Funk,' 'Bowery,' and 'Freedom's Delight.' The group's debut CD will be released on Dave Soldier's label Mulatta Records in 2016. Featuring Kaoru Watanabe - flute, Patricia Billings - clarinet, Jason Marshall - bari sax, John Clark - horn & composer, Lynn Bechtold - violin, Christine Kim - cello, Rob Stephens - piano, Dan Cooper - bass guitar & composer, and Cesare Papetti - drums.  http://www.ninelive.nyc Franz Hackl, trumpeter, composer, and brass instrument maker, is founder and artistic director of the Outreach Orchestra, Festival and Academy and leads his own group, Franz Hackl's IDO Quartet. His forward approach, building on traditions and looking beyond fashionable trends, leads to his distinctive style. Featuring Franz Hackl - trumpet & flugelhorn, Michael Wolff - keyboard, Harvie S - bass, and Kim Plainfield - drums.  https://www.facebook.com/franzhackltrumpet"
}