{
    "addr": "10 East 15th Street New York, NY 10003", 
    "title": "Clinton HS Admissions Writing Sessions - No Test Accommodations", 
    "url": "https://www.eventbrite.com/e/clinton-hs-admissions-writing-sessions-no-test-accommodations-tickets-19479644140?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-13T09:00:00-05:00", 
    "endtime": "2015-12-13T10:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Other", 
        "Other"
    ], 
    "desc": "Clinton HS Admissions Writing Sessions \n This year The Clinton School for Writers and Artists is hosting several admissions writing session dates prior to the deadline to submit high school applications. ? You should sign up for a writing session at this time only if you are absolutely certain that you will list Clinton on your high school application.  ? \n If you find that every session is booked, or if? you are unable to come in before the December 1 st ?deadline for high school applications , all is not lost. ?We will open additional sessions after December 1st as needed. \n The Writing Task \n Our writing task is not something for which you can prepare. ?There are no multiple choice questions; it?s a writing task. We are not going to ask you about elements of literature such as theme, plot, or tone. ?We are going to have you read critically, think analytically, and write an essay in response to a question. ? \n Signing Up? \n Please review the dates and times. ?Be sure to check your calendars and confirm that you can attend the writing session for which you register. ? \n Please do not book tickets for other families. ?Each family needs to make their own decision about whether or not they should list Clinton on their child's application for high schools. ?We will work to ensure that every child who lists Clinton on their application has an opportunity to complete a writing sample. \n FAQs \n What happens on the day of the session? \n You will come to The Clinton School, located at 10 East 15th Street. ?We're right off Union Square as you head west on 15th Street. ? Please plan to arrive 5 minutes earlier than your ticket indicates. ?It's better to wait in the lobby than run in at the last minute. ? \n We will check you in and send you to the correct room for the writing session. ?Staff and students will be here to help you get settled in, help you understand the writing task directions, and help you get set up on the computer. Yes, you will use a computer to write your writing sample.  After you complete the writing task and have confirmed with a proctor that your sample is saved, you will be able to leave and enjoy the rest of your weekend. \n Wait - I have to type on a computer? ?What if I never use one? \n If typing will prevent you from writing a response, please send an email to admissions@theclintonschool.net indicating: \n \n Your first and last name \n The date and time of your session \n Your request for a paper and pencil assessment \n \n Please note, we do ask students to use computers regularly in school and it's now a skill required for most jobs. If typing is a struggle and you are matched to Clinton, please let us know sooner rather than later. ?We want to make sure you are ready for life beyond high school. \n What can/can't I bring to the event? \n \n \n Bring two pens. ?You may also bring pencils and highlighters. ? \n \n \n You may bring a bottle of water only.? \n \n \n Dress in layers in case the room is too hot or too cold for you. \n \n \n Where can I contact the organizer with any questions? \n admissions@theclintonschool.net"
}