{
    "addr": "143 W 72nd St. 2nd Fl. New York, NY 10023", 
    "title": "Santa Photos at Big Apple Portraits", 
    "url": "https://www.eventbrite.com/e/santa-photos-at-big-apple-portraits-tickets-19459231084?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-13T09:30:00-05:00", 
    "endtime": "2015-12-13T14:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Other", 
        "Family & Education"
    ], 
    "desc": "It just isn't Christmas without a visit to?Santa Claus, especially so for the kids. Our Santa Claus is as jolly as they come and has a full, real live beard! One of our perks of our Santa Sessions is missing the long lines of waiting to get your photo taken. \n With this 10-minute session, your child can pose to their heart's content with good ol' Saint Nick. Whether it's sitting on Santa's lap for babies and young toddlers, or giving a high-five to Santa because you've outgrown the lap, our Real Bearded Santa Sessions are filled with fun and laughter. ?This is not your ordinary Santa photos! \n Join Us and Santa at the Studio on these dates: \n \n \n November 21 \n \n \n November 22 \n \n \n December 13 \n \n \n View the fun  here ! ?Please also make sure to book your session time at www.bigappleportraits.com/book or by calling 212-600-4457. \n \n ** The charged amount is a deposit that is used to retain your session and can be used towards any Santa Mini Session Package. ?Your deposit is fully refundable up to 15 days before your scheduled session. ?You have the ability to reschedule your date based on availability up 3 days before your scheduled session. ?Sessions without an available reschedule date will be eligible to transfer the deposit to another package option that must be used prior to December 31, 2015 or Big Apple Portraits will retain said deposit. \n Changes to the secured date or time due to other unforeseen circumstances on the client's part remain at the discretion of Big Apple Portraits. In most cases, where notice is given, an alternative date or package can be arranged.? Failure to notify Big Apple Portraits to changes or cancellation of your scheduled session will result in forfeiture of the deposit."
}