{
    "addr": "TBA New York, NY", 
    "title": "Sacred Beauty Salon Series", 
    "url": "http://www.eventbrite.com/e/sacred-beauty-salon-series-tickets-18614967870?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-13T13:00:00-05:00", 
    "endtime": "2015-12-13T17:00:00-05:00", 
    "categories": [
        "Beauty", 
        "Class, Training, or Workshop"
    ], 
    "desc": "W E L C O M E ?TO ? Explore the divine nature of your beauty in this 4-part, transformational, live ?workshop presented by  Rebecca Casciano , ? makeup artist,?natural beauty expert and coach.? Join in empowering conversations and beauty rituals that? support the modern day Goddess- you!? Le arn how the art of makeup can be used as a tool for? self-love, expression and creativity.? T his unique, fun series connects your inner and outer beauty? in ? way that has never been? done ?before! ? Learn practical makeup skills ?from Rebecca, an experienced professional makeup artist and educator,? using ? organic, natural and effective ?cosmetics. ? Watch her detailed demo featuring her? favorite products, tips and techniques ?to create everything from glowing skin to the perfect pout. Then? receive Rebecca's personal guidance while you practice them on yourself , enabling you to easily recreate the look at home. ? ? What makes this workshop so special, is that you will also? delve deeper into the relationship between how you look and how you feel. ?Engage in ?important conversations and powerful exercises designed to enhance and? transform the way you see yourself and the world around you . J oin Rebecca and a community of like-minded women and experience? the joy of sisterhood and a fresh, meaningful approach ? to beauty! ? ? At each Sacred Beauty Salon,   you can expect to: ? * Join in guided, inner-beauty practices such as meditation, writing, group talks and more ? * Watch Rebecca's makeup demo and get all your burning beauty questions answered  ? * Experience the best in green beauty as you practice your new makeup techniques ? * PLUS, receive  a gift bag (valued at $60+)  featuring  2 FULL-SIZE  makeup and/or skincare  ? ...and much, much more! ? INTRODUCING: SACRED BEAUTY SALON FALL/WINTER 2015/16 FOUNDATIONS OF BEAUTY ?- OCTOBER 18TH Explore the roots of your relationship with beauty + transform old, limiting beliefs Learn how to nurture healthy, glowing skin with the right skincare, foundation + blush * Special guest talk with Jess Arnaudin,  Savor Spa's ? Esthetician Skincare Coach! * ? SEEING BEAUTY - NOVEMBER 15th Renew your perspective on how you see yourself, your surroundings + others? Learn how to define your eyes ?for day + night, plus create gorgeous brows * Special guest, Intuitive Strategist? Vanessa Codorniu  teaches us how to  see with our \"inner eye\"! * ? SPEAKING BEAUTY ?- ?DECEMBER 13TH Reclaim the power of your words to affirm, inspire + create more beauty from within Learn how to use the transformative power of lipstick to make your personal statement * Special guest, Self-Love Guru? Nitika Chopra  shares her powerful story  about her journey? dealing? with a debilitating condition, to thriving and radiating beauty in her life. * ? LIVING BEAUTY - JANUARY 17TH Create powerful practices + rituals that will bring more beauty into your daily life Learn how to enhance your features with easy, real-life highlight + contour techniques * Special guest, Kundalini Teacher + Reiki Master  Valerie Oula ? will  help us? experience? our own Living? Beauty through? the potent  combination of kundalini breath work, meditation & flower essences.* ? ?JOIN US FOR THE WHOLE SERIES OR JUST 1! Sacred Beauty Salon Series is a 4-part program that allows time  to incorporate new beauty rituals and techniques you will learn, as well as to deepen your connections with the other women in the group. When you attend all 4 workshops,  you will have a richer, fuller experience of Sacred Beauty,   but  there is much to be gained in each one.  Whether you can join us for  one of all four,  you are sure to be inspired and grateful you did!  ? ? Want to hear what guests have to say about it?  Click to watch this video! ? ? ? Do you want to: ? ? ? - rejuvenate your femininity, feel more sexy and goddess-like everyday? - release old, toxic thoughts and products, creating a healthier beauty routine? - rediscover what truly makes you feel beautiful, inside and out? - connect with an amazing community of like-minded women? Then treat yourself-- Sacred Beauty Salon Series was created especially for you! ? ? SACRED BEAUTY SALON GIFTS COURTESY OF: ? ? ?? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?? ? ? ? ? ? ? ? ? ? ? ? ?? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?? ? ? ? ? ? Event images by  Margarita Corporan Photography Sacred Beauty images by  Tracy Toler Studio Video by  Shruti Parekh ? Tickets are transferable, but non-refundable"
}