{
    "addr": "500 8th Ave New York, NY", 
    "title": "Bachata, ChaCha & Salsa Dance Social Party&Class for Beginners, make new friends", 
    "url": "http://www.eventbrite.com/e/bachata-chacha-salsa-dance-social-partyclass-for-beginners-make-new-friends-tickets-19034393383?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-13T15:00:00-05:00", 
    "endtime": "2015-12-13T18:00:00-05:00", 
    "categories": [
        "Performing \\u0026 Visual Arts", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Dancing is so much fun, I really feel alive when I am dancing Salsa! It's the weekend, you should go out and have some fun! Go out and meet some new friends!?? Please join us for another fun Salsa dance class for beginners, a 2 hours fun networking event, an easy to follow dance class taught by an experienced dance instructor. ?We will be dancing non-stop, hope you will enjoy burning away all the calories while having fun.? You will learn a repeated sequence of Salsa dance moves, after this class you will be able to dance non-stop with your friends in the city. ? Salsa dancing for more than 2 hours is a really fun way to exercise and burn off all the calories. Dancing is a good workout, it may \"improve your health and give you more energy\". We will rotate dance partners every five minutes, so that each person will make many new friends during this fun networking event. ? Name tags will be handed out to each guest during the start of the event for the open space networking session. ? This is a quality 2 hours fun salsa lesson for beginners, we put in extra efforts to make this a fun event by making the dance moves very easy to learn for beginners. We have taught this class many times over the past 3 years. ? The best and really nice Salsa music will be playing on the high quality BOSE sound system, over the last 5 years we have created a collection of 1000 Salsa songs. ? $$$$$$$$$$$$$$?? The cost per person for this fun Salsa class is:? ? $15, when paid early online.? or $20 when paid at the event, cash only. If the event gets full, then this option becomes unavailable. ? Required: Please get tickets from the famous EventBrite.com web site:?? $$$$$$$$$$$$$$ ? Friends from 12 networking groups will be attending. ? Business Owners may apply for a free Vendor Table to promote their business during this event for free.Each vendor is required to give out some type of free gifts to our attending guests. Bring your own small size portable vendor table. Contact James, the Event Organizer to make your free promotions appointment.? ? 14,000 people are reading this message and only 24 tickets are available. Please get your tickets now. ? Thank You.?? Sincerely,?? James?? NYC Business Owners Network Webspert Corporation?? 646-455-8444 ? These photos are from www.google.com/images :"
}