{
    "addr": "3920 Broadway New York, NY 10032", 
    "title": "Felix Miguel Mojica's Networking Party #FMMNP Hosted By NeverSoberNYC", 
    "url": "http://www.eventbrite.com/e/felix-miguel-mojicas-networking-party-fmmnp-hosted-by-neversobernyc-tickets-19552953410?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-13T19:00:00-05:00", 
    "endtime": "2015-12-14T00:00:00-05:00", 
    "categories": [
        "Other", 
        "Meeting or Networking Event"
    ], 
    "desc": "NeverSober NYC is hosting Felix Miguel Mojica's Networking Party. Honestly, It will be a social media frenzy. In addition, it is Happy Hour that day. Everyone that attends on time will receive a ticket at the door and with that ticket you will receive a drink of your choice on the house. VIP's, a head count of 25 with a plus one, will also ?receive a colored ticket at the door in which will purchase an appertizer and two drinks of your choice. This party is designed to simply Network with the attendees. Felix Miguel Mojica would have Fifty (8.5x11) photos printed and signed of his Photographic portfolio attached with the first Fifty RSVP'd guests. There will be raffle tickets, prizes and so much more. In addition, there will be three DJ's on rotation in behalf of NeverSober NYC. Felix Miguel Mojica's current sponsors and potential sponsors will also attend. Furthermore, bloggers, celebrities, athletes, models, photographers, videographers, actors, actresses, investors and business owners will attend as well. Age limit is 21 and over. Those that are 18 will be stamped to assure them that they are not consuming liquor. We will have probably have @IamJayMula @FrankFridayy @ScarlettSantana @_Dan.R @KapitoSanto & another surprise recording artist performing one song per artist. Sponsors include: @PapaJuanCigarRoom @IAVA @PMDPitorro @EmnyntCity @Lions_Clothing & others! Potential Sponsors:  @GiacomosCigars @CigarChasers ?@WestNYC Hope to see you all there! Sincerely, Felix Miguel Mojica. P.S- Any questions you may contact @fmmshotme or @neversobernyc on instagram!"
}