{
    "addr": "601 West 26th Street. Suite 325 (3rd Floor). New York, NY 10001", 
    "title": "Non-Profit University: Social Media for Social Causes", 
    "url": "https://www.eventbrite.com/e/non-profit-university-social-media-for-social-causes-tickets-19592829681?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-14T18:00:00-05:00", 
    "endtime": "2015-12-14T20:00:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Class", 
        "Business"
    ], 
    "desc": "Great, so you have a permanent home on the internet, and some ?friends? as well. ?Now what? If you consider yourself a pretty digitally savvy business owner, you?ve probably built a website or point page for your cause, and you're working to grow your social media audience and to get your message out there. These are great first steps in managing your overall web presence. However, there are additional web tools that can help you expand and scale your nonprofit to be sure you are offering information as well as fundraising online. ?This course will explore ways that advanced online tools, such as e-commerce platforms, online advertising, and content management products, can help enhance interactions with your clients, and better reach new followers. \n Al proceeds go to New Women New Yorkers, a nonprofit organization empowering young women immigrants in New York City.? \n \n What you will learn about: \n \n \n In-depth explanation of strategies and techniques for specific social networks \n \n \n Content management tools and key products \n \n \n Captivating content to promote your cause \n \n \n E-Commerce, Fundraising & Online Sales \n \n \n Online advertising & Promotions \n \n \n How to enhance your business?s primary/preferred social network \n \n \n \n The course will be led by Sadayia Smith, MBA serial entrepreneur and current business consultant working with NYC Business Solutions & the Brooklyn Chamber of Commerce to provide small business owners assistance with starting or growing a business. \n Learn more about Sadayia? here , and don't wait to purchase your tickets, space is limited!"
}