{
    "addr": "508 West 26th Street New York, NY 10001", 
    "title": "Change Your Clothes, Change Your Life", 
    "url": "http://www.eventbrite.com/e/change-your-clothes-change-your-life-tickets-19662674589?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-14T19:00:00-05:00", 
    "endtime": "2015-12-14T22:00:00-05:00", 
    "categories": [
        "Fashion", 
        "Attraction"
    ], 
    "desc": "On 12/14/15 in NYC Noel Elie   presents  George Brescia?s Change Your Clothes,   Change Your Life ? Holiday Event  ? Location:  The Highline Loft in Chelsea, NYC Date:  December 14th Time:  7-9pm  If you don?t look good, you don?t feel good.  Let George Brescia help steer you in the right direction!  ? There will be:  Networking and Mingling with New York Fashion?s Finest Fashion & Design ???????????Media & Press Drinks, Music, Free Gifts, a Book Signing, Pampering, and so much more At this exclusive holiday event-  Change Your Clothes, Change Your Life ,  George with special guest(s) will let you in on some trendy secrets: ? ? ? ? ? -Verky Arcos Baldonado ?( Editor in Chief of Latina Magazine) ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?? ? ? ? -Stephanie Simon (New York 1 Arts Reporter) ? Join us on this one night only AhhhMazing Fashionable Event  to receive   the most stylish insider tips and tricks for looking flawless: ~Your Perfect Day to Night Outfit: From work at the office, then straight to the holiday party ~5 gifts under $50: Inexpensive Holiday Shopping ????? ~Find your signature look ~Color Me Perfect: How to find the colors that make you POP ? ? ~Change your life with simple, trendy steps ~How to have a closet full of fabulous 10's  ~Shopping 101: Stress free and easy breezy ? ? ? ? George Brescia has spent the last twenty-five years working with top fashion and beauty leaders, including Ralph Lauren, Donna Karan, Tommy Hilfiger, and the fashion directors at Bloomingdales, Bergdorf Goodman, and Lord & Taylor. As the man behind George B Style, he?s also a top-tier NYC-based stylist and image consultant with clients ranging from A-list celebrities to everyday men and women looking to improve their appearance and gain confidence. He has also appeared as a resident fashion expert on network TV outlets including NBC's the Today show, CBS, ABC, Fox 5, and NY 1 as the official red carpet fashion critic for the Tony Awards. George has also been featured on radio segments he has written a new personal lifestyle and fashion book,  ?Change Your Clothing! Change Your Life!.... because you can?t go naked? published by Simon & Schuster. **Check ?out ?George?s REEL ?HER E ? All Sales Are Final. Email NoelElie.Events@gmail.com with questions or concerns ? ? Special Thank You to Our Sponsors:"
}