{
    "addr": "New York, NY   ", 
    "title": "4 Day PMP Boot camp live virtual class in  New York, NY", 
    "url": "http://www.eventbrite.com/e/4-day-pmp-boot-camp-live-virtual-class-in-new-york-ny-tickets-17960154305?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-15T08:00:00+05:30", 
    "endtime": "2015-12-18T17:00:00+05:30", 
    "categories": [
        "Other", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Our four day workshop prepares any industry professional aspiring for PMP? certification exam from PMI, USA. This program helps the participants to understand the structured project management methodology from PMI and empowers them to manage their projects successfully. Best practices of managing international projects across various domains are discussed in detail to ensure that the participants are confident in managing various situations on day-to-day projects. ?This intensive PMP 4-day, directed study course is designed to fully prepare you for the PMP exam in an effective manner-with a minimum amount of studying after class! In addition to our unique training methods, there are exercises and techniques designed specifically to increase both learning and knowledge retention, giving students not only the knowledge they need to quickly prepare for the exam, but also to become a better project manager-without rote memorization. ?Key Highlights:  ?We at ITA follow a practitioners' approach towards our training programs: ? 4 Days of intense classroom training provided by our highly qualified in-house trainer ? Hardcopy of PMBOK5 and Accredited & Approved Course Material ? 35 Contact Hours Certificate  ? 100 days of free online Support Post-workshop through Live Chat, E-mail and Telephone ? 100 days of free access to our Online Exam Simulator for exam preparation - [worth USD189] ?WORKSHOP DETAILS ? Course: 4 Day PMP Boot camp live virtual class in  New York, NY ? Dates: Dec. 15th - 18th, 2015 ? Time: 8:00AM ? 5:00PM ? Location:  New York, NY Call us +1 (713) 344 1257 or Drop me an email support@immanuelt.com"
}