{
    "addr": "71 West 23rd Street,  New York, NY 10010", 
    "title": "NOT Your Father’s News Release", 
    "url": "http://www.eventbrite.com/e/not-your-fathers-news-release-tickets-17892744681?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-09T09:00:00-05:00", 
    "endtime": "2015-12-10T16:00:00-05:00", 
    "desc": "PR professionals have been married to the traditional news release format since Ivy Lee created the release more than 100 years ago. Why, then, do we need a new approach? With 2,500 releases crossing the wires each day ? that?s one every 35 seconds ? the impact of your traditional news release ain?t what it used to be. In fact, more than half of all traditional press releases never get covered, according to PR Newswire?s own research. In this PR writing workshop, you?ll learn current best practices from the Public Relations Society of America?s ?national writing coach.? You?ll find out how to go beyond PR 101 approaches to write media relations pieces that get posted and published, boost your search engine rankings and reach stakeholders directly. Specifically, you?ll learn to how to: Registration starts at 8 a.m. In two days, you?ll have time to cram your writer?s tool bag with tricks ? hard-to-find but easy-to-implement techniques that will make your copy more persuasive, make your writing decisions easier and give you the information you need to have a successful conversation with management about what works in writing and why. If you?re a good writer, this Master Class will quickly equip you with a bigger, better bag of writing tricks. If you?re struggling, the program can give you the tools you need to get up to speed almost immediately. Wherever you are on the learning curve, you?ll be a much better writer when you walk out the door at the end of this class. See you on Dec. 9! ? ? Get more than $200 worth of learning tools for just $100: ? Get $297 worth of additional learning tools for just $100: ? Get follow-up support ? plus an exclusive conversation with Ann: Sorry: only 10 Diamond tickets available! ? A.  .? Please contact hotels directly for room rates and booking. ? ?  A. Can?t make it? Please feel free to send a colleague in your place. No charge for substitutions. If you must,  : ? A. We have no doubt that the Master Class will be the best money you invest this year on your professional development. But here are 5 ways to reduce that investment or boost your return on it: ? ?  A. Please email us at   to contact us. ? A. Yes, you can go to your ticket and update your registration information ? A. Yes, please carry a copy of the ticket to the workshop"
}