{
    "addr": "140 West 30th Street New York, NY 10001", 
    "title": "FREE Personal Branding Workshop + Be Social Change Happy Hour", 
    "url": "http://www.eventbrite.com/e/free-personal-branding-workshop-be-social-change-happy-hour-tickets-19184823323?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-15T18:00:00-05:00", 
    "endtime": "2015-12-15T22:00:00-05:00", 
    "categories": [
        "Career", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Join  Marcos Salazar , career + life coach and Co-founder + Executive Director of  Be Social Change , on  Tuesday, December 15th  for a  FREE  workshop  on  Personal Branding with Purpose: Communicate Your Passions, Talents, and Impact for Career Success  combined with a  Be Social Change Happy Hour  before and after the workshop to network and connect with like-minded people wanting to grow their careers and make a difference in the world (details below) ! ? Developing a personal brand - creating your image and guiding your reputation - has never been more important. Whether you?re seeking to move up in your organization, looking for a new job, thinking about making a career change, launching a new business, wanting to attract new clients, or looking to scale your social impact, in today?s rapidly-changing, hyper competitive working world a strong and consistent personal brand is key to creating new opportunities for your career or business. The truth is we all have a personal brand. It is how we are perceived by others - our friends, colleagues, and the public. It is what people think about when they hear our name and what people say about when we are not in the room. The key question we need to ask is: do we take charge of our personal brand or do we leave it up to chance? Personal Branding with Purpose  is not about learning how to \"create\" a personal brand. It's about learning how to live your personal brand by sharing your authentic self and communicating clearly the value you can provide others. Our passions, talents, and impact are unique gifts we can give to the world. By learning how to market these gifts through personal branding, you create not only career and business opportunities but also a greater capacity to make a difference in the lives of others and the planet. ? ? ? Join us before and after the workshop to enjoy a  Happy Hour  with our space partners,  Till & Sprocket ! You?ll connect with our diverse community of purpose-driven professionals, entrepreneurs, educators, creatives, investors, non-profits, and social enterprises. Come share your ideas and passions, network with inspiring people wanting to change the world, and learn about opportunities for professional development and creating impact! Till & Sprocket is located on site and will be offering 15% off all drinks for workshop attendees from 6-7pm and 9-10pm. Just mention the event to the bartender! ? SCHEDULE ? 6:00 PM -  Happy Hour at Till & Sprocket - 15% off all drinks 6:45 AM -  Doors open for Personal Branding Workshop 7:00 PM -  Workshop begins at 7pm sharp** 9:00 PM -  Happy Hour continues at Till & Sprocket ? **SPACE IS LIMITED. Registration does not guarantee admission. Arrive early to get a spot!** ? An understanding of personal branding- how you can leverage it to create new career and business opportunities as well as scale your impact Gain greater clarity about your passions, values, purpose, and career goals that serve as a foundation for an authentic personal brand Define your Big Idea - what you stand for - and integrate it with your unique knowledge and experience to communicate your brand value Identify your niche, target audience and articulate how you can help solve problems they have Assess and strategically build your online identity and presence| Develop strategies for maintaining and adapting your personal brand in a world of constant change ? WHO THIS CLASS IS FOR ? Professionals looking to create new career and business opportunities People seeking a new job or looking to make a career shift Entrepreneurs wanting to increase their own visibility to grow their businesses Creatives and service providers (consultants, coaches, agents, and speakers) wanting to attract new clients and business opportunities Students or recent grads looking to build a foundation for their future career path ? ? Marcos Salazar  ( @marcossalazar ) is a  social entrepreneur ,  career + life coach , consultant ,  speaker ,  and   community builder . His passion is working with professionals, entrepreneurs, and creatives to help them pursue work they are passionate about, build authentic personal brands, become financially successful, and create lives that make the world a better place. He does this through  1-on-1 coaching ,  nonprofit and businesses consulting , and on a larger scale as Co-founder + Executive Director of  Be Social Change  where he?s built the largest social impact community and professional development hub in New York City. Marcos earned a B.A. in Psychology from Amherst College as well as a Masters in Organizational Management and an Executive Leadership Coaching certificate from The George Washington University. Marcos is a board member of the Young Professionals Nonprofit Network and an American Express Leadership Academy Fellow. You can learn more about him at  www.MarcosSalazar.com . ? ? ? Interface  is a collaborative membership space for the curious, the disruptive, the engaged, and the mindful. A reflection of the people who comprise it, Interface was created to usher in a burgeoning neighborhood of those who seek to enrich their local and global communities. Curious?  http://interface.nyc"
}