{
    "addr": "131 West 86th Street New York, NY 10024", 
    "title": "May and Samuel Rudin Lecture featuring Niall Ferguson", 
    "url": "https://www.eventbrite.com/e/may-and-samuel-rudin-lecture-featuring-niall-ferguson-tickets-19171586732?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-12-08T20:00:00-05:00", 
    "endtime": "2015-12-08T21:30:00-05:00", 
    "categories": [
        "New York, NY Events", 
        "Seminar", 
        "Spirituality"
    ], 
    "desc": "The Jewish Center invites you to attend  A Special Chanukah? May and Samuel Rudin Lecture featuring Niall Ferguson \n From Refugee to the White House:  Henry Kissinger and the American Jewish Journey \n Tuesday, December 8 ? Doors open at 7:00PM, Lecture begins at 8:00PM \n Niall Ferguson Niall Ferguson is the Laurence A. Tisch Professor of History at Harvard University. He is also a Senior Fellow at the Hoover Institution, Stanford University, and a Senior Research Fellow at Jesus College, Oxford. \n He is the author most recently of  Kissinger: 1923-1968: The Idealist  and has published fourteen books. An accomplished biographer, he is also a regular contributor to television and radio on both sides of the Atlantic. In 2004, he was named as one of the 100 most influential people in the world by Time Magazine. \n A prolific commentator on contemporary politics and economics, he writes regularly for newspapers and magazines globally. He is also the Managing Director at Greenmantle LLC and serves on the Board of Directors of Affiliated Managers Group, Inc., a global asset management company. \n Registration This event is free and open to the public. Registration is required. ? \n May and Samuel Rudin Lecture Series The May and Samuel Rudin Lecture Series at The Jewish Center was established by Mr. Jack Rudin in memory of his beloved parents, longtime members and leaders of The Jewish Center. It was designed to provide the New York City community with the opportunity to hear from renowned religious leaders, prominent public figures and outstanding scholars on issues of critical importance to contemporary society and religion. Our most recent speakers have included: Daniel Libeskind, Mosab Hassan Yousef, The Green Prince; Erica Brown and David Brooks; Senator Cory Booker; Dr. Eric Kandel, Nobel Laureate; Lord Jonathan Sacks, Chief Rabbi of the United Hebrew Congregations of the Commonwealth; Ambassador Yehuda Avner; Mayim Bialik, Award-winning Actress; The Honorable John Ashcroft, former U.S. Attorney General; General Colin Powell, former Secretary of State; Lee Bollinger, President of Columbia University; John Sexton, President of New York University; Richard Joel, President of Yeshiva University; Yuli Edelstein, Speaker of Knesset; Edward Cardinal Egan, Archbishop of New York; Rabbi Norman Lamm, Chancellor of Yeshiva University; Senator Joseph Lieberman and Governor Thomas Kean, Chairman of the September 11th Commission."
}