{
    "addr": "80 Fifth Avenue. Room 1408. New York, NY 10011", 
    "title": "Therapeutic Writing:  Memoir As a Tool for Reflection, Processing, and Discovery Sarah Saffian, LMSW, MFA", 
    "url": "http://www.eventbrite.com/e/therapeutic-writing-memoir-as-a-tool-for-reflection-processing-and-discovery-sarah-saffian-lmsw-mfa-tickets-18689793676?aff=ebrowse", 
    "location": "New York, NY", 
    "starttime": "2015-12-04T18:30:00-05:00", 
    "endtime": "2015-12-04T20:30:00-05:00", 
    "desc": "In this interactive event, Sarah Saffian will present the? ?model, a creative hybrid that can serve as a useful complement to traditional individual talk therapy. With a nod to the approaches of psychologists like James Pennebaker (University of Texas, author of? ) and Timothy Wilson (University of Virginia, author of? ), and drawing from her own evolution from memoirist, to memoir teacher, to therapist, Sarah uses writing exercises to encourage deeper, clearer reflection, processing of issues, and discovery. Whether in groups or individual treatment, the memoir prompts can translate to virtually any issue ? while the exercises offer frames, the clients provide the particular content to examine through them. In her presentation, Sarah will chart her own professional journey, including a brief reading from her memoir,? ?explaining what inspired her to blend her areas of interest and expertise in creating and employing this model. She?ll share the similarities and also crucial differences between craft-oriented and therapeutic workshops, where the focus is introspective. And she?ll offer up a brief writing exercise or two to the audience ? such as a letter to yourself, exploration of different perspectives on an incident, experimentation with verb tenses to variously access a situation ? followed by sharing and discussion. ? ? ? ? , LMSW, MFA, is a writer, a teacher, and a therapist. Her memoir,?  chronicles the experience of being an adoptee who was found by her birth family. She teaches memoir at the Iowa Summer Writing Festival and Sarah Lawrence, and works independently as a writing coach. As a therapist, she counsels individual clients and runs support groupswith Spence-Chapin Services, the Infertility and Adoption Counseling Center, (IAC), ?and in various private practice settings in Manhattan and Brooklyn. Her clinical experience also includes New York University?s Counseling and Wellness Services. Sarah earned her BA in English from Brown, her MFA in creative writing from Columbia, and her MSW from NYU. Please visit:"
}