{
    "addr": "Los Angeles, California", 
    "title": "The Color Du Jour Experience (Los Angeles, CA)", 
    "url": "http://www.eventbrite.com/e/the-color-du-jour-experience-los-angeles-ca-tickets-19160343102?aff=ebrowse", 
    "location": "Los Angeles, California", 
    "starttime": "2016-02-20T13:30:00-08:00", 
    "endtime": "2016-02-20T17:30:00-08:00", 
    "desc": "Color Du Jour invites you to join us for.... Foundation (i.e. AJ Crimson or MAC Matchmaster Foundation)? Concealer (i.e. MAC Studio Finish or LA Girl Pro Concealer) - Mandatory Two Lip Stick Colors?(one natural and one bold) ? 8pc Color Du Jour Brush Set ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?? Color Du Jour \"No More Shine\" Translucent Powder ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? Color Du Jour Makeup Prime & Set Spray ? Color Du Jour Moisturizer/Primer ? ? Lip Liner ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?? Eye Lashes Please note that the registration is only the deposit amount required to secure your seat. The remaining balance of $100 is due the day of the event upon entry. Only cash and major credit cards will be accepted. No personal checks.? Class registration fees are nonrefundable as advance preparations are needed for each class. Prior to registering, please ensure that your schedule allows for you to attend. However, if for any reason the class is cancelled, a full refund will be given to each person.? No particular skill level is required for this class. Both beginners and advanced individuals may attend. We do require that you maintain a willingness to learn :)? Any attendees ages 17 and up may attend this event. Please bring a ID or driver's license for check-in.? See required makeup items listed above. In addition, you may bring a small makeup bag/kit if you choose. Cameras are recommended for photo purposes, however, video recording is not permitted.? Should you have any questions regarding the class, please send an email to colordujour@gmail.com"
}