{
    "addr": "415 Pacific Coast Hwy at Beach Coast Way Santa Monica", 
    "title": "Animal & Human Partnerships: On the Page and in the Real World with Writer-in-Residence Jennifer Caloyeras", 
    "url": "http://www.eventbrite.com/e/animal-human-partnerships-on-the-page-and-in-the-real-world-with-writer-in-residence-jennifer-registration-19522807242?aff=ebrowse", 
    "location": "Santa Monica, United States", 
    "starttime": "2016-01-19T18:30:00-08:00", 
    "endtime": "2016-01-19T20:00:00-08:00", 
    "desc": "* NB: California Incline Replacement begins April 2015 with full closure of the Incline, with traffic diverted to Moomat Ahiko, I-10 or Entrada Dr.? Also note - no need to print out your ticket, just mention your last name when checking in.? 6:30-7:45pm: Reading and Conversation Stories featuring the human-animal bond are well represented in literature. What makes these stories so compelling? How do they play out in real life? Join three members of the community as they discuss the educational and social impact when dogs are paired with people facing challenges. Jennifer Caloyeras is the author of the novel,  Strays , which explores a girl with anger management issues who is sentenced to a summer rehabilitating aggressive dogs. Dr. Bidhan Roy is a professor at Cal State Los Angeles and a volunteer at Paws for Life and? WordsUncaged? where he teaches inmates at Lancaster Maximum Security Prison. In this program, both students and inmates hone their writing skills and work with training rescue dogs. Juliet Beyond serves as Project Director at k-9 connection, an OPCC project based in Santa Monica, where teens get a chance to break through life barriers by training and bonding with homeless dogs.? Jennifer Caloyeras is the 2016 Writer-in-Residence at the Beach House, and will be working on a novel in the Marion Davies Guest House from 1/12/16-3/15/16. Her?most recent novel,? Strays, ? is for young adults ?and explores an incarcerated teen's relationship with a pit bull. In considering the portrayal of animals in literature she draws upon her experience as ?a dog columnist for the? Los Feliz Ledger,  a position she has held ?since 2005. ?Caloyeras' short fiction has appeared in  Booth, Storm Cellar  and other literary magazines. She holds a M.A. in English from Cal State Los Angeles and a M.F.A. in creative writing from the University of British Columbia. Jennifer?s current project is her first adult novel ? a mixture of humor and pathos ? that explores a mother?s journey with her transgendered six-year-old daughter, and the weight of expectations parents place on their children.? Stop by early? to save your seat and check out the historic site! Tickets are free ?but space is limited and reservations are required. Arrive by 15 min before start time to retain your reservation. Late seating, even for reservation-holders, is not guaranteed. To adjust or cancel your reservation for this event, email culture@smgov.net. We appreciate your keeping in touch! Getting Here : The Beach House is located at 415 Pacific Coast Highway, Santa Monica, CA 90402 on the west side of Pacific Coast Highway. Enter off PCH at the Beach House Way traffic light. Parking : The parking rate is  Nov - Mar:? $8/day or? $3/hour,? ? Apr - Oct:? $12/day or? $3/hour,? payable ?at the park and pay machines in three areas of the ACBH parking lot. Credit cards or exact change only. Handicapped placards and Senior Beach Permits are accepted. For other parking info and lot hours, please check the? website ?for details. Other events : To view & make reservations for future free Beach=Culture events, check? annenbergbeachhouse.com/beachculture . General Info : For hours, events and more, visit? annenbergbeachhouse.com , or call (310) 458-4904.?Back on the Beach Caf??hours?are subject to change but are generally through 3pm in the off season & 8pm in the summer, call (310) 393-8282 to confirm."
}