{
    "addr": "1 LMU Drive. William H. Hannon Library, Von Der Ahe Family Suite 322. Los Angeles, CA 90045", 
    "title": "Blended Learning Mini Conference", 
    "url": "http://www.eventbrite.com/e/blended-learning-mini-conference-tickets-18874756906?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-11-21T09:00:00-08:00", 
    "endtime": "2015-11-21T14:30:00-08:00", 
    "desc": "The Blended Learning Mini Conference is being put on by the Digital Curriculum Integration & Development team at Loyola Marymount University, directed by Shannon Tabaldo. ? Steve Johnson teaches at Santa Clara University where he is the Director of Educational Leadership and Educational Innovations in the School of Education & Counseling Psychology, and the Director of Character Education in the Markkula Center for Applied Ethics.?? In this capacity, Steve created and directs Santa Clara University?s cooperative programs with the Diocese of San Jose: the Academy of Blended Learning, the Academy of Church Leadership, and the Effective Principal Program.?? Before coming to Santa Clara, Steve studied accounting, theology, special education, and educational technology, and served as a Catholic elementary and high school teacher and principal in California and the Midwest.?Steve is also the author of the University?s K-12 character education programs, including Character Based Literacy.? Further information, teacher tools, and presentations are available at  Get ready to learn and collaborate on innovative ways to incorporate technology into your classroom! ? In addition to our wonderful keynote, we will also have breakout sessions for teachers and administrators. Topics to include: ? ? ? ?* Blended learning for administrators ? ? ? ?* Using data to differentiate ? ? ? ?* Classroom management in a blended learning setting ? ? ? ?* Blended learning success and challenges ...and more! We will be raffling off TWO TABLETS + a TWO YEAR SUBSCRIPTION to MobyMax! ?Don't miss out! Learn more about MobyMax here:?http://data.mobymax.com/mc/share/InfoKit.pdf"
}