{
    "addr": "3250 San Marino Street Los Angeles, CA 90006", 
    "title": "The 43rd Los Angeles Korean Festival", 
    "url": "http://www.eventbrite.com/e/the-43rd-los-angeles-korean-festival-tickets-19304585535?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-09-22T16:00:00-07:00", 
    "endtime": "2016-09-25T22:00:00-07:00", 
    "desc": "With the 2015 42nd Los Angeles Korean Festival being the most successful one yet, we have stepped up the standard not only for our Festivities but the overall experience. ?Join us for the 43rd Los Angeles Korean Festival, things are coming, will you be ready? There are festivals?-and then there?s LA Korean Festival. By weaving a deep-rooted fascination with culture, community, history and humanity through everything we do?from the expo to the global adventures we undertake ?LA Korean Festival Foundation transcend run-of-the-mill with experimental and diverse take on a culture-based Festival. Burdened stereotype and presumptions of it being too traditional and ?boring?; anticipation and the element of surprise possess the Festival goers with an utter sense of excitement with every year?s never-ending improvements, the LA Korean Festival is about to rock the city of Los Angeles.? More information will be posted as we go along, join our journey of planning, development and execution on Instagram/Facebook. ?Announcements will be for the Performance Line Up that will be coming to our LAKF43, along with Shopping, Expo and Food information. www.instagram.com/lakoreanfestival @lakoreanfestival www.facebook.com/LAKFF Are there ID requirements or an age limit to enter the event? Opened to All Ages, Only the BEERGARDEN requires 21+ Valid ID. What are my transport/parking options getting to the event? There will be very limited Street Parking. We provide parking in designated lots where we offer free transportation from those lots to our Festival.? What can/can't I bring to the event? No illegal drugs and weapons. Where can I contact the organizer with any questions? info@lakoreanfestival.org (213) 487-9696 How much are tickets? Free to the Public, but come early for the performances because seating is first come first serve! Where do I sign up to be a Volunteer? Contact  info@lakoreanfestival.org Our volunteer hours can be used towards school community hours."
}