{
    "addr": "88 Fair Drive Costa Mesa, CA 92626", 
    "title": "Big Bite Sugar Rush", 
    "url": "http://www.eventbrite.com/e/big-bite-sugar-rush-tickets-18662529127?aff=ebrowse", 
    "location": "Costa Mesa, CA", 
    "starttime": "", 
    "endtime": "", 
    "desc": "Calling all Sugar Fanatics! The inaugrual Big Bite Sugar Rush is coming to the OC Fair & Event Center December 5th & 6th.? Sugar Rush will be a one-of-a kind dessert showcase and sweet market experience packed with entertainment, competitions, demonstrations, cookie decorating for children, walk-about tastings of decadent and delicious sweet treats and shopping from some of the best pastry chefs and confectioners in Southern California. Foodie enthusiasts will satisfy their sweet tooth with an overload of artisan desserts in an unparalleled sugar shoppe environment as they prepare for the holiday season. This two day event will offer a choice of Saturday, December 5th or Sunday, December 6th. ?VIP sugar lovers will gain entry to the event one hour prior to general admission guests, access to the exclusive VIP sugar lounge, and a souvenir swag bag. The sweetest event you'll ever taste! All alcohol service is required to end 30 prior to the end of each session/event. ? All tickets are nontransferable, nonrefundable, and valid only on the date for which they have been purchased, during regularly scheduled operating hours, excluding activities and/or events priced separately.??Tickets issued complimentarily shall not be exchangeable.? Event dates, times, and details are subject to change.? TICKETS MAY NOT BE RESOLD. ?Unlawful resale or attempted resale is grounds for seizure and cancellation without compensation. Tickets obtained from unauthorized sources may be lost, stolen, or counterfeit, and if so are void. The OC Fair & Event Center and Absolute Event Solutions reserves the right, without the refund of any portion of the ticket purchase price, to refuse admission to or to eject any person or party who uses vulgar or abusive language, or whose conduct is deemed by management to be disorderly, and/or destructive to the property, or any person or party who fails to comply with these or other management rules. ? THE OC FAIR & EVENT CENTER AND ABSOLUTE EVENT SOLUTIONS IS NOT RESPONSIBLE FOR LOST, STOLEN, OR DAMAGED TICKETS OR OTHER ITEMS.? Ticket holder grants to the OC Fair & Event Center and Absolute Event Solutions the right in perpetuity to use the ticket holder's name, photograph, voice or likeness in any promotional material, without notice or payment.? The commercial use of photos or video you may have taken during your visit is strictly prohibited without full written consent of the OC Fair & Event Center and Absolute Event Solutions."
}