{
    "addr": "625 N. San Vicente Blvd West Hollywood, CA 90069", 
    "title": "WIF Speaker Series: \"Inclusion On Screen: Casting for Today’s Audiences\"", 
    "url": "http://www.eventbrite.com/e/wif-speaker-series-inclusion-on-screen-casting-for-todays-audiences-tickets-19482152643?aff=ebrowse", 
    "location": "West Hollywood, CA", 
    "starttime": "2015-11-30T19:00:00-08:00", 
    "endtime": "2015-11-30T21:00:00-08:00", 
    "desc": "WIF Speaker Series presents \"Inclusion On Screen: Casting for Today?s Audiences\" Of the 100 top-grossing movies of 2014, 21 had a female lead, 17 had a lead person of color, and at the cross-section, 3 had a woman of color in a starring role. Women are slightly better represented in TV at 42% of lead roles, but people of color dwindle at 13%. It?s now common knowledge that the numbers in front of and behind the camera are nowhere near reflective of current demographics, but considering today?s movie-going audiences are both majority women and people of color, why the disparity? In November?s Speaker Series, four top casting directors will give behind the scenes insights into why some images are staying the same, and how they?re finding talent to make the change. Sharon Bialy  is an award winning Casting Director for television, film and theater. Her recent television credits include the AMC series The Walking Dead, Better Call Saul, Halt & Catch Fire, and Breaking Bad. In addition Bialy/Thomas has cast Gotham (Fox), the upcoming Vice Principals with Danny McBride (HBO) and Flaked, starring Will Arnett (Netflix). Recent films: Secret In Their Eyes with Julia Roberts, Chiwetel Ejiofor and Nicole Kidman (November release), Black & White, Stretch (directed by Joe Carnahan). Past favorites include Drugstore Cowboy, Point Break, Rudy, Mr. Holland?s Opus, Reign O?er Me, & Red Belt for David Mamet. Favorite past television credits include Phil Spector (HBO), The Unit (CBS), Jericho (CBS), Mind of the Married Man (HBO), and Picket Fences (FOX). Ms. Bialy?s love for theater has been a recurring theme throughout her career. She recently cast CHINA DOLL with Al Pacino premiering on Broadway November 19. She worked with Des McAnuff at the La Jolla Playhouse for 15 years and various productions at Lincoln Center, The Old Globe, South Coast Rep, and The Guthrie. Broadway: The Anarchist, Jersey Boys, Race, and The Farnsworth Invention. She is a current board member of the Casting Society of America, with 15 Artios Awards nominations to her name. She received her first Emmy nomination for Breaking Bad's final season. Ms. Bialy was the recipient of the 2011 Media Access Award for her commitment to casting actors with disabilities. Her eBook ?How To Audition On Camera? was recently published to wide acclaim. She is celebrating her 15 year partnership with Sherry Thomas at Bialy/Thomas & Associates this September. For more information visit:  www.facebook.com/HowToAuditionOnCamera   http://imdb.me/sharonbialy   http://twitter.com/sharonbialy   http://facebook.com/HowToAuditionOnCamera Gary M. Zuckerbrod ?has been a member of the community for over? 30 years.?Beginning in New York as an Associate to Bonnie Timmermann, Gary?participated in the casting of TRADING PLACES, THE POPE OF? GREENWICH VILLAGE and the pilot and series of MIAMI VICE.? Brought out to Los Angeles by William Friedkin to work on TO LIVE? AND DIE IN LA, Gary then starting as a Casting Director on the NEW? TWILIGHT ZONE series for CBS.?Feature film highlights include A MIDNIGHT CLEAR, BEVERLY?HILLS NINJA and PULP FICTION for which he received The Casting?Society of America?s Artios Award for outstanding Feature Casting.?Television credits include TOUCHED BY AN ANGEL(pilot), THE?TITANIC (mini-series), HBO?s WEAPONS OF MASS DISTRACTION?(Artios and Emmy nominations), THE RON CLARK STORY (Artios?and Emmy nominations), COLD CASE(pilot), WITHOUT A TRACE(2004 Artios Award outstanding episodic casting).?Currently he is casting the hit series RIZZOLI & ISLES and THE LAST SHIP for TNT.?Gary served as president of the Casting Society of America from January 2002 till January 2004 and again in 2009.?He also served as Chairman of the Steering Committee for?Unionization of the Casting Directors and Casting Associates in their?successful campaign for Union Representation.?Gary is proud to be the Union Shop Steward for Television Casting?Directors, and serves as a Trustee on the Board Of Directors of Teamster Local 399. Validated parking available in the five story, left-side parking structure at 625 N San Vicente. Doors open at 7PM for networking Panel begins promptly at 7:30PM. Event is located at City Council Chambers, ground level of the library."
}