{
    "addr": "777 West Convention Way Anaheim, CA 92802", 
    "title": "Pride Con 2016", 
    "url": "http://www.eventbrite.com/e/pride-con-2016-registration-19092943508?aff=ebrowse", 
    "location": "Anaheim, CA", 
    "starttime": "2016-07-29T10:00:00-07:00", 
    "endtime": "2016-07-31T01:00:00-07:00", 
    "desc": "H8 M3 N0T Enterprises proudly presents? . Thank you to everyone who donated Kickstarter campaign, we are now in the next phase:? Pride Con 2016 will be held on July 29th and 30th, 2016 at the Hilton Anaheim. For its inaugural year, we are bringing a lineup of YouTube content creators, musicians, and whole lot more to come. It is a full-fledged convention geared towards the LGBTQA+ community with special guests, Artist Alley, Exhibit Hall, Gaming Room, panels and workshops, concerts, and dance and more. We are more than just a con for the sake of having a con; it is time to celebrate all the achievements we have done and have our voices heard! 2-day badges are $50.00 until December 31 ?2015. Don't forget to put in the special code to ensure some of your registration money goes into the charity pool of your favorite guest of honor choosing! ---------- You must wear your badge at all times inside the convention center. Yes! ?Follow this? ?for instructions with details, screenshots, and video. ?Still having trouble? ?Contact Eventbrite Customer Support: Badges are not allowed to be transferred or sold. Your refund request must be received within 30 days of your registration purchase date. ?After 30 days, you may still edit your registration or transfer your pass to the following year. ?Fees will be applied to transfers for the following year.?Deadline for any registration refunds, edits, and transfer, is June 1st, 2016 regardless of when the pass was purchased.? ?All badges purchased after June 29th, 2016 are non-refundable and non-transferable to the next year. Email your refund request to?registration@pride-con.com?Dont forget to mention your full name & order confirmation number. ? Please contact us directly at contact@pride-con.com Photo IDs is required in order to pick up badges at pickup. You may also use your smartphone access your registration confirmation using Eventbrite's mobile app. There are no age limits to enter the event. All ages are welcome.? ? Ontario Airport is located 35 miles from the hotel. It is serviced by Alaska, American, America West, Continental, Delta, Northwest, Skywest, Southwest, TWA, United and USAir. Badges are not allowed to be transferred or sold. No. As long as you have your confirmation number with you and a valid ID, we can find you in the system.? No. Registration information must match the attendee. HMN reserves the right to change their Cancellation and Refund Policy at any time, without notification. Pride Con badges are?NON-TRANSFERRABLE. No refunds will be given after June 29th, 2016. Pride Con Cancellation Policy: By registering for a paid or complimentary Pride Con badge, you agree not to sell, trade, or transfer your badge. In the event that HMN determines that you have violated this policy, HMN has the right to cancel your badge(s) and keep any money paid by you. Barcode confirmations and/or badges that have been sold or provided by anyone other than HMN will not be honored by HMN. All badges are the property of HMN and must be relinquished to HMN upon request. I understand that I must register an individual name for each badge and that each name must match a photo ID to receive a badge onsite. If HMN determines that you have purchased more than one badge in your name for any day, HMN has the right to cancel your duplicate badge(s) and the amount paid will be refunded. Industry Guest Guests of Honor Industry Guest Guests of Honor Olivia Has 2 Moms Guests of Honor Guests of Honour EatGayLove Guest of Honor Guest of Honor Guest of Honour Guest of Honour Guest of Honor Guest of Honor TrentandLuke Guests of Honour Guest Performer Guest of Honor V-Squared Guests of Honour"
}