{
    "addr": "300 E. Green Street Pasadena , California 91101", 
    "title": "MONSTERPALOOZA - Pasadena - 2016", 
    "url": "http://www.eventbrite.com/e/monsterpalooza-pasadena-2016-tickets-18985849186?aff=ebrowse", 
    "location": "Pasadena , California", 
    "starttime": "2016-04-22T18:00:00-07:00", 
    "endtime": "2016-04-24T18:00:00-07:00", 
    "desc": "with? ?this? ?as it? ?into all 100,000 sq. ft. of The Pasadena Convention Center! Since it's inaugural event in 2009, MONSTERPALOOZA?has become internationally known as? for fans and professionals of film, makeup, special effects, collectible toys, art and monsters! ?behind some of the greatest creatures ever?created for?feature films, television and the haunt industry as you get lost in the? ?selling one of a kind creations, LIVE?makeup demonstrations and more? !? Enter the famous ?featuring ?from your favorite films as well as debuts of new creations from the world?s best Special Effects Studios all in an atmospheric setting! Each Monsterpalooza event features? ?from the world of? ,? ? , and . Past guests have included actors from film franchises such as? ?and MANY MORE! Every year in the? ?spotlighting fan favorite films from the past and future featuring the stars, directors, and artists responsible for bringing your worst nightmares to life on the silver screen and beyond! Monsterpalooza is a fan friendly event that introduces attendees every year to new? ?exhibits, creators and innovators, products, art and collectibles ? You never know who you will bump into on the show floor! Monsterpalooza 2016 is the? in Southern California!? Make sure to get your tickets in advance; you don?t want to miss it! The Pasadena Convention Center's address is 300 E. Green Street, Pasadena, CA 91101 Yes. The official host hotel for Monsterpalooza is?The Westin Pasadena. To book your? ?please call The Westin at?(626) 792-2727 or visit our website? and click the hotel tab. Monsterpalooza show hours are... Friday ? 6:00pm - 11:00pm Saturday ? 11:00am - 6:00pm Sunday ? 11:00am - 6:00pm ?We highly recommend purchasing your tickets for Monsterpalooza in advance. Getting your tickets in advance will provide you much faster entry! Tickets will not be physically mailed to you. Tickets purchased in advance will be processed as \"WILL CALL.\" Once checked in at the door, you will recieve a wristband(s) for entry. *Tickets are non-refundable.? Yes.? Upon purchasing your ticket, you will receive a wristband for entry. *Tickets are non-refundable.? Monsterpalooza is family friendly. Children 10 and under are admitted free.? Monsterpalooza features Hollywood's biggest talents selling their creations that in most cases can only be found at our show. Exhibitors sell products such as one of a kind masks, hyper-realistic sculptures, costumes, props, collectibles, toys, model kits, makeup,?supplies,?prosthetics, celebrity autographs, DVD's, apparel, and much more! The show is perfect for fans of all genres as well as industry professionals.? Besides an exhibitor hall of? , the massive show floor features creatures coming to life right before your very eyes via? ?by award winning makeup artists, many of which are responsible for bringing your favorite characters from film, television and haunt attractions... Enter the famous? an atmospheric walk through experience displaying?full sized creatures, hyper-realistic sculptures, screen-used props, monsters and animatronics by the world's most talented creature creators... Stop by the? ?for hours of panels and presentations featuring your favorite film stars, directors and artists... AND MUCH MORE! All celebrity guests are scheduled to be at Monsterpalooza all weekend, unless otherwise noted on our website? . *All guests are tentative* Costumes are encouraged but for everyone's safety, please adhere to these rules... -All costume weapons?  be peace bonded. -No functioning weaponry allowed on premises. -Replica guns, rifles, etc.? ?have orange tips and must be immediately identifiable as fake. -All sharp knives, swords, machetes, etc.?  be sheathed at all times. -No chains in chainsaws and no gasoline permitted. -Weapons may not be brandished or pointed at anyone. *Flyering and Promotion of outside events/products of any kind is strictly prohibited inside or outside of the event unless given permission to do so by Monsterpalooza."
}