{
    "addr": "747 Howard St. San Francisco, California 94103", 
    "title": "58th Annual San Francisco International Auto Show November 21-29, 2015", 
    "url": "http://www.eventbrite.com/e/58th-annual-san-francisco-international-auto-show-november-21-29-2015-tickets-18523497279?aff=ebrowse", 
    "location": "San Francisco, California", 
    "starttime": "2015-11-21T10:00:00-08:00", 
    "endtime": "2015-11-29T21:00:00-08:00", 
    "desc": "The San Francisco Chronicle 58  Annual International Auto Show is the Bay Area?s largest and most prestigious auto exposition. Supported by the California New Car Dealers Association, the International Auto Show, which will feature the 2016 model cars, SUV?s, trucks and vans representing the work of 37 of the world?s major manufacturers, will run for nine-days opening Saturday, November 21 and running through the Thanksgiving weekend concluding on Sunday, November 29, 2015 at Moscone Convention Center. The San Francisco International Auto Show, the only auto show held regionally that lures the dazzling high-tech manufacturer displays, will offer Bay Area auto buyers and enthusiasts their first opportunity to see the new 2016 model vehicles all in one place.?The Auto Show will fill the 1.2 million sq. ft. Moscone Convention Center making it the largest exhibition of any kind in the greater Bay Area and the second largest auto show in the western United States.? This year?s show will offer something for every member of the family. In addition to the 2016 model vehicles, the Auto Show will feature: Ride & Drive opportunities from several manufacturers, alternative fuel and hi-tech vehicles; exotic sports cars; the Academy of Art University Classic Car Collection; an electric vehicle infrastructure and technology display from PG&E, the San Francisco Auto Salon with tricked-out vehicles and aftermarket products plus exhibits from the Ferrari Club of America, the Aston Martin Club, Dominator Hot Rods; an auto accessory booth area and much more.? Show hours are: Saturday, Nov. 21: 10:00 a.m. ? 10:00 p.m. Sunday, Nov. 22 ? Thursday, Nov 26: 10:00 a.m. ? 9:00 p.m. Friday Nov. 27 ? Saturday, Nov. 28: 10:00 a.m. ? 10:00 p.m. Sunday, Nov. 29: 10:00 a.m. ? 9:00 p.m.? Admission is $10 for adults with children 12-years and under free when accompanied by an adult.?Tickets can be purchased at the door. For more information visit"
}