{
    "addr": "1126 Queens Highway Long Beach, CA 90802", 
    "title": "A Beacon of Light, Kedren's 50th Anniversary Gala", 
    "url": "http://www.eventbrite.com/e/a-beacon-of-light-kedrens-50th-anniversary-gala-tickets-18766499104?aff=ebrowse", 
    "location": "Long Beach, CA", 
    "starttime": "2015-11-20T18:30:00-08:00", 
    "endtime": "2015-11-21T00:00:00-08:00", 
    "desc": "Kedren Community Health Center presents and invites you to?A Beacon of Light, a gala in commemoration?of Kedren's 50th Anniversary on Friday, November 20, 2015 from 6:30 pm - midnight at The Queen Mary, Long Beach. The gala, attended and supported by Kedren's employees, community partners, and friends is also an event to help support Kedren's children services. Over the past 50 years, Kedren has grown to become one of?the largest direct service organizations for mental health services in South Los Angeles. Just recently, Kedren has made great strides to expand our mission to become a complete holistic and integrated service provider.? In 2014, Kedren added primary care services, centrally located on one campus, thereby promoting and increasing comprehensive wellness for families and children of South Los Angeles. As Kedren moves forward, Kedren Community Health Center will continue to implement and expand our \"One Stop Shop for Care\" services in South Los Angeles to address the mental health, medical, substance abuse, housing and employment needs. Be a part of Kedren's history by attending A Beacon of Light, Kedren's 50th Anniversary Gala Friday, November 20, 2015 from 6:30 pm - midnight with the purchase of a ticket. If you are unable to make the event consider becoming a sponsor. ? Tables may be purchased by making a donation at the value of a following teir by clicking  : ? GOLD SPONSOR???????$5,000 (Recognition in printed programme. VIP seating, table of 10). SILVER SPONSOR???? $3,000 (Recognition in printed programme. VIP seating, table of 10). BRONZE SPONSOR?? $1,000 (Recognition in printed programme.?Preferred seating, table of 10). ? ? ? Yes. Under age drinking is prohibited. Kedren will provide limited transportation from Kedren-Avalon (4211 S. Avalon Blvd., Los Angeles, CA 90011) to the event at The Queen Mary in Long Beach, CA. To arrange transportation, please contact the?Administrative Services Office?at 323.233.0425. Parking costs is included in the purchase of your ticket. This is a semi-formal to formal event. Cameras are permitted. No alcohol and no smoking is permitted in or near The Queen Mary. Yes. To do so, please contact the Administrative Services Office, located on the Second Floor of Kedren Avalon. (4211 S. Avalon Blvd., Los Angeles, CA? 90011). Phone: 323.233.0425 Your answer goes here Yes. To do so, please contact the Administrative Services Office, located on the Second Floor of Kedren Avalon. (4211 S. Avalon Blvd., Los Angeles, CA? 90011). Phone: 323.233.0425 Yes, your ticket has your name and table seating information. If you would like a refund for the purchase of your ticket, please contact the Administrative Services Office, located on the Second Floor of Kedren Avalon. (4211 S. Avalon Blvd., Los Angeles, CA? 90011). Phone: 323.233.0425. No. All tickets and attendees must be registered through the Administrative Services Office, located on the Second Floor of Kedren Avalon. (4211 S. Avalon Blvd., Los Angeles, CA? 90011). Phone: 323.233.0425"
}