{
    "addr": "3126 Beverly Blvd Los Angeles, California  90057", 
    "title": "Gabba Art District", 
    "url": "http://www.eventbrite.com/e/gabba-art-district-tickets-19190823269?aff=ebrowse", 
    "location": "Los Angeles, California", 
    "starttime": "2015-11-21T11:00:00-08:00", 
    "endtime": "2015-11-21T13:30:00-08:00", 
    "desc": "Over eighty murals canvas the alleyways, stairways, dumpsters, gated fences, and garage doors of Historic Filipinotown. Known as the Gabba Art District, this dynamic neighborhood has attracted emerging and well-known street artists from across Los Angeles and around the world. During our tour, we'll explore the alleyways, discuss the murals, and meet the artists, some of whom will be painting live for our group and will share their perspective on painting murals in LA and the global street art movement. Ending at  , we'll meet curator and director Jason Ostro to learn about the history of the mural project and how it's transformed the community. Inside we'll experience the work of many of the same artists and more, in the highly anticipated cash-and-carry Wishlist 3 exhibition of over sixty contemporary artists. In this exhibition, artists and collectors are able to purchase work at affordable prices, created for holiday shopping. A unique component of the exhibition is that it brings a dynamic visual voyage as sold works are removed and replaced by new pieces. ?The gallery was re-curated nine times within just a few hours during the opening? wrote Deborah Vankin of Wishlist 1 in the LA Times. Artists who have painted murals in the Gabba Art District include Dourone, Jason Botkin, Katie Green, Raphael Grischa, Phobik, Moncho1929, Andrea LaHue aka Random Act, Jason Ostro, Jennifer Korsen, Bandit, LOUDLABS, Peter Greco, MD MN, Clinton Bopp, Annie Preece, Matt Gondek, Gianni Arone, The Bleep Bloop, SpaceGoth, Johnny Brushstrokes, Wrdsmith, Thrashbird, Sketchy, Teachr, Septerhed, ThanksOne, Jules Muck, KrossD, Save the Panduhs, Mar, Blandy, Dour One, LeBA, ZLA, Afrika_47 aka Ralph Zimon, and Pastey Whyte. - This is a two mile walking tour. Please dress for the weather and wear comfortable walking shoes. - Recommended for children ages 12 and over. All minors must be accompanied by an adult. - Street parking is available, please read signs carefully and park at your own discretion. - A portion of the proceeds will go to Cartwheel Art and the artists.  - Photography is encouraged."
}