{
    "addr": "1015 North Cahuenga Boulevard Los Angeles, CA 90038", 
    "title": "A Solitary Mann – LA Premiere and Q&A", 
    "url": "http://www.eventbrite.com/e/a-solitary-mann-la-premiere-and-qa-tickets-19613196599?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-03T20:00:00-08:00", 
    "endtime": "2015-12-03T21:30:00-08:00", 
    "desc": "Join us Thursday, December 3rd, at 8 PM for the first LA screening of  ?s documentary, . The latest film from Los Angeles-based French director Zimmermann combines a strong cinematic aesthetic with a cin?ma v?rit? approach to capture the life and practice of the prolific artist,  . Supported by a massive global following, Mann?s painting approach is a combination of menacing attack, fused with bolero romanticism. Taking the viewer behind the paint, Zimmermann will take his audience on a journey of Mann?s world, a place where pain, desire, and lust combine to project the truest parts of the human spirit.   is a triumphant ode to a man who will, no doubt, continue to leave his mark on the art world for years to come. Following the screening, Loic Zimmermann and Jeremy Mann will take to the stage for a Q&A session.?Gnomon has established a standard of quality over the years in bringing young, skilled talents to the market,? says Zimmermann. ?Working as a professional in the film industry, it is a great honor and pleasure for me to present my own production to the students and guests of this event, and to share anecdotes and insights on the process, the difficulties, and achievements that come with this kind of endeavor.? The screening is free and open to the public. RSVP today. Seating is offered on a first-come-first-served basis. Due to the popularity of this event, we advise arriving in good time to avoid disappointment. This event will not be Livestreamed. Both Zimmermann and Mann will be available for book and print signings at the end of the event. ? ? 8:00 PM ? 9:00 PM: A Solitary Mann ? LA Premiere 9:00 PM ? 9:30 PM: Q&A with Loic Zimmermann and Jeremy Mann 9:30 PM: Book and print signings ? ? ? Loic Zimmermann is a French director and visual artist based in Los Angeles, developing works that encompass illustration, photography, and film. Zimmermann moved to California in 2008 to work as a concept artist for VFX, contributing to many Marvel blockbusters, including  ,  , and  , as well as films such as  ,  , and  . In directing his own projects, Zimmermann finds a medium that allows for collaborative work while giving him a wide range of tools to experiment with. His experience as a photographer and as an illustrator have a direct impact on his cinematography, while his understanding and practice of digital tools allow him to tackle any subject. His first book, e338: The Art of Loic Zimmermann, was published in 2014, regrouping a decade of his personal and professional production. ? Parking is usually available on surrounding and nearby streets. Please note that parking in the Television Center Complex will require parking fees. Unfortunately, Gnomon cannot validate parking tickets for the Television Center Complex. For alternative parking within walking distance, there is a parking lot situated at 1449 Ivar Avenue, CA 90028 (please note that hourly/daily fees will apply)."
}