{
    "addr": "1450 Ocean Ave Santa Monica, CA 90401", 
    "title": "Artist Resource Fair - Santa Monica Artist Opportunities!", 
    "url": "http://www.eventbrite.com/e/artist-resource-fair-santa-monica-artist-opportunities-tickets-19199847260?aff=ebrowse", 
    "location": "Santa Monica, CA", 
    "starttime": "2015-11-21T11:00:00-08:00", 
    "endtime": "2015-11-21T14:00:00-08:00", 
    "desc": "Come find out about ways to live and work as an artist in Santa Monica, from affordable housing to health care. All artists welcome. Workshops (seating limited; first come, first served), information tables and light refreshments provided. 11:00-11:20am: Mix and mingle! 11:20-11:50am:  with Daniel Kitowski of The Actors Fund This fun and interactive workshop is designed to give you financial tools you can implement right away, leaving you more confident and in control when it comes to money. Increase your security and productivity - financial wellness lets you focus on your artistic career! You will learn specific, step-by-step strategies to get organized, create a realistic spending plan, develop goals and more. You can pursue your passion without being buried under the weight of constant financial stress, and this is the seminar to show you how. : 1450 Ocean is on the west side of Ocean Ave just north of Broadway. Parking is $1 for first 2.5 hours in Parking Structure 6 (2nd between Broadway and Santa Monica), each 30 min. thereafter $1.50, max $14. At the Civic Auditorium lot just down Main Street at 333 Civic Center Dr; $5 all day, every day. Meters on Ocean Avenue; $2/hr maximum 3 hours. More info:  . Buses that serve 1450 Ocean include Routes 1, 2, 8, and Rapid 10. Visit   for more information. Biking to 1450 Ocean is always encouraged! ? :?The Santa Monica Cultural Affairs Division supports the arts and the artists of one of the world's most exciting coastal destinations. A division of the City of Santa Monica?s Community and Cultural Services Department, Cultural Affairs produces, presents and facilitates access to cultural events for residents and millions of annual visitors, helps anchor the diverse creative sector that enriches our cultural and economic base, and promotes Santa Monica as a major cultural destination. This includes managing the City?s extensive collection of public art ranging from murals to interactive installations, with new projects being developed in conjunction with most Santa Monica public works projects, as well as offering four grant programs for Santa Monica-based arts and culture organizations, schools and individual artists.? Join the community of makers and movers at the Camera Obscura, 1450 Ocean Ave in Palisades Park. It's a place to learn salsa moves, enhance your blogging skills, design a font, mix a perfume, solder a circuitboard or tile a mosaic and much more! It all happens at 1450 Ocean Avenue in Palisades Park, steps from the entrance to the Santa Monica Pier. This midcentury building houses the iconic Camera Obscura mechanism and offers lovely views of the ocean as well classes, cultural events, and Artist Residencies. After class check out the plethora of local restaurants, or even take a turn on the ferris wheel down on the Pier!  ?or check our current  . Contact communityclasses@smgov.net or call 310-458-2239 View and Register for classes at? Visit us at"
}