{
    "addr": "1253 Bishops Rd, Los Angeles, CA 90012 ", 
    "title": "Next Level West QB & Skill Position Training - High School Camp", 
    "url": "http://www.eventbrite.com/e/next-level-west-qb-skill-position-training-high-school-camp-tickets-18698997204?aff=ebrowse", 
    "location": "", 
    "starttime": "2016-01-30T11:00:00-06:00", 
    "endtime": "2016-01-30T15:00:00-06:00", 
    "desc": "Next Level Athletix is returning to Southern California on Saturday, January 30th to hold our 2nd Annual Next Level West QB & WR Off-Season Training Camp. The small group training will take place on the campus of Cathedral High School in Los Angeles. Our off-season camp accelerates understanding and proper execution of each player?s mechanics while helping them develop the ability to self-correct during times of stress on the field. We achieve this goal through a proven process, as evident with the number of varsity starting quarterbacks and wide receivers across high school football.  The HIGH SCHOOL QB & WR training will include athletes in the classes of 2016, 2017, 2018 & 2019 during the 2015-16 school year. Check-in will take place from 11-11:30AM and the camp will run from 11:30AM-3PM.    We are opening registration to only 15 Quarterbacks and 20 Wide Receivers.  Each athlete will receive a Next Level Training dri-fit performance shirt. QB's are required to bring their own football. All athletes must provide their own drinks and snacks. ? FAQs Are there ID requirements or an age limit to enter the event? All athletes attending the event must by in classes of 2016-2019 during the 2015-16 school year. What can/can't I bring to the event? All athletes should bring their own snacks and sports drinks/water. Football cleats are encouraged. You do not need a helmet or any pads. All QB's  MUST  bring their own football. Please bring the football you use during your games. Where can I contact the organizer with any questions? Next Level Athletix Founder/QB Engineer Greg Holcomb can be contacted by phone at 773-615-5060. Or by email at greg@nxtlevelatx.com. Is my registration/ticket transferrable? Your registration can be transfered to the 2017 event should you be unable to attend the 2016 event. ? TENTATIVE CAMP SCHEDULE 11:30AM-1PM: Phase 1 ? Install  ? We begin by applying our language to the specific mechanics of the quarterback and wide receiver positions to ensure all athletes are working in the same system of communication to understand the science and biomechanics that result in an accelerated physical transformation. 1PM-2PM: Phase 2 ? Discover  ? We continue to reinforce the ability to apply the mental to the physical and self-correct isolated areas of the body in relation to throwing and catching mechanics. We achieve this in phase 2 with simple, yet effective drills that begins with the feet and the athlete?s foundation.  ? 2PM-3PM: Phase 3 ? Execute  ? This phase is where the rubber meets the road. Athletes are placed into small groups with maximum repetitions under constant coaching supervision and execute game-like, high stress drills to test their ability to maintain proper mechanics."
}