{
    "addr": "2701 N Sepulveda Blvd Los Angeles, CA 90049", 
    "title": "Reading Rainbow Live with LeVar Burton, William Shatner & Sir Patrick Stewart!", 
    "url": "http://www.eventbrite.com/e/reading-rainbow-live-with-levar-burton-william-shatner-sir-patrick-stewart-tickets-12866294433?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-11-22T14:00:00-08:00", 
    "endtime": "2015-11-22T15:30:00-08:00", 
    "desc": "Hosted by LeVar Burton? ? ?with special guests: William Shatner and  Patrick Stewart ? ? ? ?? Doors open and check-in now starts at? .? ?* Event will begin at? . ? 2701 N. Sepulveda Blvd Los Angeles, CA 90049 https://goo.gl/maps/BqpUo5jCFo22 ? ?Check-in begins and doors open for seating ?Reading Rainbow Live! with LeVar and Friends ?Meet & Greet with LeVar and Friends (for those that purchased the meet & greet) ? Parking for the event is FREE on a first-come, first-serve basis. ?There are a number of parking structures at the venue. ? ? Please note that all children must be accompanied by a parent or?guardian, and we?strongly encourage? ?attendees to bring at least one?child in their group if possible.? At that time,?please proceed to the Check-In Area at the entrance door before?entering the lobby with your group. (Even if you arrive earlier, we ask?that you wait in line with your party until check-in officially starts at?1:15?PM.) ?Once you provide the names of everyone in your party, you will be?handed a ticket and will be admitted?into the event space! ?We will also give out wristbands to those who are doing the meet & greet.? Seating is on a?first-come, first-serve basis?in the CHAIRS?section. There will be a special reserved section up front with?colored?mats where your little ones can sit and get a front-row seat?of the story time readings.? ?Adults can sit on this mat too, as long you are not blocking anyone's view. Please note, we understand that your child may get a little bit squiggly during the event. Please monitor your child at all times and keep them seated as much as possible.? ? The dress code is casual, but please use your best judgment when?choosing your wardrobe (remember, there will be children present at?this event).? ? One final note! Please kindly refrain from filming of any kind. You are more than welcome to take lots of photos during the event, but please no filming. Also, due to a very tight schedule, our celebrity guests will not be able to sign any paraphernalia so please don't bring any to the event. ? ? ? ? ? ? ? due to a very tight schedule, our celebrity guests will not be able to sign any paraphernalia so please don't bring any to the event."
}