{
    "addr": "1196 S San Antonio Ave Pomona, CA 91766", 
    "title": "Members Appreciation Day - The Growing Club", 
    "url": "http://www.eventbrite.com/e/members-appreciation-day-the-growing-club-tickets-19506209598?aff=ebrowse", 
    "location": "Pomona, CA", 
    "starttime": "2015-11-21T10:00:00-08:00", 
    "endtime": "2015-11-21T20:00:00-08:00", 
    "desc": "This November, The Growing Club turns one year old. Join us as we celebrate a year of community-centered work and the people who have made it all possible.  The last year has been incredible for our farm, as we have worked to transform a once empty plot of land into a thriving urban farm that is providing food and education for our community. Come see the work we have been doing and learn how every empty and abused urban lot can be easily and quickly converted into a space for growth, regeneration, and community. As a special thank you to the community of Pomona, which hosts our farm,   The young ones should learn the importance fo food and health early! Dear Members of The Growing Club, At the close of the first year of our club, we want to take a day to express our deep gratitude for your support throughout the year. Your emotional, physical, and financial support have been fundamental to our many successes this year, and we can not express how happy we are that all of you have decided to join us on this journey into community, joy, and growth.? This year has been incredibly fruitful for us, from the many completed projects at Growing Club Member's homes to the development of Sarvodaya Farms and it's new orchard to the variety of videos you all have helped us to produce. Most of all, we value the friendships that have been created, and the feeling of community when we all gather. We hope that with the New Year, we can continue on this trajectory of \"growth\" and help and connect with many people in our community. As a thank you for your support, we have planned a very special afternoon and evening for you.  , where we will be sharing the successes and tribulations of starting a farm with you. We have invited our Farmers-in-Training to this tour, and they will be sharing their experiences working and learning at the farm with you. We will also have produce to sample and take home gifts for all of you. From the farm, we will move  . Manju will be making \"pakora,\" which are vegetables deep fried in chickpea flour batter and spices. After the chai and snacks, we will be sitting down for a . We have gotten a lot done in the past year, so we wanted to take some time to thank everyone for their contributions and participation. Finally,  . ?This dinner will be a chance for all of us to give thanks for the friends we have made this year, the wonderful food we gather over, and the bountiful Earth that supports us all. We hope you all will be able to join us for this special day! Thank you."
}