{
    "addr": "19555 Parthenia Ave Northridge, ca 91324", 
    "title": "WODs 4 TOTs - Totally Kids Christmas", 
    "url": "http://www.eventbrite.com/e/wods-4-tots-totally-kids-christmas-tickets-19497505564?aff=ebrowse", 
    "location": "Northridge, ca", 
    "starttime": "2015-12-12T09:00:00-08:00", 
    "endtime": "2015-12-12T12:00:00-08:00", 
    "desc": "This is a co-ed team competition made up of 1 guy and 1 girl, kinda like Mr and Ms Claus!!! ?The comp has sold out every year and we want to make sure everything is organized and run smoothly so please be on time for registration. ? The purpose of this competition/fundraiser is to raise money for families that need financial aid to pay for medical bills and travel expenses for their childen. Who is Totally Kids? At Totally Kids, we provide medically fragile children with the support and love they need for nurturing integration back into school and home. We go above and beyond the regulations that guide our industry to ensure each child gets the opportunity to grow and develop to their fullest potential. ?Rx and Scaled/Beginner ?? -?Need to be able to complete and understand the 9 movements of lifting.??Have?the basic understandings of all movements. ? Can do most gymnastics movements including, pull ups (beginners will not be required to do pull ups). ?Ring Muscle and Bar Muscle Ups are not required. ? -? ?? Know all CrossFit, movements including Olympic lifts and Gymnastics. ?There is no excuse or requirement for you. ?You should know how to do it all.? If you have questions about what category your team should be in, the contact information is at the bottom of this write up. ?We are taking? honesty when it comes to the division you tell us you want to be in. If anyone is in a division that the judge feels shouldn?t be there, you will either be disqualified or moved up or down in a division. Please be honest, so it is fair to all competitors. ?If you need to make any changes to your division, you will have 1 week prior to the competition to make a change. ? There are absolutley no refunds.? : $50 per team : MBX Athletics, 19555 Parthenia Ave, Northridge, CA : December 12th @ 9am ?Please arrive by 8am so you can get you registered. Competition will start promptly at 9:00 am. ?This is going to be a great event for all levels!! This event will be a compilation of Hero workouts. ?We will also incorporate the Girls, Strength Ladders and other fun movements. ? Scoring will be described in more details when we announce workout. : The fundraiser will be held rain or shine at MBX Athletics at 19555 Parthenia Ave in Northridge next to Brent?s Deli. It?s located in a strip mall and signs will be in front to guide competitors to the location. ?There is parking in front and around the back of the building. Feel free to bring chairs, tents, or mobility objects to stretch prior and after the workouts"
}