{
    "addr": "31166 Via Colinas. Suite #1. Westlake Village, Ca 91362", 
    "title": "2015 WODSERIES - Partner Competition Series", 
    "url": "http://www.eventbrite.com/e/2015-wodseries-partner-competition-series-tickets-14485603831?aff=ebrowse", 
    "location": "Westlake Village, Ca", 
    "starttime": "2015-09-13T08:00:00-07:00", 
    "endtime": "2015-12-13T14:00:00-08:00", 
    "desc": "WODSERIES is proud to host the 2015 Partner Competition Series There will be (3) Events held throughout the 2015 Season September 13 . October 11 . December 13, 2015 All series events will be held on Sundays from 8:00am - 2:00pm Event Address: Athletix Gym - 31166 Via Colinas #1 Westlake Village, Ca. 91362 Each Event Team Entry Fee covers three athletes entry fee for the event?- (3) WODS, (3) Custom Gear, (3) Beer Garden & Pizza Tickets, Awards for top three teams in each division, Live DJ, and lots of FUN with the Crossfit Community.? You may register for all (3) events by purchasing the Season Package or register for each event seperately. WODSERIES is like NASCAR racing series, where points are awarded for each partner team at each event and going towards the year ending season Point Standings to decide who is the 2015 WODSERIES CHAMPION in each Division. Each event will award medals and prizes to the Top 3 teams in each division. Each event will have 4 divisions for both Male and Female Competitors. Participants must compete as a Partner Team and must compete on the same Partner Team in order to qualify for the season ending championship at the end of the year. Each partner team is allowed (1) sub for his or her team throughout the year. The sub must compete in the same age group to qualify as a sub for his or her team, but must not be younger than the teams division. The following are the Divisions for the 2015 Season: Mens Divisions: 18-29, 30-39, 40-49, and 50+ & Women's Divisions: 18-29, 30-39, 40-49, and 50+?The partner teams must be made up of two members of the same sex, NO COED TEAMS ALLOWED. The Divisions are determined by your age on December 13, 2015. What ever your age is on December 13, 2015 will determine what age division you will compete in for the entire 2015 season at each event. A partner may opt to go down a division in order to compete with a team but a youger competitor can not move up to an older division, that would be unfair. WODSERIES will also be holding the AFFILIATE CUP CHALLENGE for the 2015 Season. This year we will be awarding the Affiliate CUP to the Affiliate with the most overall points. Each affiliate team entered will receive points at each event based on their finishing place. At the end of the season, the affiliate with the most points will be declared the winner. In order to qualify for the Affiliate Cup, you must have had at least one team entered in each age division through out the year. Unlike last year all team points will count regardless if there are more than one affiliate team in a specific age division. 100 points is awarded to the 1st place team, 95 points is awarded to the 2nd place team and so on down the line. Some affiliate teams will have more than one partner team in each age division throughout the year, therefore ringing up more points for their affiliate team, so the more teams that compete from your box, means the more points you will receive for your Affiliate TEAM.? For movement requirements or WOD info, please log on to our  For more info feel free to email us at   or call 805.551.6444 We look forward to seeing you at the next WODSERIES event :) WODSERIES"
}