{
    "addr": "Los Angeles, CA 90013", 
    "title": "SIX TASTE Downtown LA Walking Public Food Tour 12.27.15", 
    "url": "http://www.eventbrite.com/e/six-taste-downtown-la-walking-public-food-tour-122715-tickets-19102773911?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-27T13:30:00-08:00", 
    "endtime": "2015-12-27T17:30:00-08:00", 
    "desc": "Take part in the Downtown Renaissance as you explore Art Deco skyscrapers and hip bistros, all located in the heart of the city?s most undiscovered district on the brink of a major revival. Sample? pupusas ?made from a family recipe, modern Thai cuisine, and European inspired sweets as you walk around the most urban spot in the country's second largest city. This tour may not be suited for a gluten-free diet.? ITINERARY Guests will be led on a route of about four to six eateries on roughly 12 walking blocks.?The tour lasts about four hours. Some restaurant stops and tastings may include pupusas at Sarita?s Pupuseria and Texas BBQ at Horse Thief in the historic Grand Central Market, Austrian comfort food at BierBeisl Imbiss, artisanal gelato from Gelateria Uli, and doner kebab at Sevan Garden in St. Vincent Court. MEETING/DEPARTURE LOCATION The tour guide will pick up guests on Olive Street entrance of the Millennium Biltmore Hotel, directly across the street from Pershing Square (532 South Olive Street Los Angeles, CA 90013). The tour guide can be identified by the bags with 'Six Taste' on the sides that he or she will be carrying.? Parking is available at Pershing Square Monday-Friday $16 max., weekends $7 all day. ?There is also an open-air lot at the corner of Olive Street and 5th Street and an underground garage on 6th St. (226 W 6th St. 90013) for $10. ?S imilar parking structures and street parking are also in the vicinity. On Sundays, street parking is free.? Parking rates are subject to change. DROP OFF/RETURN LOCATION The tour guide will walk guests back to Pershing Square at the end of the tour. GETTING THERE Take the Red or Purple Line to the Pershing Square stop. For information about schedule and fares, use the Metro trip planner at www.metro.net or call 323.GO.METRO. GENERAL INFORMATION If you have any dietary restrictions or allergies, please let us know at least 72 hours in advance .? Otherwise, substitutions cannot be guaranteed and additional charges may apply. ?We do our best to accommodate any special needs or considerations including wheelchairs, strollers, babies or young children.? Advance purchase required.? The amount of tastings on the tour is equivalent to a full meal. The tours begin with a 15-minute introduction, so if you are running late, you will still be able to find your group at the meeting location. **In the tourism industry, it is customary to tip a standard gratuity of 15% to 20% of the retail price of the tour. If you enjoyed your time on the tour, please be sure to take care of our tour guides. Tip Guide: 15% of 1 ticket= $9; 20% of 1 ticket= $12 TERMS AND CONDITIONS Tickets are non-refundable.? If you need to reschedule, you must contact Six Taste at least 72 hours in advance.? Otherwise, there are no refunds or exchanges for no-shows.? Six Taste reserves the right to cancel tours due to low attendance.? In this case, you will be notified and refunded the evening before the tour date.?? SUGGESTED ITEMS TO BRING Water,  sunscreen, comfortable walking shoes, cash for any desired purchases, a camera. CONTACT INFORMATION 213.798.4749"
}