{
    "addr": "5429 Hollywood Blvd Los Angeles, CA 90027", 
    "title": "SIX TASTE Thai Town Walking Public Food Tour 11.29.15", 
    "url": "http://www.eventbrite.com/e/six-taste-thai-town-walking-public-food-tour-112915-tickets-19103535188?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-11-29T11:00:00-08:00", 
    "endtime": "2015-11-29T14:30:00-08:00", 
    "desc": "This tour takes guests through the only Thai Town outside of Asia. You'll sample diverse Thai dishes from the four different regions of Thailand, all represented in this small ethnic village in East Hollywood. A guide will take you beyond Pad Thai to the heart of Thai culture, Thai American history, and the local culinary scene. ?Some of the highlights include authentic rare Thai curries, pork jerky, and a sampling at a Thai dessert house. This tour may not be suited for vegetarians (all dishes contain fish sauce/shrimp paste/oyster sauce), seafood/shellfish allergies, vegans, and for people who cannot have spicy food. ITINERARY Guests will be led on a route of about six eateries on roughly 6 walking blocks. ?This tour lasts about four hours. ?Some restaurant stops and tastings may include seafood selections at Red Corner Asia, papaya salad and sticky rice at Ruen Pair, duck noodle soup at Sanam Luang Caf?, and dessert samplings at Silom Market. ? MEETING LOCATION The tour will begin at the Golden Thai Aponsi Angel statue next to T-Mobile in the Hollywood and Western shopping complex. The address of the complex is 5429 Hollywood Blvd Los Angeles, CA 90027. The tour guide can be identified by the bags with 'Six Taste' on the sides that he or she will be carrying. He or she will also likely be carrying a clipboard. Parking can be found on the street or at various plazas. DROP OFF/RETURN LOCATION The tour guide will walk guests back to the Thai Angel at the end of the tour. GETTING THERE Take the Red Line to the Hollywood / Western stop. For information about schedule and fares, use the Metro trip planner at www.metro.net or call 323.GO.METRO. GENERAL INFORMATION If you have any dietary restrictions or allergies, please let us know at least 72 hours in advance. ? Otherwise, substitutions cannot be guaranteed and additional charges may apply. ?We do our best to accommodate any special needs or considerations including wheelchairs, strollers, babies or young children.? Advance purchase required.? The amount of tastings on the tour is equivalent to a full meal. The tours begin with a 15-minute introduction, so if you are running late, you will still be able to find your group at the meeting location. **In the tourism industry, it is customary to tip a standard gratuity of 15% to 20% of the retail price of the tour. If you enjoyed your time on the tour, please be sure to take care of our tour guides. Tip Guide: ?15% of 1 ticket= $9; 20% of 1 ticket= $12? ?? TERMS AND CONDITIONS Tickets are non-refundable.? If you need to reschedule, you must contact Six Taste at least 72 hours in advance.? Otherwise, there are no refunds or exchanges for no-shows.? Six Taste reserves the right to cancel tours due to low attendance.? In this case, you will be notified and refunded the evening before the tour date.?? SUGGESTED ITEMS TO BRING Water,  sunscreen, comfortable walking shoes, cash for any desired purchases, a camera. CONTACT INFORMATION 213.798.4749"
}