{
    "addr": "Santa Monica, CA", 
    "title": "Obscura Society LA: Hollywood's First Hidden Getaway", 
    "url": "http://www.eventbrite.com/e/obscura-society-la-hollywoods-first-hidden-getaway-tickets-19614960876?aff=ebrowse", 
    "location": "Santa Monica, CA", 
    "starttime": "2015-12-13T11:00:00-08:00", 
    "endtime": "2015-12-13T12:30:00-08:00", 
    "desc": "Dubbed by various wags \"the American Riviera,\" \"Rolls Royce Row,\" and the \"Gold Coast,\" this low stretch of oceanfront below the craggy Palisades featured 30 or so eclectically-styled summer homes. Many of these \"cottages\" were designed by California's most noted architects: Richard Neutra, Wallace Neff, Julia Morgan, John Byers, Paul Williams, and Webber and Spaulding. But the reason for this neighborhood's international fame had nothing to do with its innovative architecture and everything to do with its residents, who included the most powerful men and women in the movie business. Stars like Cary Grant, Mae West, Peter Lawford, Orson Welles, Harold Lloyd, David Niven, Errol Flynn, Greta Garbo, and Anita Loos frolicked in the surf after long days at the studio. Most famous of all was Marion Davies' gargantuan \"Beach House,\" where epic, star-studded parties lasted all day and night. Join Atlas Obscura writer and field agent Hadley Meares as we take a beachfront walking tour of the Gold Coast. We will view the exteriors of the remaining homes of heavyweights like Mary Pickford and Norma Talmadge, and recount tales from the storied coast's scandalous past. At the end of the excursion, we will take a docent led tour through the lovely Marion Davies Guest House, designed by Julia Morgan, the legendary architect of San Simeon. - This will be a walking tour on the beach. Dress appropriately. - Directions and meet up location will be provided the week of the adventure. - This event is weather dependent. If we are expecting significant rain on this date, we will cancel the event. Tickets will be refunded or transferred to a rescheduled date, depending on your availability. - A portion of the proceeds will be donated to the Marion Davies Guest House. Questions? Email Field Agent Hadley Meares: hadley@atlasobscura.com"
}