{
    "addr": "7226 S. Figueroa Street Los Angeles, CA 90003", 
    "title": "CII's ASQ-SE Training - Dec. 7, 2015", 
    "url": "http://www.eventbrite.com/e/ciis-asq-se-training-dec-7-2015-tickets-19520630732?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-07T08:30:00-08:00", 
    "endtime": "2015-12-07T12:30:00-08:00", 
    "desc": "CII's ASQ-SE Training - December 7, 2015? ? From very early in life, children begin to learn to regulate their emotional states, create relationships with caregivers, and explore the world. These social and emotional skills are critical to all other learning. Recognizing and responding to concerns about social and emotional development is key to helping children stay on track. The Ages and Stages Questionnaire: Social Emotional (ASQ-SE-2) is a high quality screening tool for use in monitoring that development. In this training, participants will learn the basic concepts of social and emotional growth. Then, they will learn how to administer the ASQ-SE-2; meet with parents about the results; and plan next steps, including referrals, if necessary. Participants will: -???????? Learn basic principles of social and emotional development. -???????? Learn to administer and score the Ages and Stages Social Emotional Questionnaire. -???????? Practice preparing for and completing a meeting with parents to discuss the results. -???????? Learn to determine if a referral is necessary and to whom to make it. ?? Trainer is Dr. Richard Cohen, Director of Project ABC at Children's Institute. Check-in, continental breakfast?begin at 8:30am; Training from 9:00am - 12:30pm ? LOCATION & PARKING:? CII's Figueroa Center - 7226 S. Figueroa St., Los Angeles, CA 90003 - parking is in the lot across the street, but is limited.? Street parking available. Continental Breakfast and coffee provided.?  *Substitutions allowed. No refunds after December 4, 2015.  ? Continuing Education Credits ? 3.5 credits available for PSY, MFT, LCSW, and BRNs APA: Children's Institute, Inc. is approved by the American Psychological Association to sponsor continuing education for psychologists. Children's Institute, Inc. maintains responsibility for this program and its content.  BRN: Children's Institute, Inc. provider #CEP8409 is approved by the California Board of Registered Nursing. ? Questions? Email  CIITrainingCenter@childrensinstitute.org  or @ 213.260.7623"
}