{
    "addr": "22701 South Pelican Hill Road Newport Coast, CA 92657", 
    "title": "Customer Connections West", 
    "url": "http://www.eventbrite.com/e/customer-connections-west-tickets-19100702716?aff=ebrowse", 
    "location": "Newport Coast, CA", 
    "starttime": "2016-02-11T08:30:00-08:00", 
    "endtime": "2016-02-11T16:30:00-08:00", 
    "desc": "It is an exciting time to be a retailer! With online retailers opening stores, stores becoming more digital and the Internet of Things moving from concept to reality, the path to purchase has drastically changed. Customers have more options but fewer choices ? they no longer have to decide where or how to shop, they simply shop at their convenience. Shoppers expect a seamless experience as they move from your store to your mobile app to your website. They are always connected and their expectations have changed. If you aren?t engaging and entertaining them in a personalized way and in the right channel, they?ll shop elsewhere. Our 2016 event will help you create these personal, cross-channel communications. This is the one event you can learn from and network with top retailers, digital marketing industry experts and colleagues in one day. You?ll walk away with new strategies and actionable tactics that will transform your marketing campaigns. Your time is valuable. That?s why we?ve put together a one day program that will answer all of your questions and give you new ideas that are easy to implement when you return to your office. You?ll hear from speakers who have overcome many of the same challenges you face. We?ve restructured our event to meet your needs and expectations. With more time to network, interactive round table discussions, training opportunities and industry leading guest speakers and sponsors, we?re delivering the content you need in a digestible format. You?ll still hear the great tactical sessions and walk away with actionable ideas that are easy to implement, you?ll just have additional opportunities to round out your day. Retail marketers who are serious about revamping their marketing strategies or who are interested in learning about new trends and technology to help personalize the customer journey ? this event is for you. We?ll have sessions and events scheduled for CMOs, marketing VPs, retail email and eCommerce marketing managers, email designers and Listrak power users. We?re also offering one to one training sessions for Listrak clients. Contact us to schedule a topic and time. Shoppers expect a seamless experience as they move from your store to your mobile app to your website. The multiple data sources don?t have to be a pain point to manage. In this session, Ross shares how Listrak can orchestrate the personal, cross-channel communications you have with each shopper. You?ll learn how to use the data to build effective omnichannel campaigns that engage shoppers and drive revenue in every channel. Enjoy a refreshing mimosa while networking. Visit our sponsors in the lobby or join the first of two open discussions in the main conference room.? The first 30 days are critical. It?s not enough to just acquire subscribers, you must carefully nurture them to the first ? and second ? purchase. This time frame sets the foundation for a loyal and long-term customer so don?t miss the opportunities to engage each shopper. We share creative acquisition tactics, how to create an on-point welcome series, how to optimize transactional messages and how to personalize the post purchase campaigns to get the second sale.? Moving beyond the first month, it is imperative to keep customers engaged and shopping. Batch and blast promotional messages are still the main revenue drivers for nearly every retailer, but there are ways to update these campaigns to be even more effective. And you must keep the engagement going at every touchpoint. We share real examples of what retailers are doing to segment their lists in creative and exciting ways so they reach the right shoppers every time they send an email. They will also show you how to use customer data to inform campaigns in multiple channels and will dive into how to re-engage and winback shoppers. Help yourself to our delicious lunch buffet and then choose from one of our two sponsored lunch and learn sessions. Or, join us for a strictly networking lunch if you prefer. You have the data. We?ll show you how to use it effectively in this session! One of the biggest challenges that retailers face is how to leverage customer data to strategically inform messages. We take the guesswork out of it by sharing easy to implement tactics that will help you segment your audience and personalize each message in order to keep customers engaging with your brand. All of the campaigns and messaging strategies you heard today are put to the test in this session! Testing should be a major initiative for retailers, but it is often overlooked due to time constraints. We share some ideas on what and how to test to achieve maximum results across all campaigns and aspects of your marketing efforts.? All of these new campaign ideas are designed to drive engagement and revenue, but how do you know they're working? In this session we'll share the metrics that matter most. Data is everything and you?ll learn how to analyze your data so you can optimize campaign performance as well as use your data more effectively to personal each and every marketing communication you send. The day ends with our designers dissecting the best of the best campaigns from a design perspective, giving you advice for mobile messaging, subject lines, display ads, content ideas, and cross-channel campaigns."
}