{
    "addr": "Location details provided to registered guests Long Beach, CA", 
    "title": "FootNight Long Beach \"Naughty or Nice Year End\" Foot Party - 12/19/2015", 
    "url": "http://www.eventbrite.com/e/footnight-long-beach-naughty-or-nice-year-end-foot-party-12192015-tickets-19559289361?aff=ebrowse", 
    "location": "Long Beach, CA", 
    "starttime": "2015-12-19T20:00:00-08:00", 
    "endtime": "2015-12-20T01:00:00-08:00", 
    "desc": "On Sat, December 19th, 2015, Footnight Long Beach will be having our ?Naughty or Nice? year end Holiday Foot-Fetish party the last Saturday before Xmas!  Take a much needed break from Holiday shopping and relax by getting your Holiday Foot-Fetish Fix at FootNight-Long Beach!! Come hungry! There'll be plenty of complimentary food, snacks, & beverages (soda, water, & coffee) to keep your tummies full. The Long Beach FootNight venue does have a cash bar; however, you may B.Y.O.B. anything you like to chill in the venues large refrigerator. Join us at FootNight-Long Beach?s ?Naughty or Nice? Year End Holiday Foot Party on Saturday December 19, 2015! If you have any questions email us directly at: FootNightLB@outlook.com or visit our webpage at: www.footnight.com/longbeach.html  -Russell Peter | FootNight-Long Beach, ca Regional host Follow us on twitter @FNIpromotions | @Footnight - Street parking - Private 1-on-1 play spaces - Semi-Private play spaces - Group play spaces - Cash Bar - Free snacks and soft drinks- BYOB  - Food, water, ice, & coffee are complimentary \"Ultra Deep Discounted\" Entrance - $25 until til Saturday Nov 21, 2015 at midnight.  ? \"Super Deep Discounted\" Entrance - $35 through Black Friday / Cyber Monday Nov 30 at midnight \"Deep Discounted\" Entrance - $45 til December 12 at midnight (1 week before the actual party date)  \"Discounted\" Entrance - $55 Dec 13-Dec 19 (the final week prior to the party)  $20 per 10 minutes of glorious foot indulgence!    Short Of Money? Can't Afford To Enjoy Multiple Girl's Feet At $20/10mins?  Or do you just want a quick sample sniff, touch or trampling by several girls feet? Footnight Now Introduces Our \"5-4-2?\" Mini Foot-Fix Sessions\"! Now * * Can Easily Afford To Come To Footnight and Experience Unforgettable Foot Dreams & Fantasies  At The Premiere #1 Foot Party Scene On The Globe! Now * * Who Loves Feet Has The Opportunity To Experience FOOTNIGHT .."
}