{
    "addr": "330 North Brand Blvd., Suite 1200, Glendale, CA 91203  Glendale, CA 91203", 
    "title": "The Serious Entrepreneur's Playbook: Playing & Winning the Business Game!", 
    "url": "http://www.eventbrite.com/e/the-serious-entrepreneurs-playbook-playing-winning-the-business-game-tickets-19302055969?aff=ebrowse", 
    "location": "Glendale, CA", 
    "starttime": "2015-11-30T10:00:00-08:00", 
    "endtime": "2015-11-30T12:30:00-08:00", 
    "desc": "How can you play...and win, if you don't know the rules? Launching and operating a business is very similar to children at play. Not that entrepreneur's or business owners are children, but when competitive levels are heightened you can catch glimpses of those who ruled in high school, the social butterflies, the ones who manned the library and those who had something to prove. Many believe business is not a game, but I can assure you the ones who are successful are like kids at play! Watch long enough and you'll see business is the landscape where entrepreneur's are free to release their inner child to play. I find it ironic that games come with guidelines, rules and a roadmap to escort you from the beginning, through the journey and how to emerge as the victor. But there are no easy to understand, written rules for the \"game of business.\" I used to believe there were no rules. But discovered there is structure and framework in everything whether you acknowledge it, or not. Evaluate and assess successful people in their lives, careers and business and what will be revealed is a blue print, principles and rules when applied, equate to triumph. There are     every business owner must know and apply to their business framework in order to create a marketable, profitable and sustainable company. I want you to be capable of executing principles, rules and success methodologies that took me hard knocks to learn. I want you to set a goal and know how to employ it to the outcome you desire. I want you to have the life you deserve.  ... Will you accept my invitation?"
}