{
    "addr": "1006 South Olive Street Los Angeles, CA 90015", 
    "title": "Cutting Workshop With Master Stylist Masahiro Kurosawa", 
    "url": "http://www.eventbrite.com/e/cutting-workshop-with-master-stylist-masahiro-kurosawa-tickets-19327477004?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2015-12-06T10:30:00-08:00", 
    "endtime": "2015-12-06T18:00:00-08:00", 
    "desc": "Studio DNA Salons in association with Eimi by Wella, Beauty Gives Back and the Well Los Angeles is proud to be hosting Masahrio Kurosawa, Master Stylist and Haircutter from Tokyo, Japan. ?Join us for a day learning his unique style of haircutting while discovering the hair industry in Japan and the overall culture of mastery. ?We are hosted by The Well Los Angeles that boasts an amazing event space, a cutting edge salon and a unique fashion experience. ?We couldn't be more proud of our partnership. Kurosawa has been doing hair for over 25 years. ?He currently owns five hair salons throughout Tokyo and the surrounding prefectures. ?His constant pursuit of mastery takes him around Japan teaching and exploring new technology. ?But his latest passion is developing handcrafte shears that are unique to the stylist. This workshop will explore it all, from his techniques, to the culture, to his passion about hair and his passion about shears. ?Everyone that has been in his presence has been honored by his generosity of knowledge and spirit. ? This it NOT TO BE MISSED! ?Everyone loved our first event -  . ?<<-- Click Here We will have several options to partcipate: Early Bird Observer: ? ? ? ?$75 ?(purchases prior to November 23rd) Early Bird Hands-On: ? ? ?$250 (purchases prior to November 23rd) ALMOST SOLD OUT Observer: ? ? ? ? ? ? ? ? ? ? ? $95 ?(purchases after November 22nd) Hands-On: ? ? ? ? ? ? ? ? ? ? $275 (purchases after November 22nd) Group Rates Available ? Yes! ?The ACE HOTEL DOWNTOWN LOS ANGELES. ?Use code? Yes! ?We will have Tanota Takoyaki providing Authentic Japanese Cuisine. You must be 18 years of age or older. ?You must bring I.D. along with your ticket. There is paid parking available south of The Well info@studiodnasalon.com Yes with prior consent. ?We must be informed if you are handing your ticket over to a new attendee. Yes. ?However, we will have a list of names if you lose or forget your ticket. ?That is why ID is required. Refunds are available (with a small fee) prior to December 1st. ?No refunds provided after December 1st. If prior consent was received, then we will honor tickets that do not match the name of the attendee. Consider bringing a letter that states the purchasor is authorizing the attendee to use their ticket."
}