{
    "addr": "TBA (Location announce the week of Event) Los Angeles, CA.  ", 
    "title": "Puff Puff Laugh Comedy Festival", 
    "url": "http://www.eventbrite.com/e/puff-puff-laugh-comedy-festival-tickets-19374488617?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-11-28T14:00:00-08:00", 
    "endtime": "2015-11-28T20:00:00-08:00", 
    "desc": "PuffPuff Laugh Comedy- Car exhibition - Art festival ? ? ? ? ? ? ? ? (18+ ?/ 21+ to PuffPuff & Drink) We would like to welcome everyone to our first PuffPuff Laugh Festival Brought to you by PuffPuffProductions. Our goal is to provide an expirience where everyone can PuffPuff Laugh freely (litterally). We have a fun event lined up from begining to end. An array of entertaninmnet set up for you Starting off with the PuffPuff Laugh Comedy Batle with $100 cash prize for the winner. Live Dj sets by some of Southern Cali's true dj's Playing the best music to set the vibe right!!! Also will have some amazing show cars on display competing for the top 3 slots having a chance to win $150 1st place $75 2nd place and $25 for 3rd place. We will also have a few selected artist performing their best tracks. Exhibiting their amazing art we will have a variety of local artist displaying their work and giving you a chance to purchase some one of kind pieces. There will be a Man Cave with All the major Football games on the tv's, nice cold beers flowing and some amazing tasting $6 plates to fill you up. We will also have tacos outside in the main area. The main event we selected a line up of comedians that will have you laughing your ass off!!! Hosting our PuffPuff Laugh festival Is the one and only Skillz Hudson. Also Performing Isaac \"Flaco' Martinez, Roberto Rodriguez, Walter Reyes and your Headliner TBA. T ?**** Address will be emailed the week of the event **** **** There will plenty of FREE street parking available for everyone **** $$$No ATM's Available Bring CASH $$$? *Car Registration & qualifications Contact PuffPufflaugh@gmail.com before purchasing exhibition pass* Follow us on our social medias ( IG-puffpufflaughcomedy / facebook- puffpufflaughcomedy ) Follow us and have chances to get free prizes and specials for the event!!! ||||| NO REFUNDS |||||| NO IN'S & OUT'S |||||| For more informtaion feel free to contact us at puffpufflaughcomedy@gmail.com"
}