{
    "addr": "650 South Spring Street Los Angeles, CA 90014", 
    "title": "Crave Expo January 31st, 2016", 
    "url": "http://www.eventbrite.com/e/crave-expo-january-31st-2016-tickets-18808734431?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-01-31T17:00:00-08:00", 
    "endtime": "2016-01-31T22:00:00-08:00", 
    "desc": "Crave Expo is proud to announce their 3 rd  official show on January 31st, 2016 between 5:00 pm ? 10:00 pm at The Majestic Downtown (650 S Spring St, Los Angeles, CA 90014).  Crave Expo is a distinct event/wedding tradeshow concentrating on food and beverage catering business'.  This year we will once again be showcasing a wide array of exhibitors, covering many different facets within the industry. ? Crave Expo is miles away from other event/wedding expos.  From our trendy and elegant designs to interactive activities throughout our event, entertain ment begins  from the moment you enter.  Aside from live music, there will be photo booths, beauty stylists, caricatures, and a few more surprises to be revealed at the event. ? The upcoming Crave Expo show is the first where a limited number of the general public will be able to attend. All the previous events have been on an invite-only basis. Because we strive to provide a food tasting and business networking experience for those in the event/wedding sector, we have been recognized by the subject industry as a must attend function with an ideal balance of fun and business. If you are looking for an event/wedding expo that has been approved by influential event coordinators and wedding planners, this is the perfect one. ? https://www.youtube.com/watch?v=AEOfjs07hh0 https://www.youtube.com/watch?v=Smhq2nwSQiU ? Please note that there are a limited number of tickets available due to the maximum capacity of the venue space. ? General admission:  $15. With a vendor for each aspect of an event, this general admission will allow you to get inspired through the variety of vendors Crave Expo will have this year. You will have every access to our expo, except sampling our food vendors. You will  NOT  be allowed to sample food with this ticket.    VIP admission:  $50. In addition to the benefits of the general admission, VIP admission will have access to sample one portion of all the samplers from all of the food vendors. ?**Crave Expo not responsible for vendors running out of food** ? ? ? Thank you very much, and we hope to see you there!"
}