{
    "addr": "1201 South Figueroa Street Los Angeles, CA 90015", 
    "title": "Volunteer Registration: 2016 Pacific Pole & Aerial Championships", 
    "url": "http://www.eventbrite.com/e/volunteer-registration-2016-pacific-pole-aerial-championships-registration-19053042162?aff=ebrowse", 
    "location": "Los Angeles, CA", 
    "starttime": "2016-03-11T08:00:00-08:00", 
    "endtime": "2016-03-13T19:00:00-07:00", 
    "desc": "In order to provide a performance venue for all levels of dancers, we rely on an army of volunteers in the pole community and beyond to help the competition run smoothly. Anyone can volunteer and it is a great way to support your aerial sisters and brothers. Even competitors are encouraged to volunteer after they have completed their events! Volunteers are invited to come before their shift, or stay after to enjoy the other performances in the section. There will be volunteer opportunities in the following areas: ?Those interested in judging the performances of the competitors are encouraged to apply. Instructors at all pole or aerial studios and other professionals are encouraged to apply to judge the competitors in the different events. We will match your experience with the competitors skill levels. We are also looking for choreographers and dancers that would like to judge the artistic events. Those without experience that would like to participate in the judging process can assist by acting as referees or time-keepers. ?Those interested in making sure that competitors are checked in at the stage and ready to compete to allow the competition to run smoothly are encouraged to register. You?ll also be cueing the DJ, directing backstage traffic, and will have a front row (well, side view) seat to the action. ?Those interested in cleaning the poles between competitors are encouraged to apply. Must be comfortable with climbing a 12' pole between?12-15 times in two hours. If you?re not sure if competing is for you, but still want to get onstage, this might be just the job! Pole cleaners should bring a black shirt and black shorts (shoes/boots optional) that meet PSO costume standards for coverage. We?ll also give you a sweet Bad Kitty? tank as a ?thank you?. ?Those interested in checking in competitors as they arrive, checking and selling spectator tickets and programs, and directing all to their proper areas are encouraged to register. This position is great for meeting tons of people, as everyone coming to the event starts at the registration desk. ?Those with medical or emergency training experience who would like to just be available on-site should any minor injuries occur or to assist should a medical emergency occur are encouraged to apply. These professionals would primarily be on-call, and we give you a front row seat to the show. Individuals who would be able to fill this position should have a medical?background (EMT, RN, MD, etc.). ?Those wanting to assist in any way necessary to ensure that the event runs smoothly and that competitors and spectators alike have a great time are encouraged to register. ?Those wishing to announce each competitor according to a specific script and make other scripted announcements as scheduled are encouraged to register. Those who are avid users of Facebook and Instagram can help us post away on our social sites to keep the community updated on the event. Checking hand stamps and wristbands, while?being able to watch the show from the doorway."
}