{
    "addr": "129 S San Fernando Blvd Burbank, CA 91502", 
    "title": "Burbank - Home for the Holidays - Photo Ready Looks", 
    "url": "http://www.eventbrite.com/e/burbank-home-for-the-holidays-photo-ready-looks-tickets-16943313908?aff=ebrowse", 
    "location": "Burbank, CA", 
    "starttime": "2015-12-12T12:00:00-08:00", 
    "endtime": "2015-12-12T14:00:00-08:00", 
    "desc": "Holidays are a special time of year, a time for celebration, joy and cheer. We will show you how to combine metallic and berry elements to create a festive holiday look that works beautifully on all skin tones! These tips and tricks will help you to achieve the correct balance of the winter elements and warmth of celebration. ? Demonstration Workshop: ? ? Our 2 hour Tips & Tricks workshops include a live demonstration from a working artist who will share their make-up techniques with you.? These sessions are open to all and designed to show you useful tips and tricks for working with key products so that you're comfortable working with them at home.? You are welcome to take notes and photos and active participation is encouraged, so ask questions, get involved, have fun!? You do not need to bring any products or brushes with you during this demonstration only session.? RSVP for you and your friends and arrive at least 10 minutes early in order to ensure that you not only get a seat but get the most out of this workshop. ? All workshop attendees will receive 30% off all MUD products including the workshop featured kit and 10% off MUD Approved products. ** May not be combined with any other discounts.? Some exclusions may apply ? Product Focus:? Picture Perfect Kit: Honeysuckle, Cashmere, Galaxy, Espresso, 4 Hole Mud Palette, Cheek Color Compact, and Shine Lip Gloss.? Retail Value: $89.50 Retail Price: $49 ? We invite you to follow us on: Instagram, Twitter and Facebook @makeupdesignory.? If you take photos of our workshop, please tag us #MUDmakeup #MUDbeauty #makeupdesignory Make-up Tutorials by MUD Instructors can be found on our YouTube Channel: http://www.youtube.com/user/makeupdesignory"
}