{
    "addr": "30 Finsbury Square London EC2A 1AG GB", 
    "title": "'It wasn't me!' - Christmas London Chapter Meeting & Festive Drinks", 
    "url": "http://www.eventbrite.co.uk/e/it-wasnt-me-christmas-london-chapter-meeting-festive-drinks-tickets-14989458875?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-10T16:30:00+00:00", 
    "endtime": "2015-12-10T21:00:00+00:00", 
    "categories": [
        "Science \\u0026 Technology", 
        "Conference"
    ], 
    "desc": "As it's Christmas, we've invited award-winning comedian Bennett Arron to give us his views on identity theft. In fact, Bennett went the whole way and got his identify stolen and takes a poignant reflection on events that took years to resolve. We conclude the event with drinks and networking, where you will get the opportunity to meet with your peers and discuss your cyber security challenges in an informal atmosphere. ? Glenn is an expert in IT security and IT cyber risk. He was the founder of eSupport.com, now part of a major technology group, Phoenix Inc. and has developed several web enabled applications (DriverMagic), cloud solutions and bespoke technologies; including anti-hacking products such as HijackthisPro and KillBoxPro.    He has over 10 years? experience in IT audit gained at HSBC, Trinkhaus Private Bank, Reckitt Benckiser and The Co-operative Bank amongst others. Glenn has operated at senior levels such as Head of Information Security and Head of IT Audit for major 'Blue Chip' companies. ? ? Several years ago, award-winning writer and stand-up comedian Bennett Arron was in serious debt. He owed thousands of pounds to mobile phone companies, catalogues and department stores. Only it wasn?t him. Bennett was a victim of Identity Theft, the fastest growing crime in the UK. This theft resulted in Bennett and his pregnant wife becoming penniless and homeless. Years later, Bennett wrote a comedy show about his experience. The show was critically acclaimed at the Edinburgh Festival and led to Bennett being asked to direct and present a Documentary for Channel 4. The Documentary,     was Pick of The Week in The Guardian and The Telegraph and was called ?Fascinating and Disturbing? by the TV Times.? Bennett has recently written a memoir on the subject. This book,   which has received several 5 star reviews, is not only a disturbingly true yet funny account of what it's like to have your identity stolen and but also reveals the devastating consequences of making a documentary ?in the public interest?. Copies of the book, priced at ?7.99, are available to buy at the event."
}