{
    "addr": "138-142 Holborn London, Gt Lon EC1N 2NQ GB", 
    "title": "L&D - Valuing your talent - HR Analytics", 
    "url": "http://www.eventbrite.co.uk/e/ld-valuing-your-talent-hr-analytics-tickets-17965176326?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-26T18:00:00+00:00", 
    "endtime": "2015-11-26T20:00:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Meeting or Networking Event"
    ], 
    "desc": "Edward Houghton is the CIPD's Research Advisor for Human Capital Metrics and Standards. He is responsible for leading the organisation's human capital research work stream exploring various aspects of human capital management, theory and practice; including the measurement and evaluation of the skills and knowledge of the workforce. He has a particular interest in the role of human capital in driving economic productivity, innovation and corporate social responsibility. Before joining the CIPD in 2013 Edward completed a number of research roles in government and higher education. Most recently he was a Knowledge Transfer Associate at the University of Bristol leading an innovative knowledge exchange programme between the university and Barclays bank. Over 3 years he managed research investigating business culture, corporate social responsibility and community investment. In this role he specialised in qualitative and quantitative social research techniques and strategic project design, developing metrics for the organisation's flagship community investment programme in the UK. Prior to this Edward held a number of research analyst roles in regional and local government as well as the private sector, including at the East Midlands Development Agency, Leicester City Council and the Transport Research Laboratory. In this session delegates will learn about the Valuing your Framework for the measurement and reporting of human capital. Delegates will also learn from case study research new approaches to measurement and use of HR metrics from the perspectives of both HR and finance professionals.? ? 18:00 - arrival & refreshments 18:30 - welcome and start of presentation 20:00 - finish If you are unable to attend an event please give at least 1 working day notice and we will be happy to refund 100% of your booking fee or book you on to a subsequent event to the same value. Cancellations received after this time will be non transferable and non refundable."
}