{
    "addr": "50 Fitzroy St London, Gt Lon W1T 5BT GB", 
    "title": "Tourism Seminar: Jim Butcher", 
    "url": "http://www.eventbrite.co.uk/e/tourism-seminar-jim-butcher-tickets-18531308643", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-07T17:30:00+00:00", 
    "endtime": "2015-12-07T19:30:00+00:00", 
    "categories": [
        "Community \\u0026 Culture", 
        "Seminar or Talk"
    ], 
    "desc": "SEMINAR SERIES AT THE ROYAL ANTHROPOLOGICAL INSTITUTE Dr Jim Butcher, Canterbury Christ Church University Monday 7 December at 5.30 pm In recent decades ?ethical tourism? has become a popular theme amongst some tourists and in the media and universities. New niches, from ecotourism through community tourism and most recently volunteer tourism, are talked up as partial antidotes to the excesses of modern tourism, both for the destinations affected and for the tourists themselves. In assigning the adjectives ?ethical? and ?responsible? to these brands, more mainstream holidays are, by implication (and quite often explicitly) labelled irresponsible, damaging, unaware or just plain thoughtless. There is a clear critique of the mass tourism industry, and its clients, here. How much of the criticism of hedonistic holidaymaking is justified? Does the ethical tourism lobby represent a more moral approach with benefits for communities and the environment, or is it simply moralizing about lifestyle and behaviour? What does the focus on   tell us about social and political consciousness today? Should we celebrate the growth of the freedom to travel for leisure, or be wary of how that freedom is being exercised? Jim Butcher is a Reader in the School of Human and Life Sciences at Canterbury Christ Church University in the UK. He has written three books looking at different aspects of the growth of ethical tourism, and the attendant denigration of mass tourism and the tourist. , Routledge, London. 2003 , Routledge, London. 2007 , Routledge, London. 2015 (with Peter Smith)"
}