{
    "addr": "Maple Street London, England GB", 
    "title": "A Night's Spin at the BT Tower", 
    "url": "http://www.eventbrite.co.uk/e/a-nights-spin-at-the-bt-tower-tickets-18902953242?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-30T21:30:00+00:00", 
    "endtime": "2015-11-30T22:30:00+00:00", 
    "categories": [
        "Charity \\u0026 Causes", 
        "Attraction"
    ], 
    "desc": "On Monday 30th November 2015 I CAN are hosting an exclusive ?Night's Spin? at the top of the iconic BT Tower, which is normally closed to the general public. You will ride the high speed lifts to the famous, revolving 34th floor where you can experience p ?views of the London skyline. You will also be supporting I CAN, the children's communication charity. ?? Proceeds from ticket sales and donations will come directly to I CAN's  , helping us to continue our vital work in the UK to support children who struggle to speak and understand. Tickets are ?60 per person (plus a small booking fee) and includes 60 minutes at the top of the Tower, a glass of bubbly and a sweet treat. You may purchase up to 4 tickets per transaction. If you have any questions about the event, please contact   at I CAN. A Night's Spin starts at 21.30 and ends at 22.30. Please arrive at ?to pass through security. Admittance into the building will begin from 21.00. ? Please bring photographic ID with you such as a driving licence or passport for security purposes. You will not be allowed access to the BT Tower without this.? You are advised to use public transport. The nearest underground stations are Goodge Street, Warren Street and Tottenham Court Road.? There are airport-style security checks before entering the BT Tower so you are advised to carry essential items only. ?Cameras are allowed.? Your ticket is non refundable. If you are unable to attend please kindly inform us by contacting   at I CAN. ?We will re-issue the ticket to help raise more funds for I CAN.? I CAN, Registered Charity 210031"
}