{
    "addr": "Sherfield Building. South Kensington Campus, Imperial College London. London, Greater London SW7 2AZ GB", 
    "title": "Schrodinger lecture: Can we feed the world sustainably?", 
    "url": "http://www.eventbrite.co.uk/e/schrodinger-lecture-can-we-feed-the-world-sustainably-tickets-18472079487?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2016-01-19T17:30:00+00:00", 
    "endtime": "2016-01-19T19:30:00+00:00", 
    "categories": [
        "Science \\u0026 Technology", 
        "Meeting or Networking Event"
    ], 
    "desc": "Can we feed the world sustainably? Professor Sir Gordon Conway, Chair in International Development, Imperial College London Tuesday 19 January 2016 ?     17.30 ?? Lecture: ?Great Hall, Sherfield Building, Imperial?s South Kensington Campus, London, SW7 2AZ    18.30 ?? Reception: ?Queen?s Tower Rooms, Sherfield Building, Imperial College London, SW7 2AZ Meet Imperial researchers developing solutions for sustainable agriculture and?talk with them about their work Abstract Every individual across the globe should have the right and ability to access adequate, safe, and nutritional food at all times. But achieving worldwide food security is not going to be easy. We face growing populations, changing diets, lack of good water and land, and the impact, already being felt, of climate change. We can do it using the modern tools of agro-ecology, crop and livestock breeding, and smallholder-centred institutions, but it needs political leadership. Professor Sir Gordon Conway, one of the world's foremost experts on global food needs, describes the challenges we face and the tools we need to overcome them.   Biography Professor Sir Gordon Conway trained in agricultural ecology, attending the universities of Bangor, Cambridge, West Indies and California. In the 1960s he was a pioneer of sustainable agriculture developing integrated pest management programs for the State of Sabah in Malaysia. He joined Imperial in 1970, setting up the Centre for Environmental Technology in 1976. He has lived and worked extensively in Asia and the Middle East, for the Ford Foundation, World Bank and USAID. He currently leads the Agriculture for Impact programme, advocating for more European government support for agricultural development in sub-Saharan Africa. From 1998-2004 he was President of the Rockefeller Foundation and from 2004-09 Chief Scientific Adviser to DFID as well as President of the Royal Geographical Society. He is a Fellow of the Royal Society and an Honorary Fellow of the Royal Academy of Engineering. Sir Gordon is the author of ?The Doubly Green Revolution: Food for all in the 21stCentury' and ?One Billion Hungry: Can we Feed the World??"
}