{
    "addr": "43 Thurloe Street London, England SW7 2LQ GB", 
    "title": "Teen Tatler Bystander Ball", 
    "url": "http://www.eventbrite.co.uk/e/teen-tatler-bystander-ball-tickets-18069101168?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-21T19:00:00+00:00", 
    "endtime": "2015-12-22T00:00:00+00:00", 
    "categories": [
        "Other", 
        "Party or Social Gathering"
    ], 
    "desc": "It's that time of year again! Teen Tatler's Bystander Ball is back, exploding Christmas cracker style into everyone's social calendar. Book your tickets NOW... We're inviting teenagers aged 13-16 to join us for our next Teen Tatler Bystander Ball?on  Monday, 21 December 2015  at Boujis nightclub, South Kensington, for what promises to be the ONLY Christmas party to be seen at. The ball is from 7pm - midnight and tickets include: ?and MUCH more to be announced Follow the? TeenTatler ?on Facebook and? @TeenTatler ?on Twitter and? Instagram ?to be the first to hear exciting news as it is released and have your say on the playlist and see party photos. Tickets always sell out fast so don't be disappointed and buy today.  Tickets cost ?65 each or? ?60 each when a group booking of four or more tickets is made.? Tickets also include a six-month subscription to Tatler, which you can use to treat yourself or a friend or extend an existing subscription. Further information will follow when you book. ? For secrutiy reasons, all guests must be collected by a parent or appointed guardian. So please provide the full name of the child attending, as well as the full name, telephone and email contact of the collector when completing the booking form.? If purchasing a group ticket of 4 or more tickets, we will contact you for the above information at a later date. ? Jingle all the way! ? For further enquiries: tatlerbystanderball@condenast.co.uk, or call Ella Baldwin on 0207 152 3600 . Disclaimer* - For all parents and appointed guardians, please see the following link for rules and regulations regarding photos and videos taken at the event.?Many thanks. http://www.tatler.com/teentatler/teen-tatler-bystander-ball---information-for-parents-and-guardians"
}