{
    "addr": "61-65 Great Queen Street London WC2B 5BZ GB", 
    "title": "The Official Undergraduate Winter Ball", 
    "url": "http://www.eventbrite.co.uk/e/the-official-undergraduate-winter-ball-tickets-19422083976?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-07T22:00:00+00:00", 
    "endtime": "2015-12-08T03:00:00+00:00", 
    "categories": [
        "Community \\u0026 Culture", 
        "Party or Social Gathering"
    ], 
    "desc": "THE UNDERGRADUATE WINTER BALL? Monday 7th December? The Undergraduate Winter Ball is a time honoured annual tradition, hosted every December. It's an opportunity to celebrate the end of term before everyone goes their separate ways for vacation. This year the University Socials team have gone out of their way to find a huge venue to accommodate our legendary event. We?ve hired SWAY London that holds over 1,000 guests for this annual end of term event. Make sure this date is etched on your calendar. Don?t hang around, book your ticket whilst they?re still available.  Our postgraduate event for 1000 guests sold out in just six days! We have a strict dress code. It?s a formal event so get your shit together and dress the part. Gents, suit up. Ladies, bring out those dresses. We?ll post some examples of attire but for the moment just think debonaire timeless style. Four Rooms || Dance || R&B || Commercial || Hip-Hop || Commercial House - Drinks Promo's All Night Long? - Professional Photographers ?Organised by students from the following Universities...? UCL || LSE || UAL || KCL || CASS || LBS || QMU || HULT || SOAS || RHUL || IMPERIAL || WESTMINSTER || UEL || REGENTS || GSU || BIRKBECK University Socials retain the right to refuse entry, please refrain from excessive consumption of alcohol. Drunks will not be admitted. Be sure to bring photographic I.D. either International passport or EU driving license.We additionally advise arriving no later than 10.00pm as the venue does get very busy and we will not guarantee entry after 11pm. Tickets are non refundable, however they are transferable (please notify the University Socials team via. Facebook).? LAST ENTRY WITH ADVANCED TICKET - 11pm"
}