{
    "addr": "8 Wakley Street , London EC1V 7QE GB", 
    "title": "CDC Key Working Training - London - S.R", 
    "url": "http://www.eventbrite.co.uk/e/cdc-key-working-training-london-sr-tickets-19532146175?aff=ebrowse", 
    "location": "", 
    "starttime": "2016-01-19T09:30:00+00:00", 
    "endtime": "2016-01-19T16:00:00+00:00", 
    "categories": [
        "Government \\u0026 Politics", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Key Working training The Council for Disabled Children has developed training on the key working approach to working with disabled children, young people and those with SEN and their families. This training is for a multi-agency group of professionals from across health, education and care and builds on learning from the Early Support Programme. The training will empower professionals to work in partnership with young people and their families as well as support them in implementing the SEN and Disability reforms. The one-day workshop is an opportunity for colleagues from different agencies to come together to understand the key working approach, functions and how it can benefit families and services. To maximise opportunities for multi-agency discussion within the training session, we?d like to limit the numbers of people attending from the same service. However, we will ensure that online modules will be available for staff who are unable to attend face to face session and that key messages can be shared by those who do attend.? Online modules will be available shortly to complement the workshop and explain how the approach is relevant across health, education and care. Who is the training for? Professionals from health, education and care. It is suitable for anyone who has previously attended key working training and for those who have not.  If you are a parent or carer, you are very welcome to attend too. You will receive your pre-reading materials in your confirmation email. Please ensure you read this in preparation for the training. Event location ?and times: This training will take place at the following venue: National Children's Bureau, 8 Wakley Street, London, EC1V 7QE Click here for directions ? The training will start at 9.30am and finish at 4.00pm.? Please arrive for registration in good time as the training will start promptly at 9.30am. Refreshments and a working lunch will be provided.? Please ensure you make your booking one week before the start of the training to ensure we have accurate numbers for catering purposes. Booking details: When making a booking please ensure that you are booking as the attendee as opposed to booking for someone else ? this is very important as we need to capture the individual data for each attendee. Please ensure that the  correct email address  is enterered when making your booking as you will receive an automated email to confirm your place and this will also have the link to the pre-reading materials. If the email spelling is incorrect, you will not receive confirmation of your place and important updates. If you do not receive a confirmation email within 10 minutes of completing your booking, please contact us? immediately as your booking may not be complete which could result in you losing your place on the training. Please do check your spam folders before contacting us. Cancellation: If you are unable to attend the training, please cancel your ticket as soon as possible so that someone else will get the opportunity to attend this training and also to kindly let us know accurate numbers for catering to avoid wastage. To cancel your ticket, please make sure you are logged into eventbrite then go to: Contact cdckeyworking@ncb.org.uk"
}