{
    "addr": "251 Pentonville Road London N1 9NG GB", 
    "title": "Developing Commercial Awareness", 
    "url": "http://www.eventbrite.co.uk/e/developing-commercial-awareness-tickets-18831494507?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-02T09:00:00+00:00", 
    "endtime": "2015-12-02T16:30:00+00:00", 
    "categories": [
        "Government \\u0026 Politics", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Description: ? In discussions with many authorities the need to develop a range of new and dynamic skills to meet future demands and challenges is often to the fore. A frequently sighted area is commercial awareness. But what does that mean in practice in terms of organisational culture, management style and individual skills. Is the organisation espousing the need for commercial thinking but at the same time putting barriers in the way? This workshop is an interactive opportunity to develop your awareness and understanding, share experiences and opportunities and stimulate ideas and possibilities.? ? ? Key Outcomes ? ? Programme ? 09:15???? Arrival and registration 09:30???? Welcome and Introduction ? Clarifying workshop and individual goals 10:00 ??? What is it? ? Developing a shared understanding? 10:20???? Strategy and finance ? Demands, constraints and choices ? ?The cost, time, quality paradox and how to use it 11:00 ??? Break 11:20???? Creating a culture that encourages rather than blocks and stifles ? ?Service users as customers ? ?How the ?value chain? works in the public sector 12:45???? Lunch 13:30???? A creative, commercial approach to solving strategic or operational problems 14:30???? Using financial information ? ?Understanding the impact of commercial models 15:00???? Break 15:15???? Understanding cost v value ? ?Risk management ? ?Understanding the commercial impact of hard to measure factors e.g. reputation or ? ? ? ?staff motivation 16:15 ? ?So what next for you? ? Who Should Attend ? The workshop is intended for Leaders and Managers looking to develop responses to the challenges faced by Authorities. It is also useful for those with strategic roles in organisational change and policy making. It will also be useful for managers in areas moving into a more commercial environment who are seeking to get to grips with it.? ? Speaker ? Keith Crampton, Wiz Training and Development Ltd. Keith is an experienced trainer, coach and facilitator specialising in Local Government but with experience in private sector organisations as well as charities. Specialising in organisational and culture change Keith has worked with Authorities of all types. His experience before forming Wiz was as a Training and Organisational Development specialist working in both Local Government and the NHS. He brings an enthusiastic and engaging approach coupled with a focus on achieving real improvements in individual and organisational performance."
}