{
    "addr": "9-23 Marsham Street London, Gt Lon SW1P 3DW GB", 
    "title": "CrimiKnowledge Presents: Nature v Nurture (A-Level Conference - London)", 
    "url": "http://www.eventbrite.co.uk/e/crimiknowledge-presents-nature-v-nurture-a-level-conference-london-registration-18678464791?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2016-02-02T09:30:00+00:00", 
    "endtime": "2016-02-02T16:00:00+00:00", 
    "categories": [
        "Family \\u0026 Education", 
        "Conference"
    ], 
    "desc": "This unique event explores one of the biggest questions in Criminology: What causes people to commit crime? Over the course of this one-day conference, there will be a range of interactive and engaging lectures from some of the UK?s leading names in Criminology. Our keynote speaker and host on the day is one of the UK?s most influential public criminologists, star of ITV?s Bring Back Borstal and presenter of Channel 5?s Killer Psychopaths, Professor David Wilson. Professor Wilson will open the conference and give an introductory lecture entitled ?What is Criminology?? This lecture will provide students with an introduction to the academic discipline of Criminology and discusses how the following lectures are all linked to the fundamental criminological question: why do people choose to commit crime?? Notably, our conferences include a question and answer session with Noel ?Razor? Smith, one of the UK?s most prolific ex-bank robbers. Noel discusses in detail, his life story exploring the choices he made that lead to him spending over 30 years in prison. Other speakers on the day include: Dr. Elizabeth Yardley, Director of the Centre for Applied Criminology at Birmingham City University; Professor Graham Pike, Professor of Forensic Cognition at the Open University; Craig Pinkney BA (Hons) MA (Crim), Lecturer in Criminology at University College Birmingham and Urban Youth Specialist; and, Liam Brolan BA (Hons), MA (Crim) a PhD student in Criminology at Birmingham City University and founder of CrimiKnowledge. Throughout the day, students will be encouraged to think critically about the material being presented so that they are able to formulate their own views and opinions on the topics in discussion. For more information download the conference e-flyer from  www.crimiknowledge.com ."
}