{
    "addr": "9 Fitzmaurice Place London, Gt Lon W1J 5JD GB", 
    "title": "Oxford10 Christmas Party at The Lansdowne Club", 
    "url": "http://www.eventbrite.co.uk/e/oxford10-christmas-party-at-the-lansdowne-club-tickets-18605904762?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-28T18:00:00+00:00", 
    "endtime": "2015-11-29T00:30:00+00:00", 
    "categories": [], 
    "desc": "Oxford10 is excited to invite you to its largest event of the year: the 2015 Christmas Party. We will be holding a Black Tie event at one of London's finest private members' clubs, The Lansdowne Club. There we will have exclusive use of their stunning Ballroom for the evening, providing the opportunity to mix and mingle with fellow alumni, before dancing the night away.    The evening will be full of amazing entertainment features!    It will begin with a prosecco reception, and tickets will also include tokens for further drinks and mulled wine. A cash bar will be available later on in the evening.    Warm and cold finger food buffet will be served.   The finest Belgian chocolate fountain with a wide selection of dips will  animate your taste buds.   A fun casino table will let you try your luck in roulette the James Bond style.    We are proud to feature alumna  . Each guest will receive a free sample of this unisex perfume, and will be entered into a free raffle to win a full-sized bottle at the Christmas party.  Ruth will be there with an interactive display of fragrance ingredients to stimulate your senses!    Life music entertainment will be presented by alumna Anastasia Gorbunova, co-founder of a rock band  . On top of that, the Magic Circle magician and our own alumnus,  , will surprise you with his incredible tricks! We will have our own DJ and dance floor until  .    Carriages:  .    Dress Code: Black Tie  Manned cloak room will be available. (Strictly no jeans and trainers. Club rules. You have been warned!)    Tickets will be released from  , with the following tiers of ticket price:    Early Bird: ?48 ( , limited number available)  Standard: ?55 (until  )  Last Minute: ?62 (until  )      We look forward to seeing you at our Xmas party!    Anita, Ariana, Ilina, Joanna, Oliver, Xiao  Oxford10 Committee"
}