{
    "addr": "309 Regent St London, Gt Lon W1B 2HW GB", 
    "title": "Westminster Talks: 'Do we have faith in the nation?'", 
    "url": "http://www.eventbrite.co.uk/e/westminster-talks-do-we-have-faith-in-the-nation-tickets-17861721891?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-25T18:00:00+00:00", 
    "endtime": "2015-11-25T19:00:00+00:00", 
    "categories": [
        "Religion \\u0026 Spirituality", 
        "Seminar or Talk"
    ], 
    "desc": "The Very Reverend Dr John Hall was installed as the 38th Dean of Westminster on 2nd December 2006 and is responsible with the members of the Chapter, to The Queen as Visitor, for the mission, ministry and maintenance of Westminster Abbey. As Dean of Westminster he is Dean of the Order of the Bath and chairman of governors of Westminster School. He is also the first chairman of governors of Harris Westminster Sixth Form. He was brought up in South London, taught in Kenya, read theology at Durham and, after two years teaching RE, was ordained in 1975 and served in three parishes in South London. For eight years from 1984 he was a member of the General Synod of the Church of England. From 1992 he was Director of Education for the Diocese of Blackburn. From 1998 until his appointment as Dean, he served as the Church of England's Chief Education Officer, responsible for the Church?s strategy and policy in relation to Higher and Further and statutory education, for 5,000 church schools, and the support of parish-based and voluntary education. He has been a governor of many schools and two universities and was for its first four years a member of the General Teaching Council for England. He has written widely and debated publicly on educational matters and was instrumental in the Dearing Report in 2001, which led to a significant expansion in the number of Church of England secondary schools. He has been a trustee of many charitable trusts. He is a Fellow of the Society of Antiquaries and of the Royal Society of Arts, of Canterbury Christ Church University, and of St Chad?s College in the University of Durham. He is a Companion of St Dunstan?s Educational Foundation. He has honorary doctorates awarded by the Universities of Roehampton, Chester and Westminster, and is an honorary Fellow of the College of Teachers and the University of Wales Trinity Saint David. He is an honorary liveryman of the Worshipful Company of Educators. He is a Pro Chancellor of the University of Roehampton."
}