{
    "addr": "3 Minster Court (corner entry), Mincing Lane London EC3R 7DD GB", 
    "title": "Mentor JCT; Where Businesses Meet Mentors #3", 
    "url": "http://www.eventbrite.co.uk/e/mentor-jct-where-businesses-meet-mentors-3-tickets-19120957298", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-25T18:00:00+00:00", 
    "endtime": "2015-11-25T22:00:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "'Mentor Junction' is an event where you will hear inspirational and value filled business advice, tips & stories from up to four of the Well-known Business Mentors, then have 1 to 1 time with them to receive business advice, tips exclusive to your business; all for FREE! \"This event is in partnerships with Rockstar Hubs - Lokdons only co-working office space with in house mentoring and investment. The Rockstar mentors are UK entrepreneurs who on average have started, built up and sold their own UK companies for an average price of ?18m - across our list of 55 mentors. The event will also be filled with a number of other business owners all looking to improve the growth of their businesses and keen to network with you! It is Free Entry however seats are limited so if you would like to benefit from this fantastic offer from Rockstar Hubs - make sure to register now.  ------------------------------------------------  Each event, 100s businesses attend \"Networking & Business Pitching.\" It?is a rare & great opportunity for everyone to make contacts & promote businesses regularly?(e.g. Weekly & monthly). Our events are a powerful & productive platform for people who want to?gain clients, to promote?businesses?& projects, to create?publicity or to?get advice from great mentors?& entrepreneurs. ---------------------------------------------------- Another great opportunity is where you or anyone else can pitch/promote anything for 30 second or 1 minute via the microphone on the stage. This gives you great ideas about who to talk to or allows you to promote yourself to 100s of businesses for FREE in less than 1 minute! Additionally?- after the presentations-?our regular networking?continues?where you can stay for hours, network, make great connection & enjoy?the drinks. Benefits: ??Promote your business regularly, gain clients & customers. ??Rockstar Mentoring Groups (Initial free business advice) ( ) ? Investment?-?Meet potential investors?& pitch your business.? ??Mentoring?-?Talk to the?UK's premier award-winning business mentors.?Our mentors are regular experts on?Sky TV,?and have been featured in the?Sunday Times?and?The Guardian.?They have also advised?governments?around the world.? ??Office Space?-?Discover London's newest entrepreneurial co-working space to grow your business with?complementary in-house expert mentors. ------------------------------------------------------------- Exclusive offers for LEN members: 1) 15%?discount?in your printing materials (moo.com)? 2) 10% discount?in business mentoring session:? 3) 10% discount?on office space:? 4) 15% discount on business coaching 5) Law (Get in-touch) 6) Marketing [video>?(Get in-touch) 7)?Accounting (Get in-touch) AND many more at the event! 4 reasons to attend?the next business networking event: ??Business networking with?quality people in the City of London ??Exclusive offers?available to you to help you grow your business (mentoring, office space, funding & so on) ??Delicious refreshment?to help you make the most of your time & networking. ??Potential exposure for your business on?Sky TV ----------------------------------------------------------------- Event timing & format ??6:00 to?7:00 ?Initial networking ??7:00 to 7:30 ?offering & presentation ? 7:30 to 8:00? one minute pitch/presentation for all ??8:00 to 10? main networking ??10? event closing To make the networking efficient use the one-minute free presentation to introduce & promote yourself. \"I met with some very interesting individuals, many of which I am sure will turn into ongoing relationships. This is an event which welcomes small-medium sized companies through to those starting their own companies, clearly some talented and motivated individuals with vision of where they are looking to develop and grow.\" ? Matthew, Ablestoke \"It was a really useful and productive evening. Most importantly, it was unstuffy, relaxed and fun.\" ? Richard, Rich Allsop Fitness \"What a fabulous event! Thank you for putting together such a wonderful evening with such lively connections.\" ? Claire, Wellbeing in the City \"The organisers are also very approachable and do their best to ensure people feel welcome. They will help you to make the right contacts both during the evening and afterwards.?From the two events I've attended so far, I have met one new client and three other people providing services which have helped me to develop my own business. I fully recommend attending an event as a way to make new connections, whether they be new clients or others who can provide services to help you grow your own business\". - Patrick Why should you come? ? To get the connections you need to move your business to the next level. ? To meet investors. ? To get and share great ideas. ? Meet potential business JV partners ? Meet potential suppliers and professional experters for your business ? To simply have fun with great like-minded entrepreneurs. Taking part in LEN equals to having thousands of sales people working for you because every other member carries your business card with them.? When they meet someone new who could use your products or services they hand out your card and personally recommend your services. Please feel free to invite your friends, colleagues and business partners to the event and tell those who you think might be interested by simply forwarding this information to them. All sectors of business welcome. We look forward to seeing you! ??  ? Contact: Admin@LondonEntrepreneursNetwork.com"
}