{
    "addr": "3 Minster Court (corner entry). Mincing Lane.  London EC3R 7DD GB", 
    "title": "FREE Business Legal Help & Advice #2", 
    "url": "http://www.eventbrite.co.uk/e/free-business-legal-help-advice-2-tickets-18684106666", 
    "location": "London, United Kingdom", 
    "starttime": "2016-01-26T18:00:00+00:00", 
    "endtime": "2016-01-26T22:00:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Whether you?re a seasoned entrepreneur, a successful start-up, or growing through some early challenges, or planning on becoming an entrepreneur, this event will give you golden nuggets of information to help you grow and avoid legal risks. ? ? ? ?Taking the brave step to become an entrepreneur is exciting, and in the initial buzz and joy we often overlook some of the essential basics that make any business successful. After this free event you will be armed with specific tips and knowledge that will help you achieve your goals. ? ? ? is the CEO and founder of Rockstar Hubs and has a passion for mentoring and seeing businesses flourish. Rockstar Hubs has a team of business mentors who on average have grown businesses from ?0 to ?18 million and who now pass on their know-how to the Hub's members. Rockstar Hubs is supported by the Mayor of London and has partnerships with UK Trade and Investment and the Department for Business Innovation & Skills.?  Successful business mentor, entrepreneurs with multi million pound businesses, author and business coach:  Each event, 100s businesses attend   It?is a rare & great opportunity for everyone to make contacts &  (e.g. Weekly & monthly). Our events are a powerful & productive platform for people who want to? , to promote?businesses?& projects, to create?publicity or to? ? is where   This gives you great ideas about who to talk to or allows you to promote yourself to 100s of businesses for   in less than 1 minute! ?Additionally?- after the presentations-?our regular networking?continues?where you can stay for hours, network, make great connection & enjoy?the drinks. ?-------------------Organized?by LEN------------------ ? ?at?one of?the best business networking?in?the?heart of London. ?Benefits include: ? ? ( ) ? ?& pitch your business.? ? ?Talk to the? Our mentors are regular experts on? ?and have been featured in the? ?and? .?They have also advised? ?around the world.? ? ?-?Discover London's newest entrepreneurial co-working space to grow your business with? ?The Business Show is held in on of  which is only?5 minutes from?Bank, Liverlpool ST station, Tower Hill, Monument Underground?&?Fenchurch St Station! ?------------------------------------------------------------- ? ?1)  ?in your  ? ?2)  ?in  session:? ?3)  ?on  ?4)   on    ?5)   on  ?6)  [video>?(Get in-touch) ?7)?  (Get in-touch) ?AND many more at the event! ? ???Business networking with? ? ?available to you to help you grow your business (mentoring, office space, funding & so on) ? ?to help you make the most of your time & networking. ???Potential exposure for your business on? ? ?Event timing & format ???6:00 to?7:00 ?Initial networking ???7:00 to 7:30 ?offering & presentation ?? 7:30 to 8:00? one minute pitch/presentation for all ???8:00 to 10? main networking ???10? event closing ?To make the networking efficient use the one-minute free presentation to introduce & promote yourself. ?\"I met with some very interesting individuals, many of which I am sure will turn into ongoing relationships. This is an event which welcomes small-medium sized companies through to those starting their own companies, clearly some talented and motivated individuals with vision of where they are looking to develop and grow.\" ? Matthew, Ablestoke ?\"It was a really useful and productive evening. Most importantly, it was unstuffy, relaxed and fun.\" ? Richard, Rich Allsop Fitness ?\"What a fabulous event! Thank you for putting together such a wonderful evening with such lively connections.\" ? Claire, Wellbeing in the City ?\"The organisers are also very approachable and do their best to ensure people feel welcome. They will help you to make the right contacts both during the evening and afterwards.?From the two events I've attended so far, I have met one new client and three other people providing services which have helped me to develop my own business. I fully recommend attending an event as a way to make new connections, whether they be new clients or others who can provide services to help you grow your own business\". - ?Patrick ?Why should you come? ?? To get the connections you need to move your business to the next level. ?? To meet investors. ?? To get and share great ideas. ?? Meet potential business JV partners ? Meet potential suppliers and professional experters for your business ?? To simply have fun with great like-minded entrepreneurs. ? Taking part in LEN equals to having thousands of sales people working for you because every other member carries your business card with them.? ?When they meet someone new who could use your products or services they hand out your card and personally recommend your services. ?Please feel free to invite your friends, colleagues and business partners to the event and tell those who you think might be interested by simply forwarding this information to them. ?All sectors of business welcome. ?We look forward to seeing you! ? ?  ? ?Contact: Admin@LondonEntrepreneursNetwork.com"
}