{
    "addr": "2 Butcher Row London E14 8DS GB", 
    "title": "Reflective Day - The Still Point of the Turning World: TS Eliot’s Four Quartets", 
    "url": "http://www.eventbrite.co.uk/e/reflective-day-the-still-point-of-the-turning-world-ts-eliots-four-quartets-tickets-17618144344", 
    "location": "London, United Kingdom", 
    "starttime": "2016-03-12T10:00:00+00:00", 
    "endtime": "2016-03-12T16:30:00+00:00", 
    "categories": [
        "Religion \\u0026 Spirituality", 
        "Seminar or Talk"
    ], 
    "desc": "Reflective Day ? The Still Point of the Turning World: TS Eliot?s Four Quartets Mark Oakley Saturday 12 March 10.00am ? 4.30pm ? Where is the Life we have lost in living? Where is the wisdom we have lost in knowledge? Where is the knowledge we have lost in information? TS Eliot ? TS Eliot?s Four Quartets is a classic in the great tradition of Western spirituality. By turns mystical, musical, philosophical and fragmentary, the Four Quartets scrutinise our relationship to time, the universe and the divine. The poems bring into focus the glory of the world as well as our dissatisfaction in being purely worldly, the movement of time and our glimpses of eternity, and the need for spiritual health. Written largely during the second world war, they are infused with the insights from the great religious traditions, especially Eliot?s spiritualmentors, Dante, Milton and St John of the Cross. ? In this reflective day, Mark Oakley will look at each of the Quartets in turn, searching for their spiritual resonance and wisdom for us as people of faith today. Mark Oakley is Canon Chancellor of St Paul?s Cathedral. His books include The Collage of God and The Splash of Words: Believing in Poetry(forthcoming, Canterbury Press). ? The day includes reflective worship, lunch and other refreshments and will take place at St Katherine?s Foundation in Limehouse, East London; details will be sent with bookings. Bursaries are available for those for whom the charge would make it difficult to attend: please contact us for details."
}