{
    "addr": "52 Upper Street. Islington. London N1 0QH GB", 
    "title": "SkyTech 2016", 
    "url": "http://www.eventbrite.co.uk/e/skytech-2016-tickets-16988422830?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2016-01-27T08:30:00+00:00", 
    "endtime": "2016-01-28T17:00:00+00:00", 
    "categories": [
        "Science \\u0026 Technology", 
        "Tradeshow, Consumer Show, or Expo"
    ], 
    "desc": "SkyTech 2016, organised in collaboration with SUAS Global, RUSTA & Flightpath Consulting, is a two-day tradeshow dedicated to advancing the commercial UAV industry across Europe.  Now in its second edition SkyTech is more than doubling in size providing information, connections and marketing solutions through an exhibition, 3 conferences, workshops, product launches, live demonstrations and networking events. SkyTech is also a media platform and press day for the UAV industry across the UK, Europe and worldwide.  SkyTech will be attended by experts from across the UAV industry, bringing together manufacturers, suppliers, service providers, government, academia, investors, trade associations and regulatory bodies. SkyTech will also bring together buyers from a range of targeted industries including agriculture, environment, oil & gas, infrastructure, utilities, construction & property, policing, fire service, search & rescue, media, broadcasting and mining.  SkyTech?s exhibition is completely free to attend and will feature the latest in cutting edge technology and services from across the unmanned aviation industry.  Alongside its exhibition SkyTech will also feature a number of conferences and break-out workshop sessions providing information tailored to all aspects of the commercial UAV industry.  UAV Industry Conference Taking place on day one of the event, SkyTech?s UAV Industry Conference will consider matters of regulation, safety, investment, data protection, privacy and liability across the UK and Europe. Next generation technology will also take to the stage through dedicated product launch and technology showcase sessions.  The Survey Industry Conference SkyTech will also feature a two day conference dedicated to the rapidly expanding UAV survey industry. This conference will showcase the range of survey applications suited to UAV technology through a combination of academic, industry and end user led case study sessions. Day one will focus upon innovative uses for UAVs within the fields of agriculture and the environment, whilst day two will consider the role of UAVs for the oil & gas, mining, utilities, infrastructure and construction industries.  Applications Conference SkyTech?s applications conference will take place on the second day of the event. Manufacturers, solution providers and end users will present the latest advances and applications for UAVs within the fields of policing, search and rescue, fire service, security, real estate, media and broadcasting.  Workshops SkyTech?s breakout workshops are must-attend sessions for new and prospective UAV users.  These interactive sessions will give you everything you need to know about UAVs; get to grips with regulation & safety, meet with qualification providers and discover the next steps for incorporating UAVs into your business."
}