{
    "addr": "10-11 Austin Friars London EC2N 2HG GB", 
    "title": "The IPUG Christmas Party and Charity Event 2015", 
    "url": "http://www.eventbrite.co.uk/e/the-ipug-christmas-party-and-charity-event-2015-tickets-18515737068?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-25T18:00:00+00:00", 
    "endtime": "2015-11-26T00:00:00+00:00", 
    "categories": [
        "Charity \\u0026 Causes", 
        "Party or Social Gathering"
    ], 
    "desc": "Regarded by many as the one party NOT to be missed during the festive period - and in austere years past the only market data party around - the legendary IPUG Christmas Party will once again be held at The Gallery, Austin Friars, London, EC2N 2HG on Wednesday 25th November?2015 from 6pm until midnight. All profits from the party will once again be going to the IPUG Charity, London's Air Ambulance. There will be a glass of prosecco when you arrrive, a sponsored bar until close and two servings of a Christmas buffet, as well as late night snacks of bacon sandwiches, sausage sandwiches and veggie sandwiches to send you on your way home and save you filling up at Liverpool St. Burger King (which we both know you'll just leave on the tube or train when you fall asleep anyway).? The venues in-house DJ will be supplying the sounds when the dance floor opens after the raffle. Tickets are now available now on a first-come-first-serve basis via our online ticketing system aa follows: Drinks will be available from the sponsored bar in exchange for vouchers, three of which will be issued when you arrive with a valid ticket.? Venue doors will open at 6pm, the bar will close just before midnight and the venue will close shortly after. Members note that you MUST use your personal, one-time use discount code to obtain your ticket at the members rate. ?In case of issues or if you are a team manager looking to purchase muliple tickets, please contact us. Information correct at time of sending.? Please check the events listing for updated information. FAQs"
}