{
    "addr": "Strand London WC2R 2LS GB", 
    "title": "Adair Turner: Between Debt and the Devil: Money, Credit, and Fixing Global Finance", 
    "url": "http://www.eventbrite.co.uk/e/adair-turner-between-debt-and-the-devil-money-credit-and-fixing-global-finance-tickets-19251138674?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-25T18:00:00+00:00", 
    "endtime": "2015-11-25T20:00:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Seminar or Talk"
    ], 
    "desc": "Edmond J Safra Lecture Theatre, Ground Floor, Strand Campus Lecture: 6.00-7.15pm Reception: 7.30pm-8.00pm at Chapters at King's College London Adair Turner became chairman of Britain?s Financial Services Authority just as the global financial crisis struck in 2008, and he played a leading role in redesigning global financial regulation. In this eye-opening book, he sets the record straight about what really caused the crisis. It didn?t happen because banks are too big to fail?our addiction to private debt is to blame.  challenges the belief that we need credit growth to fuel economic growth, and that rising debt is okay as long as inflation remains low. In fact, most credit is not needed for economic growth?but it drives real estate booms and busts and leads to financial crisis and depression. Turner explains why public policy needs to manage the growth and allocation of credit creation, and why debt needs to be taxed as a form of economic pollution. Banks need far more capital, real estate lending must be restricted, and we need to tackle inequality and mitigate the relentless rise of real estate prices. Turner also debunks the big myth about fiat money?the erroneous notion that printing money will lead to harmful inflation. To escape the mess created by past policy errors, we sometimes need to monetize government debt and finance fiscal deficits with central-bank money.  shows why we need to reject the assumptions that private credit is essential to growth and fiat money is inevitably dangerous. Each has its advantages, and each creates risks that public policy must consciously balance. Adair Turner is chairman of the Institute for New Economic Thinking and the author of  . He lives in London."
}