{
    "addr": "Whitton Road London TW2 7BA GB", 
    "title": "X4TP - Evolution - Call of Duty", 
    "url": "http://www.eventbrite.co.uk/e/x4tp-evolution-call-of-duty-registration-18689634199?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2016-03-26T10:00:00+00:00", 
    "endtime": "2016-03-28T23:00:00+01:00", 
    "categories": [
        "Hobbies \\u0026 Special Interest", 
        "Tournament"
    ], 
    "desc": "Xistance 4ThePlayers requirements are as follows: ? Twickenham Stadium offers onsite parking facilities for those that drive and intend to drive to the venue. For anybody using public transport we will provide a list times associated with public transport upon purchase of a ticket. ? Each player attending the event must provide their own: ? Support regarding our LAN events is available via support@xgenesports.com - You may also contact via Live Support on our website between 9am and 5pm GMT London - Monday - Friday. ? Unfortunately transfer of tickets is unavailable for this event, however, we will look at each case individually to determine a reasonable solution. ? Yes, customers can update there information upto 7days prior to the start date of the event. Any team who has booked one of our hotel packages must have updated information no later than January 31st 2016. ? Teams will be able to provide both a digital and printed ticket copy upon event check-in times.? ? Please review our terms and conditions page on our website regarding our Event refund Policy. ? Teams attending the event will have to register each player at the point of purchasing tickets. We will Roster Lock the event 7 days prior to the start of Twickenham Evolution taking place giving teams who need to make last minute changes the chance to update their competing roster. ? Roster Lock is when a team roster has been finalised to compete at our event. Teams who fail to provide a full competiung roster at the event will be given the chance to utilize a pick up for the event if any should be attending."
}