{
    "addr": "Portman Square Garden. Portman Square. London, Gt Lon GB", 
    "title": "Baker Street Quarter Netball Club - 24 November 2015", 
    "url": "http://www.eventbrite.co.uk/e/baker-street-quarter-netball-club-24-november-2015-registration-19515754146?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-24T18:15:00+00:00", 
    "endtime": "2015-11-24T19:30:00+00:00", 
    "categories": [
        "Sports \\u0026 Fitness", 
        "Game or Competition"
    ], 
    "desc": "Our weekly netball club, powered by Fitness First Baker Street takes place every Tuesday at 18.15.? The club is for individuals of all levels, whether you're a regular player or havent played since your school days. It will include a 15 minute warm-up session and a recap/introduction of the rules and game of 2-3 15 minute rounds. The club finishes at 19.30. Remind yourself of the rules  here .? The club will operate on a first come first served booking basis.? If you have booked a space and are unable to attend you must cancel your booking no later than 4pm the day prior to the session. Failure to cancel means that you will not be able to attend the following week. Meet us at the west gate entrance to Portman Square Gardens (gate opposite Hyatt Regency London hotel) at 18.15 ready to start. You are permitted to use the shower/changing facilities at Fitness First Baker Street before or after if you need to.? If you do bring personal belongings with you these will be left at your own risk. Your coach is Kirsten. ? Each week you will need to register to attend. The link will be included in the weekly newsletter each Monday to reserve your place for the following week's club. Please note:? You should be in good physical condition and be able to participate in the exercise.? You should understand that when participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge Baker Street Quarter Partnership/Fitness First from any and all claims or causes of action, known or unknown, arising out of participating."
}