{
    "addr": "UCL Foster Court, rm. 233. GOWER STREET, LONDON, WC1E 6BT  ", 
    "title": "Birkbeck Criminology Series: Money Laundering in the City of London: London as a laundry of choice", 
    "url": "http://www.eventbrite.co.uk/e/birkbeck-criminology-series-money-laundering-in-the-city-of-london-london-as-a-laundry-of-choice-tickets-18605386211?aff=ebrowse", 
    "location": "", 
    "starttime": "2015-11-26T18:00:00+00:00", 
    "endtime": "2015-11-26T19:30:00+00:00", 
    "categories": [
        "Family \\u0026 Education", 
        "Seminar or Talk"
    ], 
    "desc": ":? ?(Jean Monnet Chair in European Political Economy, Department of European & International Studies, King?s College London, UK) : Money Laundering in the City of London: London as a laundry of choice : The origins of the term ?money laundering? can be traced back to the 1920s in United States, when criminals used the laundering busi- ness to recycle the proceeds of their activities into the legal economy (Lilley 2000: 5). But things have changed substantially since then; there are now a multiplicity of actors and even more techniques available to successful money launderers. It is almost a truism to say that globalization (or better, the techno- logical developments associated with it) simplified things substantially to the extent that some authors provocatively provide ?beginners? guides to money laundering on the Internet (Lilley 2000; Nordstrom 2007: 167). In the lecture we see how this happens. However, as Lilley states ?by its very nature, the whole point of a successful laun- dering operation is to convert dirty funds in one part of the world into clean money in a respected and respectable financial center? (Lilley 200: 17). The City of London is certainly one of the most respectable and, above all, respected, financial services centers in the world; and it is also one of the main final ?depots? of washed money. In a way, the City of London (or another established financial center such as New York or Tokyo) is by definition the final stop of illicit money if the money laundering process is successful. The lecture will elaborate on the role played by the City of London in money laundering as well as the role played by money laundering in the British economy within the context of Globalization."
}