{
    "addr": "London, Gt Lon NW1 4SA GB", 
    "title": "Michael Acton Smith OBE, Founder of Mind Candy, Firebox.com, Silicon Drinkabout speaks at TELL Series, London", 
    "url": "http://www.eventbrite.co.uk/e/michael-acton-smith-obe-founder-of-mind-candy-fireboxcom-silicon-drinkabout-speaks-at-tell-series-tickets-19461817821?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-02T18:45:00+00:00", 
    "endtime": "2015-12-02T21:00:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Michael Acton Smith OBE is the CEO and founder of kids entertainment company Mind Candy ? the creators of global kids phenomenon Moshi Monsters, which has over 90 million users around the world and has expanded offline into best selling toys, the number one selling kids magazine in the UK, a best selling DS video game, top 5 music album which has gone gold in the UK, books, membership cards, trading cards and much more. In 1998, while in his early twenties, Smith co-founded online gadget and gift retailer Firebox.com with university friend Tom Boardman. The pair started out with a rent-free attic and ?800 from undergoing a medical experiment. Their breakthrough moment came in the form of the \"Shot Glass Chess Set\". Within five years they were listed by The Sunday Times 'Fast Track 100' as the 13th fastest growing, privately owned business in the UK. Following his success with Firebox, Michael secured $10m backing and launched Mind Candy in 2004. The company launched alternate reality game Perplex City, a global treasure hunt with ?100,000 buried somewhere in the world that played out across various media. The game gained positive press coverage with Perplex City being hailed as the future of gaming. The game was also nominated for a BAFTA award in 2006 yet only attracted a niche audience. After three years (and $9m spent) Perplex City was placed on indefinite hold. With just $1m left in the bank, Smith took a final roll of the dice. In 2007, having been inspired by the growing success of Facebook and kids brands including Tamagotchi, Mind Candy launched online world Moshi Monsters. Smith was appointed Officer of the Order of the British Empire (OBE) in the 2014 New Year Honours for services to the creative industries. , however, you need to register below to attend. If you can no longer attend the event, please cancel your ticket as soon as possible via Eventbrite (click here for instructions: http://help.eventbrite.co.uk/customer/en_gb/portal/articles/581556)."
}