{
    "addr": "Park Place. St. James Street. London SW1A 1LR GB", 
    "title": "UNION-IP Christmas Dinner Meeting - His Honour Judge Hacon", 
    "url": "http://www.eventbrite.co.uk/e/union-ip-christmas-dinner-meeting-his-honour-judge-hacon-tickets-19378428401?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-03T18:00:00+00:00", 
    "endtime": "2015-12-03T21:30:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "UNION-IP CHRISTMAS DINNER MEETING Thursday 3 December 2015 Our speaker will be  His Honour Judge ?Hacon ?The changing face of IP Litigation? With IPEC now receiving international recognition for its work, our High Court announcing a new faster track route and the incipient UPC the topic of every other blog, litigators have never had more choice of venue ? or maybe have never been more confused! ?His Honour Judge Hacon, calmly at the tiller of the IPEC, will give us his views on the changing face of IP litigation, against the usual Christmas dinner backdrop of crackers, hats and a convivial mood. *********************************************************** The Royal Overseas League, Overseas House, Park Place, St. James Street, London SW1A 1LR. Drinks from 6 for 6.30pm dinner, address by the speaker at about 8pm and a general question and answer/discussion session to finish by no later than 9.30pm, with the bar remaining open for those wishing to continue discussions in an informal atmosphere. 1? hours (unaccredited) Members: ?44,? Non-members: ?69, First time attendees ?35, in-house attendees ?35? Please book through EventBrite NB : please make sure that, especially for block bookings,  the names and email addresses of each individual attendee are given. Please pay by debit or credit card if at all possible ? it is a great help to us if you are able to do so. To pay by cheque, make your cheque payable to ? UEPIP British Group ? and send to: Steven Wake, Forresters, Sherborne House, 119-121 Cannon Street, London EC4N 5AT (phone?020 7283 8989); email:? dinners@union-gb.com For very late bookings after EventBrite bookings have closed, please contact  Steven Wake to see whether booking is still possible (phone?020 7283 8989; email:? dinners@union-gb.com ) ------------------------------------------------------------------------------------------------------------ The British Group of the Union-IP of European Practitioners in Intellectual Property hold regular dinner meetings in London with high profile speakers giving an address on? issues of interest to IP practitioners and users.??Further details of other UNION activities are on our website at? www.union-eu.com .? Please contact Steven Wake (address and phone number as above or email? membership@union-gb.com ) if you are interested in becoming a member."
}