{
    "addr": "Kings Place. 90 York Way. London, London N1 9GU GB", 
    "title": "Creative writing workshop with Greg and Kate Mosse", 
    "url": "http://www.eventbrite.co.uk/e/creative-writing-workshop-with-greg-and-kate-mosse-tickets-18647987633?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-13T10:00:00+00:00", 
    "endtime": "2015-12-13T13:00:00+00:00", 
    "categories": [
        "Film, Media \\u0026 Entertainment", 
        "Class, Training, or Workshop"
    ], 
    "desc": "This fun and informative masterclass is led by ? Kate Mosse , bestselling author of Labyrinthe and The Taxidermist?s Daughter, and creative writing tutor ? Greg Mosse . In just three hours, you?ll learn what makes a strong character, as well as how to develop plotlines and dialogue to create truly compelling stories. The course includes discussions and practical writing exercises, as well as plenty of time for questions. By the end of the day, you?ll have the beginnings of a plot outline and a understanding of how to turn it onto a fully-fledged novel. Course content This course is for you if... Tutor profiles Kate Mosse ? is the bestselling author of the Languedoc Trilogy ? Labyrinth, Sepulchre and Citadel ? as well as a collection of short stories, several other novels, four works of non-fiction and three plays. She is co-founder and chair of the board of the Women?s Prize for Fiction ? previously the Orange Prize ? and, from 2014, the Baileys Women?s Prize for Fiction. Kate is one of the authors leading the campaign against library closures in the UK, and sits on the board of the National Theatre and the executive board of Women of the World arts festival. Greg Mosse ? is a creative writing teacher, writer and editor. He was previously programme leader for creative writing at West Dean College where he taught his own MA degree, validated by University of Sussex, and a wide range of short courses. He curates and teaches the Southbank Centre Creative Writing School and works in story development and consultancy for stage and screen. His knowledge of his subject comes from more than 20 years? professional experience as teacher, editor, translator and writer. ? Full course and returns information on the Masterclasses website"
}