{
    "addr": "Southwark Cathedral. London Bridge . London, Gt Lon SE1 9DA GB", 
    "title": "Christmas Concert 2015", 
    "url": "http://www.eventbrite.co.uk/e/christmas-concert-2015-tickets-19292169398?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-18T19:30:00+00:00", 
    "endtime": "2015-12-18T21:30:00+00:00", 
    "categories": [
        "Music", 
        "Concert or Performance"
    ], 
    "desc": "Southwark Cathedral Choir performs  Mozart's Spatzenmesse  and Christmas Carols  by candlelight accompanied by the Chameleon Arts Orchestra Conductor: Peter Wright Organist: Stephen Disley Southwark Cathedral Choir is a traditional cathedral choir of men and boys. Although there is no choir school and the boys go to a variety of different schools throughout London, they meet at the Cathedral several times a week to rehearse and to sing services. They maintain a consistently high standard and have performed in many venues here and internationally, and regularly broadcast services on the radio. Recordings of these remarkable voices are on sale in the Cathedral shop. ? Wine and mince pies will be available in the interval and the Cathedral Refectory will be open for refreshments and light meals before the concert. This concert is unsuitable for children under the age of five. If you are disabled and need a seat at the end of a row, please email the organiser once you have purchased your ticket, to arrange for a suitable seat to be reserved for you. FAQs What are my transport/parking options getting to the event? The nearest London Underground station is London Bridge (approx 5 min walk) which is on the Jubilee and Northern Line. London Bridge is also the nearest mainline train station. Where can I contact the organiser with any questions? Please email  cathedralevents@southwark.anglican.org  or visit our website at www.cathedral.southwark.anglican.org for further information. Alternatively, please email  cherry.james@southwark.anglican.org Do I have to bring my printed ticket to the event? Yes What is the refund policy? Any tickets purchased are non-refundable unless the event is cancelled. The name on the registration/ticket doesn't match the attendee. Is that okay? Yes **NB All seats are sold on a first come, first seated basis."
}