{
    "addr": "8 John Adam Street London WC2N 6EZ GB", 
    "title": "Macmillan and The RSA: Connected Communities and Beyond the Patient", 
    "url": "http://www.eventbrite.co.uk/e/macmillan-and-the-rsa-connected-communities-and-beyond-the-patient-tickets-18838197556?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-12-01T10:00:00+00:00", 
    "endtime": "2015-12-01T15:00:00+00:00", 
    "categories": [
        "Health \\u0026 Wellness", 
        "Seminar or Talk"
    ], 
    "desc": "We have a ?growing population, an ageing population, and a sicker population? with around 40% of people in the UK living with a long term condition, including 2.5m people living with cancer. The current system is struggling - but strategies such as? The Five Year Forward View ?or  Achieving world-class cancer outcomes: a strategy for England ?recognise that system change alone will not lead to the transformation required to meet the challenges we face. But what will bring about this transformation and where do we start? Building on the pivotal work of the RSA?s recently concluded? Connected Communities programme ,? and Macmillan?s unrivalled understanding of the needs of people affected by cancer,? these initial conversations ?will explore the role of patients, people and our communities as the catalysts for this change. J oin us for either or both of these back-to-back sessions. Connected Communities (10am - 12pm) Beyond the Patient (1pm - 3pm) One of the most pressing challenges the health sector currently faces is how to create a system that is sustainable yet person-centred. It is a challenge that has brought Macmillan Cancer Support and the RSA together in a new partnership, combining our expertise in cancer care and support and public service reform. We understand that the system needs to identify and harness the resources of people and communities. Through this partnership we hope that this series of multi-disciplinary expert conversations will contribute to a new understanding of how we can work together to find a better solution."
}