{
    "addr": "93 Guilford Street London WC1N 1DN GB", 
    "title": "Treating Autism Roadshow: Event for Autism Parents", 
    "url": "http://www.eventbrite.co.uk/e/treating-autism-roadshow-event-for-autism-parents-tickets-18901796783?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-27T10:00:00+00:00", 
    "endtime": "2015-11-27T13:30:00+00:00", 
    "categories": [
        "Health \\u0026 Wellness", 
        "Seminar or Talk"
    ], 
    "desc": "- Lucinda Miller presenting  : Simple ways of improving health and behaviours in children and adults on the autism spectrum. - Stella Chadwick presenting  : Advanced and novel approaches, tests and treatments for more complex and often-overlooked issues in autism - A personal story about a family's journey through autism and an opportunity to meet TA members and like-minded parents, during lunch (included in the admission fee).   ?Stella Chadwick, Clinical Nutritionist and Specialist in Autism Spectrum Conditions, will be taking a closer look at some of the more complex and?often-overlooked issues in autism, and available tests and treatments, including:?Pyroluria;?Lyme disease and co-infections; ?Interpreting and making use of 23andMe genetic tests. Lilia's mum Irina Porter will share their family experience of how nutritional support and ABA programme helped?her little girl with autism lead a fun and fulfilling life, and helped reduce disabling autism-related symptoms.?You will get to hear what helped Lilia and what didn't, how best to learn from other parents? experience and knowledge, and how other parents were crucial in supporting Lilia's Mum and Dad both emotionally and practically on this family's journey. This event is aimed at parents new to autism and to those with more experience. If you know a family that is not part of TA but could use some information, please be sure to share these details with them. ? ? Email us at irina@treatingautism.org.uk Tel: 07510933282 ? Yes. However, if someone else is coming instead of you, please let us know by email. We will have your name on the door, but please bring the ticket along,? Tickets cancelled no later than one week before the event will be refunded in full. We cannot offer refunds for tickets cancelled on or after 20 November. Treating Autism members need to book their ticket and confirm attendance through the standard booking procedure. We are unable to process reservations in a different way. If you are a member of Treating Autism, you wil receive a full refund for your purchased ticket shortly after attending the event. Please note that refunds can only be issued to members who attend the event, or to those who cancel their booking no later than 20 November. For those who are not members of Treating Autism, there will be an opportunity to join as a member on the day, in which case a full refund will also be issued. Tickets can be purchased at the event (free to TA members) subject to availability. Details on the venue and how to get there can be found on Coram's Fields website: http://www.coramsfields.org/"
}