{
    "addr": "7-14 Great Dover Street London SE1 4YR GB", 
    "title": "It takes a village to raise a child: EPODE's community approach for the promotion of health equity through the EPHE Project", 
    "url": "http://www.eventbrite.co.uk/e/it-takes-a-village-to-raise-a-child-epodes-community-approach-for-the-promotion-of-health-equity-tickets-19118170964?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-24T08:00:00+00:00", 
    "endtime": "2015-11-24T10:00:00+00:00", 
    "categories": [
        "Health \\u0026 Wellness", 
        "Seminar or Talk"
    ], 
    "desc": "C3 Collaborating for Health invites you to attend an International Breakfast Seminar with?EPODE?s?Dr Jean-Michel Borys,?on Tuesday 24 November. EPODE*?is a coordinated, capacity-building approach aimed at reducing childhood?obesity through a societal process in which local environments, childhood settings and family norms are directed and encouraged to facilitate the adoption of healthy lifestyles in children. Through the EPHE*?project, EPODE evaluates the efficiency?of?its?community-based?interventions to reduce the health gap in deprived populations, and it is the main conclusion of the EPHE study that the creation of a favourable health environment for families can reduce the health gap. Dr Borys will talk about how by involving the entire community, parental practises are strengthened with positive effects in all populations.?He will be discussing the way in which?targeted interventions such as workshops in the schools on beverages or sleep, parent-teacher conferences on how to manage nagging behaviour and city festivities with healthy buffets, demonstrate that parents of low socio-economic status are now less permissive when it comes to fruit juice consumption and screen time. Dr Jean-Michel Borys is the founder of? Fleurbaix Laventie Ville Sant? Study , a community-based intervention aimed at promoting a healthier lifestyle. He?is the?founder of?the EPODE programme,?and its?European?and International Networks,?as well as?EPHE, a co-funded European project designed to evaluate the added value of community based programmes to promote health equity. Dr Borys has been an expert member in several French governmental agencies and is a member of a number of scientific associations including the American Diabetes Association, the American Heart Association and the European Association for the Study of Diabetes. He has published several books and publications in the field of obesity, prevention, diabetes and lipidology.? We hope you can make it. Kind?Regards, C3 Collaborating for Health Please support our International Breakfast Seminars. Donate? here ! * EPODE: Ensemble, Pr?venons l'Ob?sit? des Enfants? * EPHE: EPODE for the Promotion of Health Equity. (Partners in EPHE include universities and community- based programmes across 7 European member states: Belgium, Bulgaria, Greece, France, the Netherlands, Portugal and Romania as well as partners from the private sector Danone, Ferrero and Mars.)"
}