{
    "addr": "Winchester House, 1 Great Winchester Street . 1 Great Winchester Street. London EC2N 2DB GB", 
    "title": "DBACE 2016 Business Planning Workshop - London 27 November 2015", 
    "url": "http://www.eventbrite.co.uk/e/dbace-2016-business-planning-workshop-london-27-november-2015-tickets-18921937023?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-27T09:30:00+00:00", 
    "endtime": "2015-11-27T17:00:00+00:00", 
    "categories": [
        "Community \\u0026 Culture", 
        "Seminar or Talk"
    ], 
    "desc": "The Deutsche Bank Awards for Creative Enterprise (DBACE) offer final year creative degree students and recent graduates the opportunity to launch their careers by setting up a project or business of their own, with the help of start-up capital, business training and mentoring.  ? Our DBACE workshops provide an overview of what needs to be considered when writing a business plan, addressing key questions about your audience, the length and style of your plan, as well as focussing on how to make it informative yet innovative. The workshops balance creativity with practical advice on your USP, marketing, promotion, budgets and financial management.  The sessions are led by our specialist trainer, Max Comfort.  Please note, workshops run from 09:30-1700 and lunch is included. They are open to final year BA/MA arts students and first year graduates? from Universities and Colleges registered with DBACE 2016. These workshops are very popular, if you need to cancel please do so 3 days prior to the event to ensure other students can attend. ?Please bring your student union card with you. About Max Comfort After 25 years in architecture and master planning, Max reinvented himself as a project manager  and ethical business advisor, mentor, executive coach, trainer and occasional author. He helps graduate students and young entrepreneurs to prepare and plan their professional careers, to grow their confidence, particularly around presentation and pricing, and to build strong bridges between art, innovation and business. Click here to see what happened last year"
}