{
    "addr": "University College London. 2nd Floor Wilkins Building, Gower Street. London, London WC1E 6BT GB", 
    "title": "Lex specialis in the WTO", 
    "url": "http://www.eventbrite.co.uk/e/lex-specialis-in-the-wto-tickets-18888094800", 
    "location": "London, United Kingdom", 
    "starttime": "2016-01-20T18:00:00+00:00", 
    "endtime": "2016-01-20T19:00:00+00:00", 
    "categories": [
        "Government \\u0026 Politics", 
        "Conference"
    ], 
    "desc": "Lexis specialis  in the WTO on Wednesday 20 January 2016, 6pm-7.30pm at UCL Gustave Tucket Lecture Theatre (2nd Floor, Wilkins Building), Gower Street, London WC1E 6BT ? Speaker: Dr Lorand Bartels (University of Cambridge) Chair: Dr Danae Azaria (UCL) ? About this event: ? WTO law provides an excellent case study for anyone interested in the phenomenon of overlapping and conflicting treaties. WTO law is comprised of a constitutional agreement (usually called the ?Marrakesh Agreement?) and four Annexes. Annex 1 is subdivided into three separate annexes, and one of these, Annex 1A, is further subdivided into another twelve self-standing agreements. It frequently happens that more than one agreement has a bearing on a particular factual issue, and it is necessary to determine which of these provisions is applicable. For various reasons, this question is usually determined from the perspective of the principle of  lex specialis . This presentation will examine the way that WTO law treats this principle, and what this might mean for international law more generally. ? About the Speaker ?Dr Lorand Bartels is a University Senior Lecturer in Law in the Faculty of Law and a Fellow of Trinity Hall at the University of Cambridge, where he teaches international law, WTO law and EU law. He is a member of the ILA's study group on free trade agreements and of the Executive Council of the Society of International Economic Law, which he helped to establish, and is also a general editor of the Cambridge International Trade and Economic Law Series (CUP)."
}