{
    "addr": "Wilkins Building. Gower Street. London WC1E 6BT GB", 
    "title": "UCL CLP: Democracy, Separation of Powers and International Treaty-Making", 
    "url": "http://www.eventbrite.co.uk/e/ucl-clp-democracy-separation-of-powers-and-international-treaty-making-tickets-18153655071", 
    "location": "London, United Kingdom", 
    "starttime": "2016-02-11T18:00:00+00:00", 
    "endtime": "2016-02-11T19:00:00+00:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "CURRENT LEGAL PROBLEMS? LECTURE SERIES 2015-16         Democracy, Separation of Powers and International Treaty-Making by Professor Gertrude Luebbe-Wolff, German Constitutional Court Chair TBC ? on Thursday 11th February 2016, from 6-7pm Venue:  UCL Main Campus,? Gustave Tuck Lecture Theatre? ? Accredited with  1 CPD hour  by the  Solicitors Regulation Authority and the Bar Standards Board ? About this lecture:         Great parts of national legislation are nowadays produced in the form or under the direction of either supranational (EU) law or international treaties. This lecture will explore how this affects the roles of parliament and of the executive in our national and supranational systems of separate powers, and whether in the present conditions, legal rules and practices of treaty-making at both national and supranational levels secure sufficient democratic control of legislative decision making. Free trade agreements such as the currently negotiated TTIP (Transatlantic Trade and Investment Partnership) serve as examples. ? About the speaker:? Gertrude L?bbe-Wolff (b.1953) is Professor of Public Law at the University of Bielefeld and was Associate Justice of the Federal Constitutional Court (Second Senate) from 2002-2014. She studied Law at the Universities of Bielefeld and Freiburg and at Harvard Law School (LL.M.). From 1988-1992 she was Director of the Water Protection and General Environmental Matters Department of the municipal administration of Bielefeld. Since 1992 she has been Professor of Public Law at the University Bielefeld. She served as Chairperson of the German Council of Environmental Advisors from 2000-2002, as the Executive Director of the Centre for Interdisciplinary Research at the University of Bielefeld from 1996 to 2002, and was member of the board of various national academic and professional societies in the years 1994-2002. Professor L?bbe-Wolff received the Leibniz Award granted by the German Research Foundation in 2000, the Hegel Prize of the City of Stuttgart in 2012, and an honoris causa doctoral degree from the European University Institute in 2015. She is an honorary bencher of Middle Temple Inn."
}