{
    "addr": "Wilkins Building. Gower Street. London WC1E 6BT GB", 
    "title": "UCL CLP: Just Restitution is a Better Concept than Unjust Enrichment", 
    "url": "http://www.eventbrite.co.uk/e/ucl-clp-just-restitution-is-a-better-concept-than-unjust-enrichment-tickets-18163580759", 
    "location": "London, United Kingdom", 
    "starttime": "2016-05-12T18:00:00+01:00", 
    "endtime": "2016-05-12T19:00:00+01:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "CURRENT LEGAL PROBLEMS? LECTURE SERIES 2015-16         Just Restitution is a Better Concept than Unjest Enrichment by Professor Peter Watts, The University of Auckland New Zealand Chair TBC ? on Thursday 12th May 2016, from 6-7pm Venue:   UCL Gustave Tuck Lecture Theatre Accredited with  1 CPD hour  by the  Solicitors Regulation Authority and the Bar Standards Board ? About this lecture:         The underlying basis, or bases, of the law of restitution has been a greatly unsettled topic in the common law for a long time. From about 1990, the common law of England and Wales began to accept that a principle of unjust enrichment was the basis of the subject; unwarranted benefits obtained by a defendant should be surrendered to the claimant. By 2007, English law had become committed to the principle, and it has continued to expand since then as a mechanism that potentially scrutinises all potential increases in another?s wealth where the claimant can establish a sufficient connection to that increase. In contrast, Australian common law first waxed, then waned, on the principle. Many Australian jurists consider that one cannot create a firm principle or set of principles based on unjust enrichment. New Zealand courts have also been equivocal on the general issue. The focus of much criticism in Australia has been on the concept of ?unjustness?. This paper will propose that the more problematic element in the putative principle is that of ?enrichment?. In the result, the English concept of unjust enrichment is both too broad and too narrow to be a satisfactory legal concept. In particular, the concept of an increase in wealth ought not by itself to trigger legal scrutiny. Citizens increase one another?s wealth in innumerable ways in their day-to-day interactions and the law should not start from an assumption that such increases need to be justified. On the other hand, there are very many (perhaps most) well-established restitutionary fact patterns where enrichment is absent or irrelevant as a moral driver of the law. Forcing these into a concept of unjust enrichment causes, or is likely to cause, distortion. The author first addressed these issues in print in 1995, but the paper for this lecture proposes to revisit the themes of that paper in the light of a great deal of subsequent case law and scholarship. About the speaker:? Professor Peter Watts is a graduate of the University of Canterbury, New Zealand, and of the University of Cambridge. He has been a member of the Law Faculty at The University of Auckland since 1985. His principal teaching and research interests are in the law of agency, company law, and the law of restitution. He is the General Editor of Bowstead & Reynolds on Agency, having carried principal responsibility for the 19th and 20th editions. His other books include P Watts, N Campbell and C Hare, Company Law in New Zealand (2011) and P Watts Directors? Powers and Duties (2nd ed 2015). He is the New Zealand Contributing Editor for the Restitution Law Review, and has been a regular contributor to the Law Quarterly Review for 25 years, as well as other leading law journals, on a wide range of aspects of the common law and equity. He is a door tenant at Fountain Court Chambers, The Temple, London. In 2013, he was made a New Zealand Queen?s Counsel, and in 2014 a Fellow of the Royal Society of New Zealand."
}