{
    "addr": "Chelsea London SW10 0QH GB", 
    "title": "Discover London", 
    "url": "http://www.eventbrite.co.uk/e/discover-london-tickets-16295329770?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Travel \\u0026 Outdoor", 
        "Tour"
    ], 
    "desc": "In stable double kayaks, guided by our highly trained instructors, the Discover London Experience takes you to the heart of London. Kayak up to the foot of the London Eye, see the Houses of Parliament and?the world famous MI6 building from?a unique?vantage point...it?s the best possible way to really experience the sights and sounds of central London. With the tide assisting us,   you'll glide past?HMS Belfast to Tower Bridge, seeing St Paul?s Cathedral and the once-thriving docks that brought London its wealth. Once we reach Tower Bridge, we'll?leave the kayaks for a while to enjoy warm food and?drinks, all included in the price of your experience. ? Times available change to take advantage of the tide. After your meal, we get back into?our boats and paddle back to our starting point with the new flood tide to help us.? Hot showers and warm changing rooms will greet you on your return and all the pubs and restaurants of the King's Road Chelsea are moments away. Booking Terms and Conditions: ? Please note that all Kayaking London events and tours are for adults (over 18) and must be paid for in advance. Once you have received booking confirmation for your chosen activity you must attend on the agreed date unless you give us at least 72 hours notice to cancel your booking or to request to change of tour date (the latter option cannot be guaranteed). If you provide sufficient notice, of 72 hours or more, your payment will be refunded, less a ?5 cancellation fee.  If you cancel your booking within 72 hours of your agreed session or ask to change tour dates, you will still be liable for paying the full charges of your chosen activity. Buying tickets for any Kayaking London event confirm that you accept these terms."
}