{
    "addr": "London, London EC3N 4DJ GB", 
    "title": "Wren, Romans and Liverymen: A brief history of The City of London", 
    "url": "http://www.eventbrite.co.uk/e/wren-romans-and-liverymen-a-brief-history-of-the-city-of-london-tickets-19226662465?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-26T18:45:00+00:00", 
    "endtime": "2015-11-26T20:45:00+00:00", 
    "categories": [
        "Travel \\u0026 Outdoor", 
        "Tour"
    ], 
    "desc": "Wren, Romans and Liverymen:?A brief history of The City of London. All Londoners know that this is the where the  real  London lies; The City, the Square Mile, the historic beating heart of London?founded by the Romans.? A walk covering nearly 2000 years of history in under two hours and a must-do for Londoners and visitors alike.? Because until you know The City, you don?t really know London... On the walk you?ll hear about: the arrival (and departure) of the Romans; the livery companies that?ran trade in?The City of London with an iron grip for nearly 600 years; the enterprising Italians that established our currency and banking systems; the growth of the great trading houses from their humble coffee house beginnings; ?the post-reformation double tragedy of The Great Plague and The Great Fire; the rebuilding of the City and the great Sir Christopher Wren;?the City?s transformation from a place of residence to a place of work (with a little Victorian Grand philanthropy along the way); and the gleaming glass towers that now dominate the skyline. The walk commences at?Tower Hill Underground (meet on the sundial patio up a short staircase directly outside the station exit - please note: there are currently extensive building works in the area but the sundial patio is still accessible via the stairs on the western side between the patio and Trinity Square Gardens)?and finishes near St Paul?s Underground. Read some?TripAdvisor reviews of the walk  here ,  here  and  here ?and a review of the walk one of my guests kindly wrote for her own website  here . You can check?your travel options at the  TFL Journey Planner ."
}