{
    "addr": "96 Euston Road London, London NW1 2DB GB", 
    "title": "Get Cash Flow Confident!", 
    "url": "http://www.eventbrite.co.uk/e/get-cash-flow-confident-tickets-6297061681?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "", 
    "endtime": "", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "Get Cash Flow Confident! ? Uncertain about Cash Flow Forecasting? Feeling finance is getting out of control? Confused by your accountant?  Struggling with your business model?? Apprehensive about VAT? ? If so, come along to ? Get Cash Flow Confident ' which is a practical and stress-free way to get the financial knowledge, confidence and tools you need to develop a winning business model and understand the language of finance. ? By attending this workshop you will become more confident: ? You will be surrounded by like-minded entrepreneurs and you can bring a laptop if you wish to start work on the numbers in the workshop.  ? This interactive workshop will give you a range of practical tools and methods which you can implement straight away as well a s a good foundation in business finance theory. ? As part of the workshop, you will also receive: ? About Johnny Martin FCA Johnny Martin FCA is an experienced Finance Director who has  sold 3 businesses on behalf of Baring Venture Partners, JO Hambro and Monument Trust. He  now demystifies business for entrepreneurs. ?He is a partner at the British Library Business & IP Centre and he is the Financial Fitness Coach for Intuit (who make leading accounting software Quickbooks). He is a regular columnist for Better Business and the Guardian Small Business Network. He also runs his own self-storage business in Somerset. Recent feedback on my workshops: ? ?I just wanted to say a huge ?thank you? for last night?s session at the British Library. It was unbelievably useful ? I had a few real ?eureka!? moments. I can?t get over how satisfying it is to see the numbers finally making sense.??  Hermione Taylor"
}