{
    "addr": "21 Albemarle Street London, England W1S 4BS GB", 
    "title": "MdS UK Expo 2015", 
    "url": "http://www.eventbrite.co.uk/e/mds-uk-expo-2015-tickets-17796126694?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-28T09:00:00+00:00", 
    "endtime": "2015-11-28T17:30:00+00:00", 
    "categories": [
        "Sports \\u0026 Fitness", 
        "Race or Endurance Event"
    ], 
    "desc": "INVITATION ? MdS UK Expo 2015 ? ? Saturday 28 th ?November 2015 from 0900 to 1730 ? To celebrate the 30th Year of the Marathon des Sables, you are invited to attend this exciting one day event aimed at all prospective Marathon des Sables UK & Irish entrants. ? We are really pleased to announce that this year?s entry to the event will be  FREE  for all 2016 MdS Entrants. To guarantee your place, you will need to pay a (refundable) reservation fee of ?50 pp. The ?50 fee will be refunded to you by the 4th December.?In the event of you not attending, your fee will be donated to the organisers' charity (Solidarite Marathon des Sables), If you wish to bring someone to the event who is NOT running the 2016 MdS, they will have to pay the ?50 entrance fee and will not be entitled to receiver the MdS backpack. ? Additionally, All 2016 MdS entrants will receive a? Complimentary MdS rucksack - ?RRP ?189 ? What you will get from the day:? Hear ? keynote speakers tell their stories, Listen  to sports professionals talk ultra-running and MdS preparation, ? P articipate  in workshops on nutrition, hydration, training, Shop  from a comprehensive selection of the latest gear and equipment. ? This is also an opportunity to meet other competitors past, present and future and pick up tips and advice from their experiences. ? Highlights  of the day include talks by  Keynote speakers : ? Additionally we have: ? ? Workshop  speakers including: ? ? Exhibitors  include: ? LUNCH:  is sponsored by  EXPEDITION FOODS who will be offering a selection of delicious?light- weight meals for you to try! ? WHAT'S MORE :  We will have an afternoon discussion panel of experienced past runners with their MdS tips for ?finishing, but still smiling? ? AND :  Our ?snack sponsors?: ? BOUNCE FOODS  will provide us with Bounce Balls, delicious and healthy snacks made from 100% natural ingredients"
}