{
    "addr": "Wilkins Building. Gower Street. London WC1E 6BT GB", 
    "title": "UCL CLP: The Constitution and Foreign Affairs", 
    "url": "http://www.eventbrite.co.uk/e/ucl-clp-the-constitution-and-foreign-affairs-tickets-18152048265?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-26T18:00:00+00:00", 
    "endtime": "2015-11-26T19:00:00+00:00", 
    "categories": [
        "Other", 
        "Seminar or Talk"
    ], 
    "desc": "CURRENT LEGAL PROBLEMS? LECTURE SERIES 2015-16         The Constitution and Foreign Affairs by Professor Thomas Poole, London School of Economics Chaired by Professor Dapo Akande, University of Oxford ? on Thursday 26th November 2015, from 6-7pm Venue:  UCL Main Campus,? Gustave Tuck Lecture Theatre? ? Accredited with  1 CPD hour  by the  Solicitors Regulation Authority and the Bar Standards Board ? About this lecture:         We have a blindspot when it comes to the constitutional implications of foreign affairs. Events in this sphere tend to fall into one of two gaps: between domestic public law and international law, or between law and politics. Courts experience problems in categorising the cases that arise: they fall within the sphere of the prerogative (whatever quite that is) or are treated as ?political questions?. The situation is compounded by the absence of a written constitution, which tends to specify a foreign relations power. Two developments make this lacuna increasingly problematic. First, the significant increase in cases invoking the foreign relations power. Since 9/11 in particular, the courts are very frequently being asked to judge matters relating to the expression of state power abroad, whether in its ?hard? form (e.g. the deployment of armed force) or in ?softer? forms (e.g. the bribery of foreign officials). Second, the density of international and transnational law that now exists makes it harder to conceptualise this extra-territorial space as one in which law has no real jurisdiction. Exploring the dramatic juridical landscape produced by such cases as  Belmarsh, Bancoult, Corner House, Noor Khan, Belhaj, Abbasi, Binyam Mohamed  and other Guantanamo Bay cases, the lecture draws on both historical and comparative sources to offer a coherent and normatively engaged account of the emerging public law principles governing the exercise of the foreign relations power. ? About the speaker:? Thomas studied at University College London, the University of Oxford and Manchester University. Before coming to the LSE in 2006, he taught at the University of Nottingham. He has held visiting professorships at the University of New South Wales (2003-6), the European University Institute (2007), the University of Toronto (2008), Princeton University (2008-9) and the Universit? Paris II Panth?on-Assas (2013-5). Tom is an articles editor at the  Modern Law Review . Thomas writes on public law and constitutional theory. He is author of  Reason of State: Law, Prerogative and Empire  (Cambridge, 2015) and co-editor of  Hobbes and the Law  (Cambridge, 2012) and  Law, Liberty and State: Oakeshott, Hayek and Schmitt on the Rule of Law  (Cambridge, 2015), both with David Dyzenhaus. His next book,  The Law Lords and Human Rights  (Oxford University Press), written with Sangeeta Shah and Michael Blackwell, comes out in Summer 2016."
}