{
    "addr": "London, Gt Lon NW1 4SA GB", 
    "title": "Lance Uggla, Founder of Markit, Speaks at TELL Series, London", 
    "url": "http://www.eventbrite.co.uk/e/lance-uggla-founder-of-markit-speaks-at-tell-series-london-tickets-19461862956?aff=ebrowse", 
    "location": "London, United Kingdom", 
    "starttime": "2015-11-25T18:45:00+00:00", 
    "endtime": "2015-11-25T21:00:00+00:00", 
    "categories": [
        "Business \\u0026 Professional", 
        "Class, Training, or Workshop"
    ], 
    "desc": "SPEAKER Lance Uggla, Founder and CEO of Markit Lance Uggla founded Markit in 2003 and serves as its Chief Executive Officer, leading Markit?s strategic development and managing its day-to-day operations. He has overseen Markit?s growth from a startup to a global company with over 3,000 employees in more than 20 offices worldwide, serving over 3,000 customers. ? In 2012, Lance Uggla won Ernst & Young?s UK Entrepreneur Of The Year. He also won Risk Magazine?s Lifetime Achievement Award in the same year. ? He served as Vice Chair, Head of Europe and Asia at Toronto-Dominion Securities and was responsible for building all offshore debt capital markets activities including its Investment Grade credit trading portfolios, which total more than $15 billion. ? Prior to joining TD Securities in 1995, he served as Vice Chair, Head of Global Fixed Income at CIBC World Markets, where he spent nine years. ? He graduated from the Simon Fraser University in Canada with a BBA and holds an MSc from the London School of Economics.  He was also awarded Winner of Simon Fraser University's Outstanding Alumni Award for Professional Achievement PRICE FREE of charge , however, you need to register below to attend. If you can no longer attend the event, please cancel your ticket as soon as possible via Eventbrite (click here for instructions: http://help.eventbrite.co.uk/customer/en_gb/portal/articles/581556). WHEN Wednesday, 25 November, 2015 ? 6.45pm ? Registration ? 7.00pm ? Event Commences ? 8.00pm ? Networking Reception Our events are often oversubscribed.?Please cancel your ticket if you can no longer attend to give that opportunity to?someone else.  ? WHERE London Business School, Regents Park, NW1 4SA? Please arrive before 6:40pm to check off your name and collect your name badge at the registration desk in the Sainsbury reception at London Business School. You do NOT need to print this ticket. LBS students , please bring your LBS name badges to the event.? In the interest of the environment, we will only print name badges for non-students. Thank you for understanding. FUTURE TELL EVENTS Please visit our website to sign up to our newsletter and for more details on future events:  http://tellseries.com"
}